
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство( "УчетнаяЗапись" ) И ЗначениеЗаполнено( Параметры.УчетнаяЗапись ) Тогда
		УчетнаяЗапись = Параметры.УчетнаяЗапись;
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Элементы.ДекорацияНадпись.Заголовок = СтрШаблон(Элементы.ДекорацияНадпись.Заголовок, УчетнаяЗапись );
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УдалитьИнтеграцию(Команда)
	ЯндексМаркетУчетнаяЗаписьУдалитьНаСервере();
	Оповестить( "УдалениеИнтеграцииМаркетплейса", УчетнаяЗапись, ЭтаФорма );
	Закрыть(Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЯндексМаркетУчетнаяЗаписьУдалитьНаСервере()
	ИнтеграцияСЯндексМаркетСервер.ЯндексМаркетУчетнаяЗаписьУдалить( УчетнаяЗапись );
КонецПроцедуры

#КонецОбласти
