#Область СлужебныеПроцедурыИФункции

Функция ИменаКонтролируемыхРеквизитов(Объект) Экспорт
	
	Возврат ИнтеграцияУправлениеПерсоналомСобытияБазовый.ИменаКонтролируемыхРеквизитов(Объект);

КонецФункции

Процедура ОбработчикПриЗаписиОбъекта(Источник) Экспорт
	
	// в базовой реализации не переопределяется
	
КонецПроцедуры

Процедура ЗарегистрироватьОбновлениеРуководителейПодразделений(ПозицииШР) Экспорт

	// в базовой реализации не переопределяется

КонецПроцедуры

Процедура ТекущиеКадровыеДанныеСотрудниковПередЗаписью(НаборЗаписей) Экспорт

	ИнтеграцияУправлениеПерсоналомСобытияБазовый.ТекущиеКадровыеДанныеСотрудниковПередЗаписью(НаборЗаписей);

КонецПроцедуры

Процедура ТекущиеКадровыеДанныеСотрудниковПриЗаписи(НаборЗаписей) Экспорт

	ИнтеграцияУправлениеПерсоналомСобытияБазовый.ТекущиеКадровыеДанныеСотрудниковПриЗаписи(НаборЗаписей);

КонецПроцедуры

Процедура ПлановыеУдержанияПередЗаписью(НаборЗаписей) Экспорт

	// в базовой реализации не переопределяется

КонецПроцедуры

Процедура ПлановыеУдержанияПриЗаписи(НаборЗаписей) Экспорт

	// в базовой реализации не переопределяется
	
КонецПроцедуры

Процедура КлассыУсловийТрудаПоДолжностямПриЗаписи(ТаблицаИзменившихсяДанныхНабора) Экспорт

	// в базовой реализации не переопределяется

КонецПроцедуры

#КонецОбласти

