
#Область СлужебныйПрограммныйИнтерфейс

// См. Интеграция1СШтампКлиентСервер.НовыеПараметрыДобавленияШтамповВДокумент
Функция НовыеПараметрыДобавленияШтамповВДокумент() Экспорт
	
	ПараметрыДобавления = Новый Структура;
	ПараметрыДобавления.Вставить("ПараметрыДокумента", НовыеПараметрыДокумента());
	ПараметрыДобавления.Вставить("ПараметрыШтампов"  , Новый Массив);
	
	Возврат ПараметрыДобавления;
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.НовыеПараметрыШтампа
Функция НовыеПараметрыШтампа() Экспорт
	
	ПараметрыШтампа = Новый Структура;
	
	ПараметрыШтампа.Вставить("ПараметрыШтампа"             , НовыеПараметрыФайлаШтампа());
	ПараметрыШтампа.Вставить("ПараметрыРазмещения"         , НовыеПараметрыРазмещения());
	ПараметрыШтампа.Вставить("ПравилаРасположения"         , НовыеПравилаРасположения());
	ПараметрыШтампа.Вставить("ОтступОтГраниц"              , 0);
	ПараметрыШтампа.Вставить("КоэффициентИзмененияРазмера" , 0);
	ПараметрыШтампа.Вставить("Настройки"                   , НовыеНастройкиШтампа());
	
	Возврат ПараметрыШтампа;
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.ДопустимыеРасширенияФайловШтампов
Функция ДопустимыеРасширенияФайловШтампов() Экспорт
	
	МассивРасширений = Новый Массив;
	МассивРасширений.Добавить(".PNG");
	МассивРасширений.Добавить(".JPEG");
	МассивРасширений.Добавить(".JPG");
	МассивРасширений.Добавить(".SVG");
	
	Возврат МассивРасширений;
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.МассивВариантовРасположенияШтамповНаСтраницеДокумента
Функция МассивВариантовРасположенияШтамповНаСтраницеДокумента() Экспорт
	
	ВариантыРасположения = Новый Массив;
	
	ВариантыРасположения.Добавить(ВариантРасположенияВверхуСлева());
	ВариантыРасположения.Добавить(ВариантРасположенияВверхуСправа());
	ВариантыРасположения.Добавить(ВариантРасположенияВверхуПоЦентру());
	ВариантыРасположения.Добавить(ВариантРасположенияВнизуСлева());
	ВариантыРасположения.Добавить(ВариантРасположенияВнизуСправа());
	ВариантыРасположения.Добавить(ВариантРасположенияВнизуПоЦентру());
	ВариантыРасположения.Добавить(ВариантРасположенияПоКоординатам());
	
	Возврат ВариантыРасположения;
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.МассивПравилРасположенияШтамповВДокументе
Функция МассивПравилРасположенияШтамповВДокументе() Экспорт
	
	ПравилаРасположения = Новый Массив;
	
	ПравилаРасположения.Добавить(ПравилоРасположенияНаКаждойСтранице());
	ПравилаРасположения.Добавить(ПравилоРасположенияНаПервойСтранице());
	ПравилаРасположения.Добавить(ПравилоРасположенияНаПоследнейСтранице());
	ПравилаРасположения.Добавить(ПравилоРасположенияНаКаждойСтраницеКромеПоследней());
	ПравилаРасположения.Добавить(ПравилоРасположенияНаКонкретнойСтранице());
	
	Возврат ПравилаРасположения;
	
КонецФункции

// Проверяет, может ли сервис 1С:Штамп работать с файлом.
//
// Параметры:
//  Расширение - Строка - Расширение файла для отправки в сервис 1С:Штамп
//
// Возвращаемое значение:
//  Булево - 
//
Функция РасширениеОсновногоФайлаПоддерживается(Расширение) Экспорт
	
	Расширения = ПоддерживаемыеРасширенияФайловДляШтампирования();
	
	Возврат Расширения.Найти(НРег(Расширение)) <> Неопределено;
	
КонецФункции

// Возвращает макисимальный размер тела исходящего запроса.
//
// Возвращаемое значение:
//   Число - допустимый размер исходящего тела запроса (5 Мб).
//
Функция ДопустимыйРазмерИсходящегоТелаЗапроса() Экспорт
	
	Возврат 5242880;
	
КонецФункции

#Область ЗначенияКонстантПоУмолчанию

// См. Интеграция1СШтампКлиентСервер.ЗначениеОтступаОтКраевСтраницыПоУмолчанию
Функция ЗначениеОтступаОтКраевСтраницыПоУмолчанию() Экспорт
	
	Возврат 10;
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.ЗначениеКоэффициентаПрозрачностиШтампаПоУмолчанию
Функция ЗначениеКоэффициентаПрозрачностиШтампаПоУмолчанию() Экспорт
	
	Возврат 128;
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.ЗначениеПрозрачностиПрозрачный
Функция ЗначениеПрозрачностиПрозрачный() Экспорт
	
	Возврат "Прозрачный";
	
КонецФункции

#КонецОбласти

#Область Словарь

// См. Интеграция1СШтампКлиентСервер.ВариантРасположенияВверхуСлева
Функция ВариантРасположенияВверхуСлева() Экспорт
	
	Возврат "ЛевыйВерхнийУгол";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.ВариантРасположенияВверхуСправа
Функция ВариантРасположенияВверхуСправа() Экспорт
	
	Возврат "ПравыйВерхнийУгол";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.ВариантРасположенияВверхуПоЦентру
Функция ВариантРасположенияВверхуПоЦентру() Экспорт
	
	Возврат "ВверхуПоЦентру";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.ВариантРасположенияВнизуСлева
Функция ВариантРасположенияВнизуСлева() Экспорт
	
	Возврат "ЛевыйНижнийУгол";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.ВариантРасположенияВнизуСправа
Функция ВариантРасположенияВнизуСправа() Экспорт
	
	Возврат "ПравыйНижнийУгол";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.ВариантРасположенияВнизуПоЦентру
Функция ВариантРасположенияВнизуПоЦентру() Экспорт
	
	Возврат "ВнизуПоЦентру";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.ВариантРасположенияПоКоординатам
Функция ВариантРасположенияПоКоординатам() Экспорт
	
	Возврат "ПоКоординатам";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.ПравилоРасположенияНаКаждойСтранице
Функция ПравилоРасположенияНаКаждойСтранице() Экспорт
	
	Возврат "НаКаждойСтранице";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.ПравилоРасположенияНаПервойСтранице
Функция ПравилоРасположенияНаПервойСтранице() Экспорт
	
	Возврат "НаПервойСтранице";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.ПравилоРасположенияНаПоследнейСтранице
Функция ПравилоРасположенияНаПоследнейСтранице() Экспорт
	
	Возврат "НаПоследнейСтранице";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.ПравилоРасположенияНаКаждойСтраницеКромеПоследней
Функция ПравилоРасположенияНаКаждойСтраницеКромеПоследней() Экспорт
	
	Возврат "НаКаждойСтраницеКромеПоследней";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.ПравилоРасположенияНаКонкретнойСтранице
Функция ПравилоРасположенияНаКонкретнойСтранице() Экспорт
	
	Возврат "НаКонкретнойСтранице";
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Конструкторы

// Возвращает конструктор параметров документа
//
// Возвращаемое значение:
// 	Структура: 
//    * ДвоичныеДанные - ДвоичныеДанные - Двоичные данные документа.
//    * Расширение     - Строка         - Значение расширения файла.
//
Функция НовыеПараметрыДокумента()
	
	ПараметрыДокумента = Новый Структура;
	
	ПараметрыДокумента.Вставить("ДвоичныеДанные" , Неопределено);
	ПараметрыДокумента.Вставить("Расширение"     , "");
	
	Возврат ПараметрыДокумента;
	
КонецФункции

// Возвращает конструктор параметров штампа
//
// Возвращаемое значение:
// 	Структура: 
//    * ДвоичныеДанные - ДвоичныеДанные - Двоичные данные файла картинки штампа.
//    * Расширение     - Строка         - Значение расширения файла картинки штампа.
//
Функция НовыеПараметрыФайлаШтампа()
	
	ПараметрыШтампа = Новый Структура;
	
	ПараметрыШтампа.Вставить("ДвоичныеДанные" , Неопределено);
	ПараметрыШтампа.Вставить("Расширение"     , "");
	
	Возврат ПараметрыШтампа;
	
КонецФункции

// Возвращает конструктор параметров размещения картинки штампа на странице документа.
//
// Возвращаемое значение:
// 	Структура: 
//    * Координаты - Структура - Данные координат размещения в пикселях:
//      ** Верх - Число - Значение отступа в пикселях от верхней границы страницы документа.
//      ** Лево - Число - Значение отступа в пикселях от левой границы страницы документа.
//    * Расположение  - Строка - Значение расположения картинки штампа на странице документа.
//          Значение по умолчанию: ВариантРасположенияВнизуПоЦентру.
//    * НомерСтраницы - Число - Номер страницы документа для расположения картинки штампа.
//          Значение по умолчанию: 1.
//
Функция НовыеПараметрыРазмещения()
	
	ПараметрыРазмещения = Новый Структура;
	ПараметрыРазмещения.Вставить("Координаты"   , Новый Структура("Верх, Лево",0,0));
	ПараметрыРазмещения.Вставить("Расположение" , ВариантРасположенияВнизуПоЦентру());
	
	Возврат ПараметрыРазмещения;
	
КонецФункции

// Возвращает конструктор правил расположения картинки штампа на страницах документа.
//
// Возвращаемое значение:
// 	Структура: 
//    * ПравилоРасположения - Строка - Значение правила размещения картинки штампа на страницах документа.
//          Значение по умолчанию: НаКаждойСтранице.
//    * НомерСтраницы - Число - Номер страницы документа для расположения картинки штампа.
//          Используется для правила размещения: НаКонкретнойСтранице.
//          Значение по умолчанию: 1.
//
Функция НовыеПравилаРасположения()
	
	ПравилаРасположения = Новый Структура;
	
	ПравилаРасположения.Вставить("ПравилоРасположения" , ПравилоРасположенияНаКаждойСтранице());
	ПравилаРасположения.Вставить("НомерСтраницы"       , 1);
	
	Возврат ПравилаРасположения;
	
КонецФункции

// Возвращает конструктор настройки картинки штампа на странице документа
//
// Возвращаемое значение:
// 	Структура: 
//    * Прозрачность - Структура - Настройки прозрачности картинки штампа:
//      ** Прозрачный - Булево - Признак использования прозрачности.
//      ** Уровень    - Число  - Значение уровня прозрачности от 0 до 255, где 0 - 100% значение прозрачности.
//
Функция НовыеНастройкиШтампа()
	
	НастройкиШтампа = Новый Структура;
	НастройкиШтампа.Вставить("Прозрачность", Новый Структура("Прозрачный, Уровень", Ложь, 0));
	
	Возврат НастройкиШтампа;
	
КонецФункции

#КонецОбласти

// Возвращает массив допустимых расширений файлов для штампирования
//
// Возвращаемое значение:
//  Массив Из Строка - Массив строк расширений.
//
Функция ПоддерживаемыеРасширенияФайловДляШтампирования()
	
	МассивРасширений = Новый Массив;
	МассивРасширений.Добавить("pdf");
	МассивРасширений.Добавить("doc");
	МассивРасширений.Добавить("docx");
	МассивРасширений.Добавить("odt");
	МассивРасширений.Добавить("ods");
	МассивРасширений.Добавить("xls");
	МассивРасширений.Добавить("xlsx");
	
	Возврат МассивРасширений;
	
КонецФункции

#КонецОбласти
