
#Область ПрограммныйИнтерфейс

Процедура ОбработатьПроизвольноеДействиеСообщенияАссистента(ОписаниеСообщения) Экспорт
	ДанныеДляПерехода = ОписаниеСообщения.Данные;
	Если ОписаниеСообщения.ВыбранноеДействие = "ПерейтиКЗадачеПоНалогам" Тогда
		Если ТипЗнч(ДанныеДляПерехода) = Тип("Структура") Тогда
			ОткрытьФорму(ДанныеДляПерехода.ИмяФормыЗадачи, ДанныеДляПерехода.ПараметрыОткрытия);
			Возврат;
		КонецЕсли;
	ИначеЕсли ОписаниеСообщения.ВыбранноеДействие = "ПерейтиККУДиР" Тогда
		Если ТипЗнч(ДанныеДляПерехода) = Тип("Структура") Тогда
			ПараметрыФормы = Новый Структура("Организация", ДанныеДляПерехода.ПараметрыОткрытия.Организация);
			ОткрытьФорму("Документ.ЗаписиУСН.Форма.ФормаСпискаЗаписиПрочие", ПараметрыФормы);
		КонецЕсли;
	ИначеЕсли ОписаниеСообщения.ВыбранноеДействие = "ПерейтиКПоказателямПоЕНВД" Тогда
		Если ТипЗнч(ДанныеДляПерехода) = Тип("Структура") Тогда
			ОткрытьФорму("Документ.ПоказателиЕНВД.ФормаОбъекта", ДанныеДляПерехода.ПараметрыОткрытия);
		КонецЕсли;
	ИначеЕсли ОписаниеСообщения.ВыбранноеДействие = "ОткрытьРасчетПотребностейМинимальныеОстаткиЗапасов" Тогда
		ЗаголовокПодборкиСпискаНоменклатуры = СтрШаблон(НСтр("ru='Рекомендации Даши (%1)'"), ОписаниеСообщения.Данные.Номенклатура.Количество());
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СпособПополнения", "Закупки");
		ПараметрыФормы.Вставить("Организация", ОписаниеСообщения.Данные.Организация);
		ПараметрыФормы.Вставить("Склад", ОписаниеСообщения.Данные.СтруктурнаяЕдиница);
		ПараметрыФормы.Вставить("Номенклатура", ОписаниеСообщения.Данные.Номенклатура);
		ПараметрыФормы.Вставить("ЭтоНоменклатураПодборкаАссистента", Истина);
		ПараметрыФормы.Вставить("ЗаголовокПодборкиСпискаНоменклатуры", ЗаголовокПодборкиСпискаНоменклатуры);
		ОткрытьФорму("Обработка.РасчетПотребностей.Форма.Форма", ПараметрыФормы);
	ИначеЕсли ОписаниеСообщения.ВыбранноеДействие = "Подробнее..." Тогда
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("СценарийПланирования", ПредопределенноеЗначение("Справочник.СценарииПланирования.Фактический"));
		ПараметрыОтбора.Вставить("Группировка", ПредопределенноеЗначение("Перечисление.ГруппировкаАнализаБизнеса.Показатели"));
		ПараметрыОтбора.Вставить("ПланФакт", ПредопределенноеЗначение("Перечисление.ПланФакт.Факт"));
		ПараметрыОтбора.Вставить("НачалоПериода", ДанныеДляПерехода.НачалоПериода);
		ПараметрыОтбора.Вставить("КонецПериода", ДанныеДляПерехода.КонецПериода);
		ПараметрыОтбора.Вставить("ПланФакт", ПредопределенноеЗначение("Перечисление.ПланФакт.Факт"));
		ПараметрыОтбора.Вставить("АктивныйОтчет", ДанныеДляПерехода.АктивныйОтчет);
		ПараметрыОтбора.Вставить("Периодичность", ДанныеДляПерехода.Периодичность);
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
		ОткрытьФорму("Отчет.АнализБизнеса.Форма.Форма", ПараметрыФормы);
	ИначеЕсли ОписаниеСообщения.ВыбранноеДействие = "ПерейтиКДокументамПлатежноеПоручение"
		Или ОписаниеСообщения.ВыбранноеДействие = "ПерейтиКДокументам" Тогда
		ОткрытьФорму("Документ.ПлатежноеПоручение.ФормаСписка");
		Оповестить("УстановитьТекущуюСтраницуПлатежноеПоручение", "СтраницаПлатежныеПоручения");
	ИначеЕсли ОписаниеСообщения.ВыбранноеДействие = "ПерейтиКСозданиюДокументовПлатежноеПоручение"
		Или ОписаниеСообщения.ВыбранноеДействие = "ПерейтиКСозданиюДокументов" Тогда
		ОткрытьФорму("Документ.ПлатежноеПоручение.ФормаСписка");
		Оповестить("УстановитьТекущуюСтраницуПлатежноеПоручение", "СтраницаРегулярныеПлатежи");
	ИначеЕсли ОписаниеСообщения.ВыбранноеДействие = "ПерейтиКДокументамРасходДСПлан" Тогда
		ОткрытьФорму("Документ.РасходДСПлан.ФормаСписка");
		Оповестить("УстановитьТекущуюСтраницуРасходДСПлан", "СтраницаЗаявкиНаРасходДенег");
	ИначеЕсли ОписаниеСообщения.ВыбранноеДействие = "ПерейтиКСозданиюДокументовРасходДСПлан" Тогда
		ОткрытьФорму("Документ.РасходДСПлан.ФормаСписка");
		Оповестить("УстановитьТекущуюСтраницуРасходДСПлан", "СтраницаРегулярныеПлатежи");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
