#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекстОшибок = Параметры.ТекстОшибок;
	Номенклатура = Параметры.Номенклатура;
	Характеристика = Параметры.Характеристика;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНоменклатуру(Команда)
	ПоказатьЗначение(, Номенклатура);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИзображенияНеПрошедшиеПроверку(Команда)
	
	ПараметрыФормы = Новый Структура("Номенклатура", Номенклатура);
	
	ОткрытьФорму("ПланОбмена.ИнтеграцияСМагазинамиСоцСетей.Форма.ФормаПроверкиИзображенийТоваров",ПараметрыФормы,ЭтаФорма,,,,,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

