
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтрокаURLОригинал = Параметры.СтрокаURL;
	СтрокаURL = СтрокаURLОригинал;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовЭлементовФормы 

&НаКлиенте
Процедура ПодтвердитьОперацию(Команда)
	
	Закрыть(СтрокаЗначениеСКартинки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьКартинкуНаСервере()
	СтрокаURL = СтрокаURLОригинал + "&t_1c=" + Новый УникальныйИдентификатор();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКартинку(Команда)
	ОбновитьКартинкуНаСервере();
КонецПроцедуры

#КонецОбласти
