
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказНарядов") Тогда 
		
		// Установим настройки формы для случая открытия в режиме выбора
		Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
		Элементы.Список.МножественныйВыбор = ?(Параметры.ЗакрыватьПриВыборе = Неопределено, Ложь, Не Параметры.ЗакрыватьПриВыборе);
		Если Параметры.РежимВыбора Тогда
			КлючНазначенияИспользования = "ВыборПодбор";
			РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		Иначе
			КлючНазначенияИспользования = "Список";
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ИспользоватьНесколькоВидовЗаказов() Тогда
		ПараметрыФормы = Новый Структура("Ключ", ПредопределенноеЗначение("Справочник.ВидыЗаказНарядов.Основной"));
		ОткрытьФорму("Справочник.ВидыЗаказНарядов.Форма.ФормаЭлемента", ПараметрыФормы);     
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ИспользоватьНесколькоВидовЗаказов() 
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказНарядов");
	
КонецФункции

#КонецОбласти
