#Область СлужебныйПрограммныйИнтерфейс

// Возвращаемое значение:
//  Структура:
//   * ОбработчикЗавершения - Неопределено - Значение по умолчанию
//                          - ОписаниеОповещения - Обработчик, который будет вызван после подготовки файла
//   * Данные               - Неопределено - значение по умолчанию.
//                          - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - объект, к которому готовится файл.
//                          - Структура:
//                            * ОбъектУчета - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - объект, к которому
//                                                                                                готовится файл.
//   * ИдентификаторОсновногоФайла - Строка - Идентификатор файла формата
//
&НаКлиенте
Функция ПараметрыПодготовкиФайла() Экспорт // АПК:78 - исключение для вызова клиентских методов.
	
	ПараметрыПодготовки = Новый Структура;
	ПараметрыПодготовки.Вставить("ОбработчикЗавершения", Неопределено);
	ПараметрыПодготовки.Вставить("Данные",               Неопределено);
	ПараметрыПодготовки.Вставить("ИдентификаторОсновногоФайла", "");
	
	Возврат ПараметрыПодготовки;
	
КонецФункции

// Параметры:
//  ПараметрыПодготовки - см. ПараметрыПодготовкиФайла
//
&НаКлиенте
Процедура НовыйФайлОбмена(ПараметрыПодготовки) Экспорт // АПК:78 - исключение для вызова клиентских методов.
	
	Если ТипЗнч(ПараметрыПодготовки.Данные) = Тип("Структура") Тогда
		ОбъектУчета = ПараметрыПодготовки.Данные.ОбъектУчета;
	Иначе
		ОбъектУчета = ПараметрыПодготовки.Данные;
	КонецЕсли;
	
	ОбменСКонтрагентамиКлиентПереопределяемый.ПриФормированииНовогоФайлаОбменаДоговорногоДокументаXML(ОбъектУчета,
		ПараметрыПодготовки.ИдентификаторОсновногоФайла, ПараметрыПодготовки.ОбработчикЗавершения);
	
КонецПроцедуры

#КонецОбласти