
#Область СлужебныеПроцедурыИФункции

Функция КоличествоДнейОтпуска(ДатаНачала, ДатаОкончания, Организация) Экспорт
	
	Возврат РасчетЗарплатыДляНебольшихОрганизаций.КоличествоДнейОтпуска(ДатаНачала, ДатаОкончания, Организация);
	
КонецФункции

Функция ЗначенияДляВыбораДокументаПоОтсутствию(ПричинаОтсутствия) Экспорт
	
	ЗначенияДляВыбора = Новый СписокЗначений;
	ЗначенияДляВыбора.Добавить(Метаданные.Документы.БольничныйЛист.ПолноеИмя(), Метаданные.Документы.БольничныйЛист.Синоним);
	
	Возврат ЗначенияДляВыбора;

КонецФункции

#КонецОбласти