////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции формирования отчетности по НДС.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

//++ НЕ УТ

#Область ЗаполнениеРегламентированнойОтчетностиПоНДС

#Область ДекларацияНДС

// Создает список показателей декларации по НДС, которые будут автоматически заполняться.
// Для версии отчета ФормаОтчета2009Кв4.
//
// Параметры:
//	ПоказателиОтчета - Структура - Структура параметров отчета.
//
Процедура ПолучитьСведенияОПоказателяхОтчетаНДСФормаОтчета2009Кв4(ПоказателиОтчета) Экспорт
	
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200001003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200002003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200003003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200006003", Истина, Ложь);			
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200007003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200008003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200009003", Истина, Ложь);

	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300001003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300002003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300003003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300004003", Истина, Ложь);			
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300006003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300007003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300007005", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300008003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300008005", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300009005", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300011005", Истина, Ложь);			
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300013003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300014003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300015003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300016003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300018003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300019003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300020003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300021003", Истина, Ложь);			
	
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000310001000", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000310002000_01", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000310002000_02", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000310002000_03", Истина, Ложь);			
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000310002000_04", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000310002000_05", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000310002000_06", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000310002000_07", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000310002000_08", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000310002000_09", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000310003000", Истина, Ложь);			
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000310004000", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000310005000", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000310006000", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000310007000", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000310008001", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000310008002", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000310008003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000310008004", Истина, Ложь);
	
КонецПроцедуры

// Рассчитывает показатели Раздела 3 Декларации НДС.
//
// Параметры:
//	СтруктураПоказателей - Структура - Данные отчета.
//
Процедура РассчитатьПоказателиРаздела3Декларации(СтруктураПоказателей) Экспорт
	
	СтруктураПоказателей.П000300001003 = Окр(СтруктураПоказателей.П000300001003);
	СтруктураПоказателей.П000300001005 = СтруктураПоказателей.П000300001003 * 18 / 100;
	СтруктураПоказателей.П000300002003 = Окр(СтруктураПоказателей.П000300002003);
	СтруктураПоказателей.П000300002005 = СтруктураПоказателей.П000300002003 * 10 / 100;
	СтруктураПоказателей.П000300003003 = Окр(СтруктураПоказателей.П000300003003);
	СтруктураПоказателей.П000300003005 = СтруктураПоказателей.П000300003003 * 18 / 118;
	СтруктураПоказателей.П000300004003 = Окр(СтруктураПоказателей.П000300004003);
	СтруктураПоказателей.П000300004005 = СтруктураПоказателей.П000300004003 * 10 / 110;
	СтруктураПоказателей.П000300006003 = Окр(СтруктураПоказателей.П000300006003);
	СтруктураПоказателей.П000300006005 = СтруктураПоказателей.П000300006003 * 18 / 100;
	СтруктураПоказателей.П000300001005 = Окр(СтруктураПоказателей.П000300001005);
	СтруктураПоказателей.П000300002005 = Окр(СтруктураПоказателей.П000300002005);
	СтруктураПоказателей.П000300003005 = Окр(СтруктураПоказателей.П000300003005);
	СтруктураПоказателей.П000300004005 = Окр(СтруктураПоказателей.П000300004005);
	СтруктураПоказателей.П000300005005 = Окр(СтруктураПоказателей.П000300005005);
	СтруктураПоказателей.П000300006005 = Окр(СтруктураПоказателей.П000300006005);
	СтруктураПоказателей.П000300007005 = Окр(СтруктураПоказателей.П000300007005);
	СтруктураПоказателей.П000300008005 = Окр(СтруктураПоказателей.П000300008005);
	СтруктураПоказателей.П000300009005 = Окр(СтруктураПоказателей.П000300009005);
	
	СтруктураПоказателей.П000300012005 = СтруктураПоказателей.П000300001005 + СтруктураПоказателей.П000300002005 + СтруктураПоказателей.П000300003005
		+ СтруктураПоказателей.П000300004005 + СтруктураПоказателей.П000300005005 + СтруктураПоказателей.П000300006005
		+ СтруктураПоказателей.П000300007005 + СтруктураПоказателей.П000300008005 + СтруктураПоказателей.П000300009005;
			
	СтруктураПоказателей.П000300018003 = Окр(СтруктураПоказателей.П000300018003);
	СтруктураПоказателей.П000300019003 = Окр(СтруктураПоказателей.П000300019003);
	
	СтруктураПоказателей.П000300017003 = СтруктураПоказателей.П000300018003 + СтруктураПоказателей.П000300019003;
		
	СтруктураПоказателей.П000300013003 = Окр(СтруктураПоказателей.П000300013003);
	СтруктураПоказателей.П000300015003 = Окр(СтруктураПоказателей.П000300015003);
	СтруктураПоказателей.П000300016003 = Окр(СтруктураПоказателей.П000300016003);
	СтруктураПоказателей.П000300017003 = Окр(СтруктураПоказателей.П000300017003);
	СтруктураПоказателей.П000300020003 = Окр(СтруктураПоказателей.П000300020003);
	СтруктураПоказателей.П000300021003 = Окр(СтруктураПоказателей.П000300021003);
			
	СтруктураПоказателей.П000300022003 = СтруктураПоказателей.П000300013003 + СтруктураПоказателей.П000300015003 + СтруктураПоказателей.П000300016003
		+ СтруктураПоказателей.П000300017003 + СтруктураПоказателей.П000300020003 + СтруктураПоказателей.П000300021003;
		
	СтруктураПоказателей.П000300023003 = Макс(СтруктураПоказателей.П000300012005 - СтруктураПоказателей.П000300022003, 0);
	
	СтруктураПоказателей.П000300024003 = Макс(СтруктураПоказателей.П000300022003 - СтруктураПоказателей.П000300012005, 0);												
			
КонецПроцедуры

// Возвращает признак применения Федерального Закона от 27.11.2017 №335-ФЗ,
// который возлагает исчисление НДС на покупателя товаров, перечисленных в п.8 ст. 161:
// - лом и отходы черных и цветных металлов,
// - алюминий вторичный и его сплавы,
// - сырые шкуры животных.
//
// Параметры:
// 	Дата - Дата - В данном параметре передается дата, на которую необходимо определить признак применения 335-ФЗ.
//
// Возвращаемое значение:
//  Булево - признак применения:
//           Истина - ФЗ применяется;
//           Ложь   - ФЗ не применяется.
//
Функция ВедетсяУчетНДСПоФЗ335(Дата) Экспорт
	
	НачалоПримененияФЗ335 = '20180101';
	
	Если Дата < НачалоПримененияФЗ335 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ФормированиеКнигИЖурнала

// Возвращает документы НДС для передачи в электронном виде.
//
// Параметры:
//	СтруктураПараметров - Структура - Содержит ключи:
//		* Организация - СправочникСсылка.Организации.
//		* НалоговыйПериод - Дата - Налоговый период.
//
// Возвращаемое значение:
//	Структура - см. НовыйСтруктураДокументовОтчетности().
//
Функция СформироватьДокументыОтчетности(СтруктураПараметров) Экспорт
	
	ДокументыОтчетности = НовыйСтруктураДокументовОтчетности();
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.Организация) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.НалоговыйПериод) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураПараметров.Вставить("Дата", КонецКвартала(СтруктураПараметров.НалоговыйПериод));
	СтруктураПараметров.Вставить("ФорматПоПостановлению735", СтруктураПараметров.НалоговыйПериод >= '20141001');
	СписокДокументов = ПолучитьСписокДокументовОтчетности(СтруктураПараметров);
	
	Для каждого СтрокаСписка Из СписокДокументов Цикл
		СоздатьЗаполнитьДокумент(СтрокаСписка, СтруктураПараметров, ДокументыОтчетности);
	КонецЦикла;
	
	Возврат ДокументыОтчетности;
	
КонецФункции

// Получает пакет электронных представлений документов.
//
// Параметры:
//  ВыгружаемыеДокументы - Массив - перечень документов для которых
//                 необходимо получить электронные представления в виде двоичных данных.
//  УникальныйИдентификатор - УникальныйИдентификатор - уникальный идентификатор по которому
//                 осуществляется привязка двоичных данных во временном хранилище.
//
// Возвращаемое значение:
//   Соответствие - соответствие переданных ссылок на документы и массива структур с полями:
//                 * ТипФайла - Строка - описание типа файла;
//                 * ИмяФайла - Строка - имя файла с расширением;
//                 * АдресВременногоХранилища - Строка - адрес временного хранилища, в котором размещены двоичные данные файла.
//
Функция ПолучитьЭлектронныеДокументы(ВыгружаемыеДокументы, УникальныйИдентификатор = Неопределено) Экспорт
	
	Возврат УчетНДСПереопределяемый.СформироватьЭлектронныеДокументы(ВыгружаемыеДокументы, УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти

// Возвращает порядок округления НДС (Федеральный Закон N 248-ФЗ).
//
// Параметры:
// 	Дата  	- 	Дата - В данном параметре передается дата,
//            	на которую необходимо определить порядок округления НДС.
// Возвращаемое значение:
//  Булево - 	признак применения:
//				1 	- сумма НДС исчисляется с копейками;
//				2 	- сумма НДС исчисляется в полных рублях.
//
Функция ПолучитьПорядокОкругленияНДС(Дата) Экспорт

	НачалоПримененияОкругления = '20140101';
	
	Если Дата < НачалоПримененияОкругления Тогда
		Возврат 1;
	Иначе
		Возврат 2;
	КонецЕсли;

КонецФункции // ПолучитьПорядокОкругленияНДС()

// Возвращает признак применения правил заполнения декларации НДС по приказу ФНС от 19.08.2020 N ЕД-7-3/591@.
// Помимо прочего, приказом меняется порядок заполнения раздела 7 декларации, графы 3 и 4 с 01.10.2020 заполняются
// для всех операций, кроме операций реализации не на территории РФ.
//
// Параметры:
//  Дата   - тип дата, в данном параметре передается
//           дата на которую необходимо определить признак применения приказа
// Возвращаемое значение:
//  Булево - признак применения
//        Истина - приказ применяется
//        Ложь   - приказ не применяется
//
Функция ПравилаЗаполненияДекларацииС4кв2020(Дата) Экспорт
	
	НачалоПримененияПравил = '20201001';
	
	Если Дата < НачалоПримененияПравил Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

//-- НЕ УТ

#Область ВыводКнигИЖурналов

// Формирует список кодов видов операций, актуальный на переданную дату.
//
// Параметры:
//   ЧастьЖурнала         - Перечисления.ЧастиЖурналаУчетаСчетовФактур - список различается для полученных и выставленных счетов-фактур.
//   СписокКодовОпераций  - СписокЗначений - список выбора элемента формы, в который помещается формируемый список кодов видов операций.
//   Период               - Дата - дата, на которую требуется получить список кодов видов операций.
//
Процедура ЗаполнитьСписокКодовВидовОпераций(ЧастьЖурнала, СписокКодовОпераций, Период) Экспорт
	
	СписокКодовОпераций.Очистить();
	ВерсияКодовВидовОпераций = УчетНДСКлиентСервер.ВерсияКодовВидовОпераций(Период);
	
	Если ВерсияКодовВидовОпераций = 1 Тогда
		Если ЧастьЖурнала = Перечисления.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры Тогда
			СписокКодовОпераций.Добавить("01", НСтр("ru = '01 - Получение товаров, работ, услуг'"));
			СписокКодовОпераций.Добавить("02", НСтр("ru = '02 - Авансы выданные'"));
			СписокКодовОпераций.Добавить("03", НСтр("ru = '03 - Возврат от покупателя'"));
			СписокКодовОпераций.Добавить("04", НСтр("ru = '04 - Товары, работы, услуги комитента'"));
			СписокКодовОпераций.Добавить("05", НСтр("ru = '05 - Авансы за товары, работы, услуги комитента'"));
			СписокКодовОпераций.Добавить("10", НСтр("ru = '10 - Безвозмездное получение товаров, работ, услуг'"));
			СписокКодовОпераций.Добавить("11", НСтр("ru = '11 - Полученные товары, права, п.3,4,5.1 ст. 154, пп.1-4 ст. 155 НК'"));
			СписокКодовОпераций.Добавить("12", НСтр("ru = '12 - Авансы выданные за товары, права, п.3,4,5.1 ст. 154, пп.1-4 ст. 155 НК'"));
			СписокКодовОпераций.Добавить("13", НСтр("ru = '13 - Капитальное строительство, модернизация (реконструкция) объектов недвижимости'"));
			СписокКодовОпераций.Добавить("99", НСтр("ru = '99 - Вычет НДС по налоговым накладным'"));
		ИначеЕсли ЧастьЖурнала = Перечисления.ЧастиЖурналаУчетаСчетовФактур.ВыставленныеСчетаФактуры Тогда
			СписокКодовОпераций.Добавить("01", НСтр("ru = '01 - Реализованные товары, работы, услуги'"));
			СписокКодовОпераций.Добавить("02", НСтр("ru = '02 - Авансы полученные'"));
			СписокКодовОпераций.Добавить("03", НСтр("ru = '03 - Возврат поставщику'"));
			СписокКодовОпераций.Добавить("04", НСтр("ru = '04 - Товары, работы, услуги комитента'"));
			СписокКодовОпераций.Добавить("05", НСтр("ru = '05 - Авансы за товары, работы, услуги комитента'"));
			СписокКодовОпераций.Добавить("06", НСтр("ru = '06 - Налоговый агент, ст. 161 НК'"));
			СписокКодовОпераций.Добавить("07", НСтр("ru = '07 - Списание за счет прибыли, пп.2 п.1 ст. 146 НК'"));
			СписокКодовОпераций.Добавить("08", НСтр("ru = '08 - Строительно-монтажные работы, пп.3 п.1 ст. 146 НК'"));
			СписокКодовОпераций.Добавить("09", НСтр("ru = '09 - Суммы, связанные с расчетами по оплате, ст. 162 НК'"));
			СписокКодовОпераций.Добавить("10", НСтр("ru = '10 - Безвозмездная передача товаров, работ, услуг'"));
			СписокКодовОпераций.Добавить("11", НСтр("ru = '11 - Реализованные товары, права, п.3,4,5.1 ст. 154, пп.1-4 ст. 155 НК'"));
			СписокКодовОпераций.Добавить("12", НСтр("ru = '12 - Авансы полученные за товары, права, п.3,4,5.1 ст. 154, пп.1-4 ст. 155 НК'"));
			СписокКодовОпераций.Добавить("13", НСтр("ru = '13 - Капитальное строительство, модернизация (реконструкция) объектов недвижимости'"));
		КонецЕсли;
	ИначеЕсли ВерсияКодовВидовОпераций = 2 Тогда
		Если ЧастьЖурнала = Перечисления.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры Тогда
			СписокКодовОпераций.Добавить("01", НСтр("ru = '01 - Получение товаров, работ, услуг'"));
			СписокКодовОпераций.Добавить("02", НСтр("ru = '02 - Авансы выданные'"));
			СписокКодовОпераций.Добавить("03", НСтр("ru = '03 - Возврат от покупателя'"));
			СписокКодовОпераций.Добавить("04", НСтр("ru = '04 - Товары, работы, услуги комитента'"));
			СписокКодовОпераций.Добавить("05", НСтр("ru = '05 - Авансы за товары, работы, услуги комитента'"));
			СписокКодовОпераций.Добавить("10", НСтр("ru = '10 - Безвозмездное получение товаров, работ, услуг'"));
			СписокКодовОпераций.Добавить("11", НСтр("ru = '11 - Полученные товары, права, п.3,4,5.1 ст. 154, пп.1-4 ст. 155 НК'"));
			СписокКодовОпераций.Добавить("12", НСтр("ru = '12 - Авансы выданные за товары, права, п.3,4,5.1 ст. 154, пп.1-4 ст. 155 НК'"));
			СписокКодовОпераций.Добавить("13", НСтр("ru = '13 - Капитальное строительство, модернизация (реконструкция) объектов недвижимости'"));
			СписокКодовОпераций.Добавить("16", НСтр("ru = '16 - Возврат от покупателя-неплательщика НДС'"));
			СписокКодовОпераций.Добавить("17", НСтр("ru = '17 - Возврат от покупателя-физического лица'"));
			СписокКодовОпераций.Добавить("18", НСтр("ru = '18 - Изменение стоимости полученных товаров (работ, услуг) в сторону уменьшения'"));
			СписокКодовОпераций.Добавить("19", НСтр("ru = '19 - Ввоз товаров из Евразийского экономического союза'"));
			СписокКодовОпераций.Добавить("20", НСтр("ru = '20 - Ввоз импортных товаров на территорию РФ'"));
			СписокКодовОпераций.Добавить("22", НСтр("ru = '22 - Возврат, зачет авансовых платежей, п.5 ст. 171, п.6 ст. 172 НК'"));
			СписокКодовОпераций.Добавить("23", НСтр("ru = '23 - Командировочные расходы по бланку строгой отчетности, п.7 ст. 171 НК'"));
			СписокКодовОпераций.Добавить("24", НСтр("ru = '24 - Подтверждение ставки 0% после истечения 180 дней'"));
			СписокКодовОпераций.Добавить("25", НСтр("ru = '25 - Подтверждение ставки 0% по ранее восстановленному НДС'"));
			СписокКодовОпераций.Добавить("27", НСтр("ru = '27 - Сводный комиссионный счет-фактура, п.3.1 ст. 169 НК'"));
			СписокКодовОпераций.Добавить("28", НСтр("ru = '28 - Сводный комиссионный счет-фактура на аванс, п.3.1 ст. 169 НК'"));
			СписокКодовОпераций.Добавить("99", НСтр("ru = '99 - Вычет НДС по налоговым накладным'"));
		ИначеЕсли ЧастьЖурнала = Перечисления.ЧастиЖурналаУчетаСчетовФактур.ВыставленныеСчетаФактуры Тогда
			СписокКодовОпераций.Добавить("01", НСтр("ru = '01 - Реализованные товары, работы, услуги'"));
			СписокКодовОпераций.Добавить("02", НСтр("ru = '02 - Авансы полученные'"));
			СписокКодовОпераций.Добавить("03", НСтр("ru = '03 - Возврат поставщику'"));
			СписокКодовОпераций.Добавить("04", НСтр("ru = '04 - Товары, работы, услуги комитента'"));
			СписокКодовОпераций.Добавить("05", НСтр("ru = '05 - Авансы за товары, работы, услуги комитента'"));
			СписокКодовОпераций.Добавить("06", НСтр("ru = '06 - Налоговый агент, ст. 161 НК'"));
			СписокКодовОпераций.Добавить("07", НСтр("ru = '07 - Списание за счет прибыли, пп.2 п.1 ст. 146 НК'"));
			СписокКодовОпераций.Добавить("08", НСтр("ru = '08 - Строительно-монтажные работы, пп.3 п.1 ст. 146 НК'"));
			СписокКодовОпераций.Добавить("09", НСтр("ru = '09 - Суммы, связанные с расчетами по оплате, ст. 162 НК'"));
			СписокКодовОпераций.Добавить("10", НСтр("ru = '10 - Безвозмездная передача товаров, работ, услуг'"));
			СписокКодовОпераций.Добавить("11", НСтр("ru = '11 - Реализованные товары, права, п.3,4,5.1 ст. 154, пп.1-4 ст. 155 НК'"));
			СписокКодовОпераций.Добавить("12", НСтр("ru = '12 - Авансы полученные за товары, права, п.3,4,5.1 ст. 154, пп.1-4 ст. 155 НК'"));
			СписокКодовОпераций.Добавить("13", НСтр("ru = '13 - Капитальное строительство, модернизация (реконструкция) объектов недвижимости'"));
			СписокКодовОпераций.Добавить("16", НСтр("ru = '16 - Возврат от покупателя-неплательщика НДС'"));
			СписокКодовОпераций.Добавить("18", НСтр("ru = '18 - Изменение стоимости отгруженных товаров (работ, услуг) в сторону уменьшения'"));
			СписокКодовОпераций.Добавить("21", НСтр("ru = '21 - Восстановление НДС, п.8 ст. 145, п.3 ст. 170, ст. 171.1 НК, а также при операциях, облагаемых по ставке 0%'"));
			СписокКодовОпераций.Добавить("26", НСтр("ru = '26 - Счета-фактуры не составляются по письменному согласию сторон'"));
			СписокКодовОпераций.Добавить("27", НСтр("ru = '27 - Сводный комиссионный счет-фактура, п.3.1 ст. 169 НК'"));
			СписокКодовОпераций.Добавить("28", НСтр("ru = '28 - Сводный комиссионный счет-фактура на аванс, п.3.1 ст. 169 НК'"));
		КонецЕсли;
	ИначеЕсли ВерсияКодовВидовОпераций = 3 Тогда
		Если ЧастьЖурнала = Перечисления.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры Тогда
			СписокКодовОпераций.Добавить("01", НСтр("ru = '01 - Получение товаров, работ, услуг'"));
			СписокКодовОпераций.Добавить("02", НСтр("ru = '02 - Авансы выданные'"));
			СписокКодовОпераций.Добавить("13", НСтр("ru = '13 - Капитальное строительство, модернизация (реконструкция) объектов недвижимости'"));
			СписокКодовОпераций.Добавить("15", НСтр("ru = '15 - Совместное приобретение товаров, работ, услуг для собственных нужд и для комитента'"));
			СписокКодовОпераций.Добавить("16", НСтр("ru = '16 - Возврат от покупателя-неплательщика НДС'"));
			СписокКодовОпераций.Добавить("17", НСтр("ru = '17 - Возврат от покупателя-физического лица'"));
			СписокКодовОпераций.Добавить("18", НСтр("ru = '18 - Изменение стоимости полученных товаров (работ, услуг) в сторону уменьшения'"));
			СписокКодовОпераций.Добавить("19", НСтр("ru = '19 - Ввоз товаров из Евразийского экономического союза'"));
			СписокКодовОпераций.Добавить("20", НСтр("ru = '20 - Ввоз импортных товаров на территорию РФ'"));
			СписокКодовОпераций.Добавить("22", НСтр("ru = '22 - Возврат, зачет авансовых платежей, п.5 ст. 171, п.6 ст. 172 НК'"));
			СписокКодовОпераций.Добавить("23", НСтр("ru = '23 - Командировочные расходы по бланку строгой отчетности, п.7 ст. 171 НК'"));
			СписокКодовОпераций.Добавить("24", НСтр("ru = '24 - Подтверждение ставки 0% после истечения 180 дней'"));
			СписокКодовОпераций.Добавить("25", НСтр("ru = '25 - Вычет НДС при подтверждении ставки 0% по ранее восстановленному НДС, а также п.7 ст.172 НК'"));
			СписокКодовОпераций.Добавить("27", НСтр("ru = '27 - Сводный комиссионный счет-фактура, п.3.1 ст. 169 НК'"));
			СписокКодовОпераций.Добавить("28", НСтр("ru = '28 - Сводный комиссионный счет-фактура на аванс, п.3.1 ст. 169 НК'"));
			СписокКодовОпераций.Добавить("32", НСтр("ru = '32 - Вычет НДС в ОЭЗ Калининградской обл., п.14 ст. 171 НК'"));
		ИначеЕсли ЧастьЖурнала = Перечисления.ЧастиЖурналаУчетаСчетовФактур.ВыставленныеСчетаФактуры Тогда
			СписокКодовОпераций.Добавить("01", НСтр("ru = '01 - Реализация товаров, работ, услуг и операции, приравненные к ней'"));
			СписокКодовОпераций.Добавить("02", НСтр("ru = '02 - Авансы полученные'"));
			СписокКодовОпераций.Добавить("06", НСтр("ru = '06 - Налоговый агент, ст. 161 НК'"));
			СписокКодовОпераций.Добавить("10", НСтр("ru = '10 - Безвозмездная передача товаров, работ, услуг'"));
			СписокКодовОпераций.Добавить("13", НСтр("ru = '13 - Капитальное строительство, модернизация (реконструкция) объектов недвижимости'"));
			СписокКодовОпераций.Добавить("14", НСтр("ru = '14 - Реализация прав, пп.1-4 ст. 155 НК'"));
			СписокКодовОпераций.Добавить("15", НСтр("ru = '15 - Совместная реализация собственных и комиссионных товаров, работ, услуг'"));
			СписокКодовОпераций.Добавить("16", НСтр("ru = '16 - Возврат от покупателя-неплательщика НДС'"));
			СписокКодовОпераций.Добавить("18", НСтр("ru = '18 - Изменение стоимости отгруженных товаров (работ, услуг) в сторону уменьшения'"));
			СписокКодовОпераций.Добавить("21", НСтр("ru = '21 - Восстановление НДС, п.8 ст. 145, п.3 ст. 170, ст. 171.1 НК, а также при операциях, облагаемых по ставке 0%'"));
			СписокКодовОпераций.Добавить("26", НСтр("ru = '26 - Реализация товаров, работ, услуг неплательщикам НДС, получение авансов'"));
			СписокКодовОпераций.Добавить("27", НСтр("ru = '27 - Сводный комиссионный счет-фактура, п.3.1 ст. 169 НК'"));
			СписокКодовОпераций.Добавить("28", НСтр("ru = '28 - Сводный комиссионный счет-фактура на аванс, п.3.1 ст. 169 НК'"));
			СписокКодовОпераций.Добавить("29", НСтр("ru = '29 - Корректировка по п.6 ст. 105.3 НК'"));
			СписокКодовОпераций.Добавить("30", НСтр("ru = '30 - Отгрузка товаров в ОЭЗ Калининградской обл., абз.1 пп.1.1 п.1 ст. 151 НК'"));
			СписокКодовОпераций.Добавить("31", НСтр("ru = '31 - Уплата НДС в ОЭЗ Калининградской обл., абз.2 пп.1.1 п.1 ст. 151 НК'"));
		КонецЕсли;
		
	ИначеЕсли ВерсияКодовВидовОпераций = 4 Тогда
		
		Если ЧастьЖурнала = Перечисления.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры Тогда
			
			СписокКодовОпераций.Добавить("01", НСтр("ru = '01 - Получение товаров, работ, услуг'"));
			СписокКодовОпераций.Добавить("02", НСтр("ru = '02 - Авансы выданные'"));
			СписокКодовОпераций.Добавить("13", НСтр("ru = '13 - Капитальное строительство, модернизация (реконструкция) объектов недвижимости'"));
			СписокКодовОпераций.Добавить("15", НСтр("ru = '15 - Совместное приобретение товаров, работ, услуг для собственных нужд и для комитента'"));
			СписокКодовОпераций.Добавить("16", НСтр("ru = '16 - Возврат от покупателя-неплательщика НДС'"));
			СписокКодовОпераций.Добавить("17", НСтр("ru = '17 - Возврат от покупателя-физического лица'"));
			СписокКодовОпераций.Добавить("18", НСтр("ru = '18 - Изменение стоимости полученных товаров (работ, услуг) в сторону уменьшения'"));
			СписокКодовОпераций.Добавить("19", НСтр("ru = '19 - Ввоз товаров из Евразийского экономического союза'"));
			СписокКодовОпераций.Добавить("20", НСтр("ru = '20 - Ввоз импортных товаров на территорию РФ'"));
			СписокКодовОпераций.Добавить("22", НСтр("ru = '22 - Возврат, зачет авансовых платежей, п.5 ст. 171, п.6 ст. 172 НК'"));
			СписокКодовОпераций.Добавить("23", НСтр("ru = '23 - Командировочные расходы по бланку строгой отчетности, п.7 ст. 171 НК'"));
			СписокКодовОпераций.Добавить("24", НСтр("ru = '24 - Подтверждение ставки 0% после истечения 180 дней'"));
			СписокКодовОпераций.Добавить("25", НСтр("ru = '25 - Вычет НДС при подтверждении ставки 0% по ранее восстановленному НДС, а также п.7 ст.172 НК'"));
			СписокКодовОпераций.Добавить("27", НСтр("ru = '27 - Сводный комиссионный счет-фактура, п.3.1 ст. 169 НК'"));
			СписокКодовОпераций.Добавить("28", НСтр("ru = '28 - Сводный комиссионный счет-фактура на аванс, п.3.1 ст. 169 НК'"));
			СписокКодовОпераций.Добавить("32", НСтр("ru = '32 - Вычет НДС в ОЭЗ Калининградской обл., п.14 ст. 171 НК'"));
			// Коды, введенные в действие с 1 января 2018 года.
			СписокКодовОпераций.Добавить("36", НСтр("ru = '36 - Вычет НДС при реализации гражданину иностранного государства, п.4.1 ст. 171 НК'"));
			СписокКодовОпераций.Добавить("41", НСтр("ru = '41 - Авансы выданные за товары п.8 ст. 161 НК'"));
			СписокКодовОпераций.Добавить("42", НСтр("ru = '42 - Получение товаров п.8 ст. 161 НК'"));
			СписокКодовОпераций.Добавить("43", НСтр("ru = '43 - Возврат, зачет авансовых платежей за товары п.8 ст. 161 НК'"));
			СписокКодовОпераций.Добавить("44", НСтр("ru = '44 - Изменение стоимости полученных товаров п.8 ст. 161 НК в сторону уменьшения'"));
			
			// Код, рекомендованный в письме ФНС от 14.05.2019 № СД-4-3/8916@
			СписокКодовОпераций.Добавить("45", НСтр("ru = '45 - Приобретение у иностранной организации услуг в электронной форме, п.2.1 ст. 171 НК'"));
			
		ИначеЕсли ЧастьЖурнала = Перечисления.ЧастиЖурналаУчетаСчетовФактур.ВыставленныеСчетаФактуры Тогда
			СписокКодовОпераций.Добавить("01", НСтр("ru = '01 - Реализация товаров, работ, услуг и операции, приравненные к ней'"));
			СписокКодовОпераций.Добавить("02", НСтр("ru = '02 - Авансы полученные'"));
			СписокКодовОпераций.Добавить("06", НСтр("ru = '06 - Налоговый агент, ст. 161 НК'"));
			СписокКодовОпераций.Добавить("10", НСтр("ru = '10 - Безвозмездная передача товаров, работ, услуг'"));
			СписокКодовОпераций.Добавить("13", НСтр("ru = '13 - Капитальное строительство, модернизация (реконструкция) объектов недвижимости'"));
			СписокКодовОпераций.Добавить("14", НСтр("ru = '14 - Реализация прав, пп.1-4 ст. 155 НК'"));
			СписокКодовОпераций.Добавить("15", НСтр("ru = '15 - Совместная реализация собственных и комиссионных товаров, работ, услуг'"));
			СписокКодовОпераций.Добавить("16", НСтр("ru = '16 - Возврат от покупателя-неплательщика НДС'"));
			СписокКодовОпераций.Добавить("18", НСтр("ru = '18 - Изменение стоимости отгруженных товаров (работ, услуг) в сторону уменьшения'"));
			СписокКодовОпераций.Добавить("21", НСтр("ru = '21 - Восстановление НДС, п.8 ст. 145, п.3 ст. 170, ст. 171.1 НК, а также при операциях, облагаемых по ставке 0%'"));
			СписокКодовОпераций.Добавить("26", НСтр("ru = '26 - Реализация товаров, работ, услуг неплательщикам НДС, получение авансов'"));
			СписокКодовОпераций.Добавить("27", НСтр("ru = '27 - Сводный комиссионный счет-фактура, п.3.1 ст. 169 НК'"));
			СписокКодовОпераций.Добавить("28", НСтр("ru = '28 - Сводный комиссионный счет-фактура на аванс, п.3.1 ст. 169 НК'"));
			СписокКодовОпераций.Добавить("29", НСтр("ru = '29 - Корректировка по п.6 ст. 105.3 НК'"));
			СписокКодовОпераций.Добавить("30", НСтр("ru = '30 - Отгрузка товаров в ОЭЗ Калининградской обл., абз.1 пп.1.1 п.1 ст. 151 НК'"));
			СписокКодовОпераций.Добавить("31", НСтр("ru = '31 - Уплата НДС в ОЭЗ Калининградской обл., абз.2 пп.1.1 п.1 ст. 151 НК'"));
			
			// Коды, введенные в действие с 1 января 2018 года.
			СписокКодовОпераций.Добавить("33", НСтр("ru = '33 - Авансы полученные за товары п.8 ст. 161 НК'"));
			СписокКодовОпераций.Добавить("34", НСтр("ru = '34 - Реализация товаров п.8 ст. 161 НК'"));
			СписокКодовОпераций.Добавить("35", НСтр("ru = '35 - Оформление документа для компенсации НДС гражданину иностранного государства'"));
			СписокКодовОпераций.Добавить("37", НСтр("ru = '37 - Реализация сырьевых товаров на экспорт по ставке 18%, п.7 ст.164 НК'"));
			СписокКодовОпераций.Добавить("38", НСтр("ru = '38 - Реализация несырьевых товаров на экспорт по ставке 18%, п.7 ст.164 НК'"));
			СписокКодовОпераций.Добавить("39", НСтр("ru = '39 - Реализация несырьевых товаров на экспорт по ставке 10%, п.7 ст.164 НК'"));
			СписокКодовОпераций.Добавить("40", НСтр("ru = '40 - Реализация работ (услуг) в отношении экспортируемых товаров по ставке 18%, пп.2.1-2.5,2.7 и 2.8 п.1, п.7 ст.164 НК'"));
			
		КонецЕсли;
		
	ИначеЕсли ВерсияКодовВидовОпераций = 5 Тогда
		
		Если ЧастьЖурнала = Перечисления.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры Тогда
			
			СписокКодовОпераций.Добавить("01", НСтр("ru = '01 - Получение товаров, работ, услуг'"));
			СписокКодовОпераций.Добавить("02", НСтр("ru = '02 - Авансы выданные'"));
			СписокКодовОпераций.Добавить("13", НСтр("ru = '13 - Капитальное строительство, модернизация (реконструкция) объектов недвижимости'"));
			СписокКодовОпераций.Добавить("15", НСтр("ru = '15 - Совместное приобретение товаров, работ, услуг для собственных нужд и для комитента'"));
			СписокКодовОпераций.Добавить("16", НСтр("ru = '16 - Возврат от покупателя-неплательщика НДС'"));
			СписокКодовОпераций.Добавить("17", НСтр("ru = '17 - Возврат от покупателя-физического лица'"));
			СписокКодовОпераций.Добавить("18", НСтр("ru = '18 - Изменение стоимости полученных товаров (работ, услуг) в сторону уменьшения'"));
			СписокКодовОпераций.Добавить("19", НСтр("ru = '19 - Ввоз товаров из Евразийского экономического союза'"));
			СписокКодовОпераций.Добавить("20", НСтр("ru = '20 - Ввоз импортных товаров на территорию РФ'"));
			СписокКодовОпераций.Добавить("22", НСтр("ru = '22 - Возврат, зачет авансовых платежей, п.5 ст. 171, п.6 ст. 172 НК'"));
			СписокКодовОпераций.Добавить("23", НСтр("ru = '23 - Командировочные расходы по бланку строгой отчетности, п.7 ст. 171 НК'"));
			СписокКодовОпераций.Добавить("24", НСтр("ru = '24 - Подтверждение ставки 0% после истечения 180 дней'"));
			СписокКодовОпераций.Добавить("25", НСтр("ru = '25 - Вычет НДС при подтверждении ставки 0% по ранее восстановленному НДС, а также п.7 ст.172 НК'"));
			СписокКодовОпераций.Добавить("27", НСтр("ru = '27 - Сводный комиссионный счет-фактура, п.3.1 ст. 169 НК'"));
			СписокКодовОпераций.Добавить("28", НСтр("ru = '28 - Сводный комиссионный счет-фактура на аванс, п.3.1 ст. 169 НК'"));
			СписокКодовОпераций.Добавить("32", НСтр("ru = '32 - Вычет НДС в ОЭЗ Калининградской обл., п.14 ст. 171 НК'"));
			// Коды, введенные в действие с 1 января 2018 года.
			СписокКодовОпераций.Добавить("36", НСтр("ru = '36 - Вычет НДС при реализации гражданину иностранного государства, п.4.1 ст. 171 НК'"));
			СписокКодовОпераций.Добавить("41", НСтр("ru = '41 - Авансы выданные за товары п.8 ст. 161 НК'"));
			СписокКодовОпераций.Добавить("42", НСтр("ru = '42 - Получение товаров п.8 ст. 161 НК'"));
			СписокКодовОпераций.Добавить("43", НСтр("ru = '43 - Возврат, зачет авансовых платежей за товары п.8 ст. 161 НК'"));
			СписокКодовОпераций.Добавить("44", НСтр("ru = '44 - Изменение стоимости полученных товаров п.8 ст. 161 НК в сторону уменьшения'"));
			
			// Код, рекомендованный в письме ФНС от 14.05.2019 № СД-4-3/8916@
			СписокКодовОпераций.Добавить("45", НСтр("ru = '45 - Приобретение у иностранной организации услуг в электронной форме, п.2.1 ст. 171 НК'"));
			
		ИначеЕсли ЧастьЖурнала = Перечисления.ЧастиЖурналаУчетаСчетовФактур.ВыставленныеСчетаФактуры Тогда
			
			СписокКодовОпераций.Добавить("01", НСтр("ru = '01 - Реализация товаров, работ, услуг и операции, приравненные к ней'"));
			СписокКодовОпераций.Добавить("02", НСтр("ru = '02 - Авансы полученные'"));
			СписокКодовОпераций.Добавить("06", НСтр("ru = '06 - Налоговый агент, ст. 161 НК'"));
			СписокКодовОпераций.Добавить("10", НСтр("ru = '10 - Безвозмездная передача товаров, работ, услуг'"));
			СписокКодовОпераций.Добавить("13", НСтр("ru = '13 - Капитальное строительство, модернизация (реконструкция) объектов недвижимости'"));
			СписокКодовОпераций.Добавить("14", НСтр("ru = '14 - Реализация прав, пп.1-4 ст. 155 НК'"));
			СписокКодовОпераций.Добавить("15", НСтр("ru = '15 - Совместная реализация собственных и комиссионных товаров, работ, услуг'"));
			СписокКодовОпераций.Добавить("16", НСтр("ru = '16 - Возврат от покупателя-неплательщика НДС'"));
			СписокКодовОпераций.Добавить("18", НСтр("ru = '18 - Изменение стоимости отгруженных товаров (работ, услуг) в сторону уменьшения'"));
			СписокКодовОпераций.Добавить("21", НСтр("ru = '21 - Восстановление НДС, п.8 ст. 145, п.3 ст. 170, ст. 171.1 НК, а также при операциях, облагаемых по ставке 0%'"));
			СписокКодовОпераций.Добавить("26", НСтр("ru = '26 - Реализация товаров, работ, услуг неплательщикам НДС, получение авансов'"));
			СписокКодовОпераций.Добавить("27", НСтр("ru = '27 - Сводный комиссионный счет-фактура, п.3.1 ст. 169 НК'"));
			СписокКодовОпераций.Добавить("28", НСтр("ru = '28 - Сводный комиссионный счет-фактура на аванс, п.3.1 ст. 169 НК'"));
			СписокКодовОпераций.Добавить("29", НСтр("ru = '29 - Корректировка по п.6 ст. 105.3 НК'"));
			СписокКодовОпераций.Добавить("30", НСтр("ru = '30 - Отгрузка товаров в ОЭЗ Калининградской обл., абз.1 пп.1.1 п.1 ст. 151 НК'"));
			СписокКодовОпераций.Добавить("31", НСтр("ru = '31 - Уплата НДС в ОЭЗ Калининградской обл., абз.2 пп.1.1 п.1 ст. 151 НК'"));
			
			// Коды, введенные в действие с 1 января 2018 года.
			СписокКодовОпераций.Добавить("33", НСтр("ru = '33 - Авансы полученные за товары п.8 ст. 161 НК'"));
			СписокКодовОпераций.Добавить("34", НСтр("ru = '34 - Реализация товаров п.8 ст. 161 НК'"));
			СписокКодовОпераций.Добавить("35", НСтр("ru = '35 - Оформление документа для компенсации НДС гражданину иностранного государства'"));
			СписокКодовОпераций.Добавить("37", НСтр("ru = '37 - Реализация сырьевых товаров на экспорт по ставке 18%, п.7 ст.164 НК'"));
			СписокКодовОпераций.Добавить("38", НСтр("ru = '38 - Реализация несырьевых товаров на экспорт по ставке 18%, п.7 ст.164 НК'"));
			СписокКодовОпераций.Добавить("39", НСтр("ru = '39 - Реализация несырьевых товаров на экспорт по ставке 10%, п.7 ст.164 НК'"));
			СписокКодовОпераций.Добавить("40", НСтр("ru = '40 - Реализация работ (услуг) в отношении экспортируемых товаров по ставке 18%, пп.2.1-2.5,2.7 и 2.8 п.1, п.7 ст.164 НК'"));
			
			// Код, введенный в действие с 1 апреля 2024 года.
			СписокКодовОпераций.Добавить("47", НСтр("ru = '47 - Перепродажа товаров физических лиц, указанных в пп.5.1 и 5.2 ст.154 НК'"));
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Выводит шапку для дополнительного листа книги покупок или продаж.
//
// Параметры:
//	ТабличныйДокумент - ТабличныйДокумент - Табличный документ, в который выводятся данные.
//	Макет - ТабличныйДокумент - Макет табличного документа.
//	СтруктураПараметров - Структура - Содержит параметры формирования, см. отчеты книга покупок и продаж.
//	НомерДополнительногоЛиста - Число - Номер листа.
//
Процедура ВывестиШапкуДопЛиста(ТабличныйДокумент, Макет, СтруктураПараметров, НомерДополнительногоЛиста) Экспорт
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	Организация = СтруктураПараметров.Организация;
	
	Если СтруктураПараметров.ЗаполнениеДокумента
		ИЛИ СтруктураПараметров.СформироватьОтчетПоСтандартнойФорме Тогда
		Секция = Макет.ПолучитьОбласть("ШапкаИнформация");
		ТабличныйДокумент.Вывести(Секция);
	КонецЕсли;
	
	Секция = Макет.ПолучитьОбласть("Шапка");
	Если Секция.Области.Найти("НомераГрафДекларация") <> Неопределено Тогда 
		Секция.Область("НомераГрафДекларация").Видимость = Ложь;
	КонецЕсли;
	Секция.Параметры.УстановленныйОтбор = "";
	Секция.Параметры.Период = ПредставлениеПериода(
		СтруктураПараметров.НалоговыйПериод, КонецДня(СтруктураПараметров.КонецНалоговогоПериода), "ФП = Истина");
		
	ЭтоКнигаПродаж = СтруктураПараметров.Свойство("ЭтоКнигаПродаж") И СтруктураПараметров.ЭтоКнигаПродаж = Истина;
	
	Если СтруктураПараметров.ВерсияПостановленияНДС1137 >= 5 Тогда
		Секция.Область("Период").Видимость = Ложь;
		Если ЭтоКнигаПродаж Тогда
			Секция.Область("НомераГрафДекларация91").Видимость = Ложь;
		Иначе
			Секция.Область("НомераГрафДекларация81").Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
		
	Если СтруктураПараметров.ВерсияПостановленияНДС1137 >= 5 Тогда
		Если ЭтоКнигаПродаж Тогда
			СекцияЗаголовок = Макет.ПолучитьОбласть("Заголовок91");
		Иначе
			СекцияЗаголовок = Макет.ПолучитьОбласть("Заголовок81");
		КонецЕсли;
		Если СтруктураПараметров.ДополнительныеЛистыЗаТекущийПериод Тогда
			СекцияЗаголовок.Параметры.НомерЛиста = НомерДополнительногоЛиста;

		КонецЕсли;
		
		ТабличныйДокумент.Вывести(СекцияЗаголовок);
		
	ИначеЕсли СтруктураПараметров.ДополнительныеЛистыЗаТекущийПериод Тогда
		Секция.Параметры.НомерЛиста = НомерДополнительногоЛиста;
	КонецЕсли;
		
	СведенияОбОрганизации = ПечатьДокументовУНФ.СведенияОЮрФизЛице(Организация);
	
	НазваниеОрганизации = ПечатьДокументовУНФ.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм");;
	
	Секция.Параметры.НазваниеОрганизации = НазваниеОрганизации;
	Секция.Параметры.ИННКППОрганизации = "" + Организация.ИНН + ?(НЕ ЗначениеЗаполнено(Организация.КПП), "", ("/" + Организация.КПП));
	Секция.Параметры.ДатаСоставления = Формат(СтруктураПараметров.ДатаОформления, "ДФ=dd.MM.yyyy");
	
	Если НЕ СтруктураПараметров.ЗаполнениеДокумента 
		И НЕ СтруктураПараметров.СформироватьОтчетПоСтандартнойФорме
		И СтруктураПараметров.ОтбиратьПоКонтрагенту Тогда
		Секция.Параметры.УстановленныйОтбор = СтрШаблон(
			?(ОбщегоНазначения.ОбъектЯвляетсяГруппой(СтруктураПараметров.КонтрагентДляОтбора),
				НСтр("ru='Отбор: Контрагент в группе %1'"),
				НСтр("ru='Отбор: Контрагент = %1'")),
			СтруктураПараметров.КонтрагентДляОтбора);
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(Секция);
	
КонецПроцедуры

// Возвращает дату и номер счета-фактуры для вывода в отчете.
//
// Параметры:
// 	ЗаписьКниги - Структура, ВыборкаИзРезультатаЗапроса - Содержит поля:
//		* СчетФактура - ДокументСсылка.*, ссылка на документ, указываемый в качестве измерения
//						в регистрах НДС.
//		* НомерСчетаФактуры - Строка, номер счета-фактуры полученный предварительно.
//		* ДатаСчетаФактуры  - Дата, дата счета-фактуры, полученная предварительно.
//		* ОбрабатыватьНомерДокумента - Булево, признак того, что необходимо исключить префиксы из номера
//									документа перед печатью.
//		* СчетФактураДокумент - ДокументСсылка.СчетФактураПолученный/СчетФактураВыданный - ссылка на 
//							подчиненный документ "счет-фактура" (необязательный)
//
// Возвращаемое значение:
//	Структура - Содержит ключи, описанные в УчетНДСПереопределяемый.НовыйПредставлениеСчетаФактуры().
//
Функция ОпределитьДатуИНомерСФ(ЗаписьКниги) Экспорт
	
	ВариантыПредставленияСФ = УчетНДСПереопределяемый.ОпределитьДатуИНомерСчетаФактурыДляПечати(
		ЗаписьКниги);
	
	Возврат ВариантыПредставленияСФ;
		
КонецФункции

// Возвращает данные об ИНН/КПП в зависимости от вида контрагента.
//
// Параметры:
//	ИНН - Строка - ИНН контрагента.
//	КПП - Строка - КПП контрагента. Пустое значение для физического лица.
//	КонтрагентНаименование - Строка - Наименование контрагента.
//
// Возвращаемое значение:
//	Структура - Содержит ключи:
//		* ИННФЛ - Строка - ИНН (для физического лица)
//		* Фамилия - Строка - Фамилия (для физического лица).
//		* Имя - Строка - Имя (для физического лица)
//		* Отчество - Строка - Отчество (для физического лица).
//		* ИННЮЛ - Строка - ИНН (для юридического лица).
//		* КПП - Строка - КПП (для юридического лица).
//		* НаимОрг - Строка - Наименование (для юридического лица).
//
Функция ПолучитьСтруктуруРеквизитовКонтрагента(ИНН, КПП, Знач КонтрагентНаименование = "") Экспорт
	
	СтруктураРеквизитовКонтрагента = Новый Структура();
	
	Если СтрДлина(СокрЛП(ИНН)) > 10 Тогда
		СтруктураРеквизитовКонтрагента.Вставить("ИННФЛ", ИНН);
		КонтрагентНаименование = СокрЛП(КонтрагентНаименование);
		Если ЗначениеЗаполнено(КонтрагентНаименование) Тогда 
			Если ВРег(Лев(КонтрагентНаименование, 3))  = "ИП " Тогда 
				КонтрагентНаименование = Сред(КонтрагентНаименование, 4)
			ИначеЕсли ВРег(Прав(КонтрагентНаименование, 3))  = " ИП" Тогда 
				КонтрагентНаименование = Лев(КонтрагентНаименование, СтрДлина(КонтрагентНаименование) - 3);
			КонецЕсли;	
			СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(КонтрагентНаименование);
			СтруктураРеквизитовКонтрагента.Вставить("Фамилия", 	?(СтруктураФИО.Фамилия <> Неопределено, СтруктураФИО.Фамилия, ""));
			СтруктураРеквизитовКонтрагента.Вставить("Имя", 		?(СтруктураФИО.Имя <> Неопределено, СтруктураФИО.Имя, ""));
			СтруктураРеквизитовКонтрагента.Вставить("Отчество", ?(СтруктураФИО.Отчество <> Неопределено, СтруктураФИО.Отчество, ""));
		КонецЕсли;	
	Иначе
		СтруктураРеквизитовКонтрагента.Вставить("ИННЮЛ", ИНН);
		СтруктураРеквизитовКонтрагента.Вставить("КПП", КПП);
		Если  ЗначениеЗаполнено(КонтрагентНаименование) Тогда 
			СтруктураРеквизитовКонтрагента.Вставить("НаимОрг", КонтрагентНаименование);
		КонецЕсли;	
	КонецЕсли;
	
	Возврат СтруктураРеквизитовКонтрагента;

КонецФункции

// Добавляет запись книги покупок/продаж для проверки контрагента на сервере ФНС.
//
// Параметры:
//	СтруктураПараметров - Структура - Параметры формирования отчета.
//	Строка - ВыборкаИзРезультатаЗапроса - Данные строки.
//	ОбластьТабличногоДокумента - ТабличныйДокумент - Табличный документ с отчетом.
//	ДетальнаяЗапись - ВыборкаИзРезультатаЗапроса - Детальная запись выборки.
//	НомерРаздела - Число - Номер раздела отчета.
//
Процедура ДобавитьКонтрагентаНаПроверку(СтруктураПараметров, Строка, ОбластьТабличногоДокумента, ДетальнаяЗапись = Неопределено, НомерРаздела = 0) Экспорт
	
	// Если это заполнение документа или декларации по НДС, тогда игнорируем
	Если СтруктураПараметров.Свойство("ЗаполнениеДокумента") И СтруктураПараметров.ЗаполнениеДокумента
		ИЛИ СтруктураПараметров.Свойство("ЗаполнениеДекларации") И СтруктураПараметров.ЗаполнениеДекларации Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка заполненности даты события
	Если СтруктураПараметров.Свойство("ЭтоКнигаПокупок") 
		ИЛИ СтруктураПараметров.Свойство("ЭтоКнигаПродаж") Тогда
		ДатаСобытия	= Строка.ДатаСчетаФактурыСортировка;
	ИначеЕсли СтруктураПараметров.Свойство("ЭтоЖурналУчетаСчетовФактур") Тогда
		ДатаСобытия	= Строка.ДатаСчетаФактуры;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаСобытия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если это детальные записи, то ИНН, КПП и контрагента берем из них.
	// Если это итоговая запись, то ИНН, КПП и контрагента берем из их строк.
	Если ДетальнаяЗапись <> Неопределено Тогда
		ДанныеВСтроке = ДетальнаяЗапись;
	Иначе
		ДанныеВСтроке = Строка;
	КонецЕсли;
	
	Контрагент 						= Строка.Контрагент;
	НомерСтрокиТабличногоДокумента 	= ОбластьТабличногоДокумента.Верх;
	Дата 							= НачалоДня(ДатаСобытия);
	Если СтруктураПараметров.Свойство("ЭтоКнигаПокупок") Тогда
		ИНН = ДанныеВСтроке.ПродавецИНН;
		КПП = ДанныеВСтроке.ПродавецКПП;
	ИначеЕсли СтруктураПараметров.Свойство("ЭтоКнигаПродаж") Тогда
		ИНН = ДанныеВСтроке.ПокупательИНН;
		КПП = ДанныеВСтроке.ПокупательКПП;
	ИначеЕсли СтруктураПараметров.Свойство("ЭтоЖурналУчетаСчетовФактур") Тогда
		ИНН = ДанныеВСтроке.КонтрагентИНН;
		КПП = ДанныеВСтроке.КонтрагентКПП;
	КонецЕсли;
	
	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ДобавитьКонтрагентаНаПроверку(
		СтруктураПараметров, 
		НомерСтрокиТабличногоДокумента, 
		Контрагент, 
		ИНН, 
		КПП, 
		Дата, 
		НомерРаздела);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами
	
КонецПроцедуры

// Возвращает Истина, если текущую строку книги покупок / продаж необходимо выводить в отчет.
//
// Параметры:
//	СтруктураПараметров - Структура - Параметры формирования отчета.
//	Строка - ВыборкаИзРезультатаЗапроса - Данные строки.
//	ЭтоИтог - Булево - Признак того, что строка является итогом.
//	ДетальнаяЗапись - ВыборкаИзРезультатаЗапроса - Детальная запись выборки.
//
// Возвращаемое значение:
//	Булево - Истина, если строку требуется выводить в отчет.
//
Функция ВыводитьСтроку(СтруктураПараметров, Строка, ЭтоИтог = Ложь, ДетальнаяЗапись = Неопределено) Экспорт
	
	// Если это детальные записи, то ИНН, КПП и контрагента берем из них.
	// Если это итоговая запись, то ИНН, КПП и контрагента берем из их строк.
	Если ДетальнаяЗапись <> Неопределено Тогда
		ДанныеВСтроке = ДетальнаяЗапись;
	Иначе
		ДанныеВСтроке = Строка;
	КонецЕсли;
	
	ВыводитьСтроку = Истина;
	Если ЭтоИтог Тогда
		// В строке итога нет ИНН, КПП и даты, есть только контрагент 
		СтруктураПараметров.Вставить("ЭтоИтог", Истина);
		
		ВыводитьСтроку = ПроверкаКонтрагентов.ВыводитьСтрокуОтчета(
				СтруктураПараметров, 
				ДанныеВСтроке.Контрагент, 
				Неопределено, 
				Неопределено, 
				Неопределено);
	Иначе
		
		СтруктураПараметров.Вставить("ЭтоИтог", Ложь);
		
		Если СтруктураПараметров.Свойство("ЭтоКнигаПокупок") Тогда
				
			ВыводитьСтроку = ПроверкаКонтрагентов.ВыводитьСтрокуОтчета(
				СтруктураПараметров, 
				ДанныеВСтроке.Контрагент, 
				ДанныеВСтроке.ПродавецИНН, 
				ДанныеВСтроке.ПродавецКПП, 
				?(ЗначениеЗаполнено(ДанныеВСтроке.ДатаСчетаФактурыСортировка), ДанныеВСтроке.ДатаСчетаФактурыСортировка, ДанныеВСтроке.СчетФактураДата));
					
		ИначеЕсли СтруктураПараметров.Свойство("ЭтоКнигаПродаж") Тогда
				
				ВыводитьСтроку = ПроверкаКонтрагентов.ВыводитьСтрокуОтчета(
				СтруктураПараметров, 
				ДанныеВСтроке.Контрагент, 
				ДанныеВСтроке.ПокупательИНН, 
				ДанныеВСтроке.ПокупательКПП, 
				?(ЗначениеЗаполнено(ДанныеВСтроке.ДатаСчетаФактурыСортировка), ДанныеВСтроке.ДатаСчетаФактурыСортировка, ДанныеВСтроке.СчетФактураДата));
				
		ИначеЕсли СтруктураПараметров.Свойство("ЭтоЖурналУчетаСчетовФактур") Тогда
				
			ВыводитьСтроку = ПроверкаКонтрагентов.ВыводитьСтрокуОтчета(
				СтруктураПараметров, 
				ДанныеВСтроке.Контрагент, 
				ДанныеВСтроке.КонтрагентИНН, 
				ДанныеВСтроке.КонтрагентКПП, 
				ДанныеВСтроке.ДатаСчетаФактуры);
				
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВыводитьСтроку;
	
КонецФункции

// Уменьшает итоги по книге покупок / продаж по данным текущей вычитаемой строки.
//
// Параметры:
//	СтрокаИтога - Структура - Содержит ключи для строки итогов книги покупок / продаж.
//	СтрокаВычитаемая - Произвольный - Данные вычитаемой строки.
//	СтруктураПараметров - Структура - Параметры формирования отчета.
//
Процедура УменьшитьСуммуИтога(СтрокаИтога, СтрокаВычитаемая, СтруктураПараметров) Экспорт
	
	Для каждого Колонка Из СтрокаИтога Цикл
		Параметр = Колонка.Ключ;
		СтрокаИтога[Параметр] = СтрокаИтога[Параметр] - СтрокаВычитаемая[Параметр];
	КонецЦикла; 
	
КонецПроцедуры

// Возвращает структуру итогов книги покупок.
//
// Возвращаемое значение:
//	Структура - Содержит ключи для строки итогов книги покупок.
//
Функция НоваяСтрокаИтоговКнигиПокупок() Экспорт

	Результат = Новый Структура();
	Результат.Вставить("ВсегоПокупок", 		0);
	Результат.Вставить("НДС",				0);
	Результат.Вставить("СуммаБезНДС18", 	0);
	Результат.Вставить("НДС18",				0);
	Результат.Вставить("СуммаБезНДС10", 	0);
	Результат.Вставить("НДС10", 			0);
	Результат.Вставить("НДС0", 				0);
	Результат.Вставить("СуммаСовсемБезНДС",	0);
	
	Возврат Результат;

КонецФункции

// Заменяет пустые значения измерения ИсправленныйСчетФактура регистров НДС на Неопределено.
//
// Параметры:
//	Движения - РегистрНакопленияНаборЗаписей.НДСЗаписиКнигиПокупок,  
//				РегистрНакопленияНаборЗаписей.НДСЗаписиКнигиПродаж - Наборы регистров НДС.
//
Процедура ПривестиПустоеИзмерениеИсправленныйСчетФактура(Движения) Экспорт
	
	Для каждого Движение Из Движения Цикл
	
		Если НЕ ЗначениеЗаполнено(Движение.ИсправленныйСчетФактура)
			И Движение.ИсправленныйСчетФактура <> Неопределено Тогда
			
			Движение.ИсправленныйСчетФактура = Неопределено;
		
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

// Возвращает структуру с отбором для поиска счетов-фактур полученных.
//
// Возвращаемое значение:
//	Структура - Содержит ключи для поиска счета-фактуры.
// 
Функция НовыйПараметрыПоискаСчетовФактур() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("НачалоПериода"      , Неопределено);
	Результат.Вставить("КонецПериода"       , Неопределено);
	Результат.Вставить("Организация"        , Справочники.Организации.ПустаяСсылка());
	Результат.Вставить("Фильтр"             , Неопределено);
	Результат.Вставить("ВсеКромеФильтра"    , Ложь);
	Результат.Вставить("НаличиеСчетаФактуры", Неопределено);
	Результат.Вставить("СчетФактураПроведен", Неопределено);
	Результат.Вставить("ДатаСФНеБолее"      , Неопределено);
	Результат.Вставить("ИскатьПоОборотам"   , Ложь);
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение константы ПредельноеКоличествоЗаписейВРазделеДекларацииПоНДС
// для разделения больших книг покупок и продаж на части.
//
// Возвращаемое значение:
//	Число - число строк в одной порции отчета.
// 
Функция ПредельноеКоличествоЗаписейВРазделеДекларацииПоНДС() Экспорт

	Результат = Константы.ПредельноеКоличествоЗаписейВРазделеДекларацииПоНДС.Получить();
	Если Результат = 0 Тогда
		Результат = 10000;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Возвращает текст с названием листа книги покупок или продаж, разделенной на порции.
//
// Параметры:
//	НазваниеРаздела - Строка - Основное название раздела книги.
//	СчетчикСегментов - Число - Номер текущей части.
//
// Возвращаемое значение:
//	Строка - Сформированное название листа.
//
Функция СформироватьЗаголовокЛиста(НазваниеРаздела, СчетчикСегментов) Экспорт

	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 (часть %2)'"), НазваниеРаздела, СчетчикСегментов);

КонецФункции

Процедура ЗаполнитьПодстрочникРНПТ(Знач ДетальнаяЗапись, Знач ЗаписьКниги, Знач ПараметрыСтрокиРНПТ, Знач СтруктураПараметров, Знач СтруктураСекций, Знач СчетчикСегментов, Знач ТабличныйДокумент) Экспорт

	Перем ОбластьТабличногоДокумента, СтруктураРНПТ, ЭлементСвРегНом;

	Если СтруктураПараметров.ВерсияПостановленияНДС1137 < 5 Тогда
		Возврат;
	КонецЕсли;
	
	// Добавим подстрочник, если по счету-фактуре разные РНПТ
	Если ЗначениеЗаполнено(СтруктураПараметров.МассивСвРегНом)
		И СтруктураПараметров.МассивСвРегНом.Количество() > 1 Тогда
		
		Для ЭлементСвРегНом = 1 По СтруктураПараметров.МассивСвРегНом.Количество() - 1 Цикл
			СтруктураРНПТ = СтруктураПараметров.МассивСвРегНом.Получить(ЭлементСвРегНом);
			ПараметрыСтрокиРНПТ.РегНомер     = СтруктураРНПТ.РегНомПросл;
			ПараметрыСтрокиРНПТ.КолПрослеж   = СтруктураРНПТ.КолТовПросл;
			ПараметрыСтрокиРНПТ.СтоимПрослеж = СтруктураРНПТ.СтоимТовПросл;
			ПараметрыСтрокиРНПТ.ЕдПрослеж    = СтруктураРНПТ.ОКЕИ;
			
			ОбластьЗапись = СтруктураСекций.СекцияСтрокаРНПТ.Область("ОбластьЗапись");
			Если ЭлементСвРегНом = СтруктураПараметров.МассивСвРегНом.Количество() - 1 Тогда
				ОбластьЗапись.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
			Иначе
				ОбластьЗапись.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
			КонецЕсли;
			
			Если СтруктураПараметров.ЗаписьДополнительногоЛиста
			 Или СтруктураПараметров.ЗаполнениеДекларации
			 Или СтруктураПараметров.ЗаполнениеДокумента Тогда
				ТабличныйДокумент.Вывести(СтруктураСекций.СекцияСтрокаРНПТ);
			Иначе
				ОбластьТабличногоДокумента = ТабличныйДокумент.Вывести(СтруктураСекций.СекцияСтрокаРНПТ);
				ДобавитьКонтрагентаНаПроверку(
					СтруктураПараметров,
					ЗаписьКниги,
					ОбластьТабличногоДокумента,
					ДетальнаяЗапись,
					СчетчикСегментов);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ВывестиГраницуСтроки(Знач СтруктураПараметров, Знач СтруктураСекций) Экспорт

	Перем ОбластьЗапись;
	
	Если СтруктураПараметров.ВерсияПостановленияНДС1137 < 5 Тогда
		Возврат;
	КонецЕсли;

	ОбластьЗапись = СтруктураСекций.СекцияСтрока.Область("ОбластьЗаписьОсновная");
	ОбластьЗапись.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
	Если Не ЗначениеЗаполнено(СтруктураПараметров.МассивСвРегНом)
		Или СтруктураПараметров.МассивСвРегНом.Количество() = 1 Тогда
		ОбластьЗапись.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ НЕ УТ

Функция НовыйСтруктураДокументовОтчетности()
	
	Результат = Новый Структура();
	
	Результат.Вставить("СозданныеДокументы"      , Новый Массив);
	Результат.Вставить("ПерезаполненныеДокументы", Новый Массив);
	Результат.Вставить("УдаленныеДокументы"      , Новый Массив);
	Результат.Вставить("Ошибки"                  , Новый Массив);
	
	Возврат Результат;
	
КонецФункции

Процедура СоздатьЗаполнитьДокумент(СтрокаСписка, СтруктураПараметров, Результат)
	
	Если НЕ ЗначениеЗаполнено(СтрокаСписка.Документ) Тогда
		ДокументОбъект                 = Документы[СтрокаСписка.Имя].СоздатьДокумент();
		ДокументОбъект.Организация     = СтруктураПараметров.Организация;
		ДокументОбъект.Дата            = СтрокаСписка.Дата;
		ДокументОбъект.НалоговыйПериод = СтрокаСписка.НалоговыйПериод;
		ДокументОбъект.ПериодПоСКНП    = УчетНДСКлиентСервер.ПолучитьКодПоСКНП(СтрокаСписка.НалоговыйПериод);
		
		ДокументОбъект.УстановитьВремя(РежимАвтоВремя.Последним);
		
		СтруктураПараметров.Дата            = СтрокаСписка.Дата;
		СтруктураПараметров.НалоговыйПериод = СтрокаСписка.НалоговыйПериод;
	Иначе
		ДокументОбъект	= СтрокаСписка.Документ.ПолучитьОбъект();
		
		СтруктураПараметров.Дата            = ДокументОбъект.Дата;
		СтруктураПараметров.НалоговыйПериод = ДокументОбъект.НалоговыйПериод;
		ДокументОбъект.ПериодПоСКНП         = УчетНДСКлиентСервер.ПолучитьКодПоСКНП(СтрокаСписка.НалоговыйПериод);
	КонецЕсли;
	
	Документы[СтрокаСписка.Имя].ЗаполнитьОбъект(ДокументОбъект, СтруктураПараметров);
	
	ЭтоНовый = ДокументОбъект.ЭтоНовый();
	
	Попытка
	
		Если НЕ ЭтоНовый
			И (СтрокаСписка.Имя = "ДопЛистКнигиПокупокДляПередачиВЭлектронномВиде"
				ИЛИ СтрокаСписка.Имя = "ДопЛистКнигиПродажДляПередачиВЭлектронномВиде")
			И ДокументОбъект.ТабличнаяЧасть.Количество() = 0 
			И НЕ СтруктураПараметров.ФорматПоПостановлению735 Тогда
			
			ДокументОбъект.ПометкаУдаления = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
			Результат.УдаленныеДокументы.Добавить(ДокументОбъект.Ссылка);
			
		Иначе
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			
			Если ЭтоНовый Тогда
				Результат.СозданныеДокументы.Добавить(ДокументОбъект.Ссылка);
			Иначе
				Результат.ПерезаполненныеДокументы.Добавить(ДокументОбъект.Ссылка);
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		
		ТекстСообщения	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			?(ЭтоНовый, НСтр("ru = 'Не создан документ %1: %2'"), НСтр("ru = 'Не перезаполнен документ %1: %2'")),
			ДокументОбъект.Метаданные().Синоним,
			ОписаниеОшибки());
			
		Результат.Ошибки.Добавить(ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьСписокДокументовОтчетности(СтруктураПараметров)
	
	Перем ФормироватьКнигуПокупок, ФормироватьКнигуПродаж;
	Перем ФормироватьЖурналУчетаСчетовФактур;
	Перем ФормироватьДопЛистыКнигиПокупок, ФормироватьДопЛистыКнигиПродаж;
	Перем СписокДокументов;
	
	Если НЕ СтруктураПараметров.Свойство("ФормироватьКнигуПокупок", ФормироватьКнигуПокупок) Тогда
		ФормироватьКнигуПокупок = Ложь;
	КонецЕсли;
	Если НЕ СтруктураПараметров.Свойство("ФормироватьКнигуПродаж", ФормироватьКнигуПродаж) Тогда
		ФормироватьКнигуПродаж = Ложь;
	КонецЕсли;
	Если НЕ СтруктураПараметров.Свойство("ФормироватьЖурналУчетаСчетовФактур", ФормироватьЖурналУчетаСчетовФактур) Тогда
		ФормироватьЖурналУчетаСчетовФактур = Ложь;
	КонецЕсли;
	Если НЕ СтруктураПараметров.Свойство("ФормироватьДопЛистыКнигиПокупок", ФормироватьДопЛистыКнигиПокупок) Тогда
		ФормироватьДопЛистыКнигиПокупок = Ложь;
	КонецЕсли;
	Если НЕ СтруктураПараметров.Свойство("ФормироватьДопЛистыКнигиПродаж", ФормироватьДопЛистыКнигиПродаж) Тогда
		ФормироватьДопЛистыКнигиПродаж = Ложь;
	КонецЕсли;
	
	СписокДокументов	= Новый ТаблицаЗначений;
	СписокДокументов.Колонки.Добавить("Имя",				ОбщегоНазначения.ОписаниеТипаСтрока(100));
	СписокДокументов.Колонки.Добавить("Документ",			Документы.ТипВсеСсылки());
	СписокДокументов.Колонки.Добавить("Дата",				ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	СписокДокументов.Колонки.Добавить("Номер",				ОбщегоНазначения.ОписаниеТипаСтрока(30));
	СписокДокументов.Колонки.Добавить("НалоговыйПериод",	ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.Организация) Тогда
		Возврат СписокДокументов;
	КонецЕсли;
	
	НачалоПериода	= НачалоКвартала(СтруктураПараметров.НалоговыйПериод);
	КонецПериода	= КонецКвартала(СтруктураПараметров.НалоговыйПериод);
	
	НачалоПримененияПостановления1137 	= '20120401';
	НачалоПримененияПостановления735 	= '20141001';
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",	СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",	КонецПериода);
	Запрос.УстановитьПараметр("НачалоПримененияПостановления1137",  НачалоПримененияПостановления1137);
	Запрос.УстановитьПараметр("НачалоПримененияПостановления735",  	НачалоПримененияПостановления735);
	Запрос.УстановитьПараметр("ФормироватьКнигуПокупок",			ФормироватьКнигуПокупок);
	Запрос.УстановитьПараметр("ФормироватьКнигуПродаж",				ФормироватьКнигуПродаж);
	Запрос.УстановитьПараметр("ФормироватьЖурналУчетаСчетовФактур",	ФормироватьЖурналУчетаСчетовФактур);
	Запрос.УстановитьПараметр("ФормироватьДопЛистыКнигиПокупок",	ФормироватьДопЛистыКнигиПокупок);
	Запрос.УстановитьПараметр("ФормироватьДопЛистыКнигиПродаж",		ФормироватьДопЛистыКнигиПродаж);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(НДСЗаписиКнигиПокупок.Период, ДЕНЬ) КАК День,
	|	НАЧАЛОПЕРИОДА(НДСЗаписиКнигиПокупок.КорректируемыйПериод, КВАРТАЛ) КАК НалоговыйПериод
	|ПОМЕСТИТЬ ВТ_НДСЗаписиКнигиПокупокДо735
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПокупок КАК НДСЗаписиКнигиПокупок
	|ГДЕ
	|	&ФормироватьДопЛистыКнигиПокупок
	|	И НДСЗаписиКнигиПокупок.Организация = &Организация
	|	И НДСЗаписиКнигиПокупок.ЗаписьДополнительногоЛиста
	|	И НДСЗаписиКнигиПокупок.КорректируемыйПериод < &НачалоПримененияПостановления735
	|	И НДСЗаписиКнигиПокупок.КорректируемыйПериод >= &НачалоПримененияПостановления1137
	|	И НДСЗаписиКнигиПокупок.КорректируемыйПериод МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	День,
	|	НалоговыйПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&КонецПериода КАК День,
	|	НАЧАЛОПЕРИОДА(НДСЗаписиКнигиПокупок.КорректируемыйПериод, КВАРТАЛ) КАК НалоговыйПериод
	|ПОМЕСТИТЬ ВТ_НДСЗаписиКнигиПокупок735
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПокупок КАК НДСЗаписиКнигиПокупок
	|ГДЕ
	|	&ФормироватьДопЛистыКнигиПокупок
	|	И НДСЗаписиКнигиПокупок.Организация = &Организация
	|	И НДСЗаписиКнигиПокупок.ЗаписьДополнительногоЛиста
	|	И НДСЗаписиКнигиПокупок.КорректируемыйПериод >= &НачалоПримененияПостановления735
	|	И НДСЗаписиКнигиПокупок.КорректируемыйПериод МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НДСЗаписиКнигиПокупок.КорректируемыйПериод, КВАРТАЛ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	День,
	|	НалоговыйПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(НДСЗаписиКнигиПродаж.Период, ДЕНЬ) КАК День,
	|	НАЧАЛОПЕРИОДА(НДСЗаписиКнигиПродаж.КорректируемыйПериод, КВАРТАЛ) КАК НалоговыйПериод
	|ПОМЕСТИТЬ ВТ_НДСЗаписиКнигиПродажДо735
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|ГДЕ
	|	&ФормироватьДопЛистыКнигиПродаж
	|	И НДСЗаписиКнигиПродаж.Организация = &Организация
	|	И НДСЗаписиКнигиПродаж.ЗаписьДополнительногоЛиста
	|	И НДСЗаписиКнигиПродаж.КорректируемыйПериод < &НачалоПримененияПостановления735
	|	И НДСЗаписиКнигиПродаж.КорректируемыйПериод >= &НачалоПримененияПостановления1137
	|	И НДСЗаписиКнигиПродаж.КорректируемыйПериод МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	День,
	|	НалоговыйПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&КонецПериода КАК День,
	|	НАЧАЛОПЕРИОДА(НДСЗаписиКнигиПродаж.КорректируемыйПериод, КВАРТАЛ) КАК НалоговыйПериод
	|ПОМЕСТИТЬ ВТ_НДСЗаписиКнигиПродаж735
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|ГДЕ
	|	&ФормироватьДопЛистыКнигиПродаж
	|	И НДСЗаписиКнигиПродаж.Организация = &Организация
	|	И НДСЗаписиКнигиПродаж.ЗаписьДополнительногоЛиста
	|	И НДСЗаписиКнигиПродаж.КорректируемыйПериод >= &НачалоПримененияПостановления735
	|	И НДСЗаписиКнигиПродаж.КорректируемыйПериод МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НДСЗаписиКнигиПродаж.КорректируемыйПериод, КВАРТАЛ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	День,
	|	НалоговыйПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныйЛистКнигиПокупок.Ссылка,
	|	ДополнительныйЛистКнигиПокупок.Дата,
	|	НАЧАЛОПЕРИОДА(ДополнительныйЛистКнигиПокупок.Дата, ДЕНЬ) КАК День,
	|	ДополнительныйЛистКнигиПокупок.Номер,
	|	ДополнительныйЛистКнигиПокупок.НалоговыйПериод
	|ПОМЕСТИТЬ ВТ_ДополнительныеЛистыКнигиПокупокДо735
	|ИЗ
	|	Документ.ДопЛистКнигиПокупокДляПередачиВЭлектронномВиде КАК ДополнительныйЛистКнигиПокупок
	|ГДЕ
	|	&ФормироватьДопЛистыКнигиПокупок
	|	И ДополнительныйЛистКнигиПокупок.Организация = &Организация
	|	И НЕ ДополнительныйЛистКнигиПокупок.ПометкаУдаления
	|	И ДополнительныйЛистКнигиПокупок.НалоговыйПериод = &НачалоПериода
	|	И ДополнительныйЛистКнигиПокупок.НалоговыйПериод < &НачалоПримененияПостановления735
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	День,
	|	ДополнительныйЛистКнигиПокупок.НалоговыйПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныйЛистКнигиПокупок.Ссылка,
	|	ДополнительныйЛистКнигиПокупок.Дата,
	|	&КонецПериода КАК День,
	|	ДополнительныйЛистКнигиПокупок.Номер,
	|	ДополнительныйЛистКнигиПокупок.НалоговыйПериод
	|ПОМЕСТИТЬ ВТ_ДополнительныеЛистыКнигиПокупок735
	|ИЗ
	|	Документ.ДопЛистКнигиПокупокДляПередачиВЭлектронномВиде КАК ДополнительныйЛистКнигиПокупок
	|ГДЕ
	|	&ФормироватьДопЛистыКнигиПокупок
	|	И ДополнительныйЛистКнигиПокупок.Организация = &Организация
	|	И НЕ ДополнительныйЛистКнигиПокупок.ПометкаУдаления
	|	И ДополнительныйЛистКнигиПокупок.НалоговыйПериод = &НачалоПериода
	|	И ДополнительныйЛистКнигиПокупок.НалоговыйПериод >= &НачалоПримененияПостановления735
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	День,
	|	ДополнительныйЛистКнигиПокупок.НалоговыйПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныйЛистКнигиПродаж.Ссылка,
	|	ДополнительныйЛистКнигиПродаж.Дата,
	|	НАЧАЛОПЕРИОДА(ДополнительныйЛистКнигиПродаж.Дата, ДЕНЬ) КАК День,
	|	ДополнительныйЛистКнигиПродаж.Номер,
	|	ДополнительныйЛистКнигиПродаж.НалоговыйПериод
	|ПОМЕСТИТЬ ВТ_ДополнительныеЛистыКнигиПродажДо735
	|ИЗ
	|	Документ.ДопЛистКнигиПродажДляПередачиВЭлектронномВиде КАК ДополнительныйЛистКнигиПродаж
	|ГДЕ
	|	&ФормироватьДопЛистыКнигиПродаж
	|	И ДополнительныйЛистКнигиПродаж.Организация = &Организация
	|	И НЕ ДополнительныйЛистКнигиПродаж.ПометкаУдаления
	|	И ДополнительныйЛистКнигиПродаж.НалоговыйПериод = &НачалоПериода
	|	И ДополнительныйЛистКнигиПродаж.НалоговыйПериод < &НачалоПримененияПостановления735
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	День,
	|	ДополнительныйЛистКнигиПродаж.НалоговыйПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныйЛистКнигиПродаж.Ссылка,
	|	ДополнительныйЛистКнигиПродаж.Дата,
	|	&КонецПериода КАК День,
	|	ДополнительныйЛистКнигиПродаж.Номер,
	|	ДополнительныйЛистКнигиПродаж.НалоговыйПериод
	|ПОМЕСТИТЬ ВТ_ДополнительныеЛистыКнигиПродаж735
	|ИЗ
	|	Документ.ДопЛистКнигиПродажДляПередачиВЭлектронномВиде КАК ДополнительныйЛистКнигиПродаж
	|ГДЕ
	|	&ФормироватьДопЛистыКнигиПродаж
	|	И ДополнительныйЛистКнигиПродаж.Организация = &Организация
	|	И НЕ ДополнительныйЛистКнигиПродаж.ПометкаУдаления
	|	И ДополнительныйЛистКнигиПродаж.НалоговыйПериод = &НачалоПериода
	|	И ДополнительныйЛистКнигиПродаж.НалоговыйПериод >= &НачалоПримененияПостановления735
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	День,
	|	ДополнительныйЛистКнигиПродаж.НалоговыйПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""КнигаПокупокДляПередачиВЭлектронномВиде"" КАК Имя,
	|	КнигаПокупок.Ссылка КАК Документ,
	|	КнигаПокупок.Дата КАК Дата,
	|	КнигаПокупок.Номер КАК Номер,
	|	КнигаПокупок.НалоговыйПериод КАК НалоговыйПериод
	|ИЗ
	|	Документ.КнигаПокупокДляПередачиВЭлектронномВиде КАК КнигаПокупок
	|ГДЕ
	|	&ФормироватьКнигуПокупок
	|	И КнигаПокупок.Организация = &Организация
	|	И КнигаПокупок.НалоговыйПериод = &НачалоПериода
	|	И НЕ КнигаПокупок.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""КнигаПродажДляПередачиВЭлектронномВиде"",
	|	КнигаПродаж.Ссылка,
	|	КнигаПродаж.Дата,
	|	КнигаПродаж.Номер,
	|	КнигаПродаж.НалоговыйПериод
	|ИЗ
	|	Документ.КнигаПродажДляПередачиВЭлектронномВиде КАК КнигаПродаж
	|ГДЕ
	|	&ФормироватьКнигуПродаж
	|	И КнигаПродаж.Организация = &Организация
	|	И КнигаПродаж.НалоговыйПериод = &НачалоПериода
	|	И НЕ КнигаПродаж.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ЖурналУчетаСчетовФактурДляПередачиВЭлектронномВиде"",
	|	ЖурналУчетаСчетовФактур.Ссылка,
	|	ЖурналУчетаСчетовФактур.Дата,
	|	ЖурналУчетаСчетовФактур.Номер,
	|	ЖурналУчетаСчетовФактур.НалоговыйПериод
	|ИЗ
	|	Документ.ЖурналУчетаСчетовФактурДляПередачиВЭлектронномВиде КАК ЖурналУчетаСчетовФактур
	|ГДЕ
	|	&ФормироватьЖурналУчетаСчетовФактур
	|	И ЖурналУчетаСчетовФактур.Организация = &Организация
	|	И ЖурналУчетаСчетовФактур.НалоговыйПериод = &НачалоПериода
	|	И НЕ ЖурналУчетаСчетовФактур.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ДопЛистКнигиПокупокДляПередачиВЭлектронномВиде"",
	|	ВТ_ДополнительныеЛистыКнигиПокупокДо735.Ссылка,
	|	ВЫБОР
	|		КОГДА ВТ_ДополнительныеЛистыКнигиПокупокДо735.Ссылка ЕСТЬ NULL 
	|			ТОГДА ВТ_НДСЗаписиКнигиПокупокДо735.День
	|		ИНАЧЕ ВТ_ДополнительныеЛистыКнигиПокупокДо735.Дата
	|	КОНЕЦ,
	|	ВТ_ДополнительныеЛистыКнигиПокупокДо735.Номер,
	|	ВЫБОР
	|		КОГДА ВТ_ДополнительныеЛистыКнигиПокупокДо735.Ссылка ЕСТЬ NULL 
	|			ТОГДА ВТ_НДСЗаписиКнигиПокупокДо735.НалоговыйПериод
	|		ИНАЧЕ ВТ_ДополнительныеЛистыКнигиПокупокДо735.НалоговыйПериод
	|	КОНЕЦ
	|ИЗ
	|	ВТ_НДСЗаписиКнигиПокупокДо735 КАК ВТ_НДСЗаписиКнигиПокупокДо735
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ДополнительныеЛистыКнигиПокупокДо735 КАК ВТ_ДополнительныеЛистыКнигиПокупокДо735
	|		ПО ВТ_НДСЗаписиКнигиПокупокДо735.День = ВТ_ДополнительныеЛистыКнигиПокупокДо735.День
	|			И ВТ_НДСЗаписиКнигиПокупокДо735.НалоговыйПериод = ВТ_ДополнительныеЛистыКнигиПокупокДо735.НалоговыйПериод
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ДопЛистКнигиПокупокДляПередачиВЭлектронномВиде"",
	|	ВТ_ДополнительныеЛистыКнигиПокупок735.Ссылка,
	|	ВЫБОР
	|		КОГДА ВТ_ДополнительныеЛистыКнигиПокупок735.Ссылка ЕСТЬ NULL 
	|			ТОГДА ВТ_НДСЗаписиКнигиПокупок735.День
	|		ИНАЧЕ ВТ_ДополнительныеЛистыКнигиПокупок735.Дата
	|	КОНЕЦ,
	|	ВТ_ДополнительныеЛистыКнигиПокупок735.Номер,
	|	ВЫБОР
	|		КОГДА ВТ_ДополнительныеЛистыКнигиПокупок735.Ссылка ЕСТЬ NULL 
	|			ТОГДА ВТ_НДСЗаписиКнигиПокупок735.НалоговыйПериод
	|		ИНАЧЕ ВТ_ДополнительныеЛистыКнигиПокупок735.НалоговыйПериод
	|	КОНЕЦ
	|ИЗ
	|	ВТ_НДСЗаписиКнигиПокупок735 КАК ВТ_НДСЗаписиКнигиПокупок735
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ДополнительныеЛистыКнигиПокупок735 КАК ВТ_ДополнительныеЛистыКнигиПокупок735
	|		ПО ВТ_НДСЗаписиКнигиПокупок735.НалоговыйПериод = ВТ_ДополнительныеЛистыКнигиПокупок735.НалоговыйПериод
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ДопЛистКнигиПродажДляПередачиВЭлектронномВиде"",
	|	ВТ_ДополнительныеЛистыКнигиПродажДо735.Ссылка,
	|	ВЫБОР
	|		КОГДА ВТ_ДополнительныеЛистыКнигиПродажДо735.Ссылка ЕСТЬ NULL 
	|			ТОГДА ВТ_НДСЗаписиКнигиПродажДо735.День
	|		ИНАЧЕ ВТ_ДополнительныеЛистыКнигиПродажДо735.Дата
	|	КОНЕЦ,
	|	ВТ_ДополнительныеЛистыКнигиПродажДо735.Номер,
	|	ВЫБОР
	|		КОГДА ВТ_ДополнительныеЛистыКнигиПродажДо735.Ссылка ЕСТЬ NULL 
	|			ТОГДА ВТ_НДСЗаписиКнигиПродажДо735.НалоговыйПериод
	|		ИНАЧЕ ВТ_ДополнительныеЛистыКнигиПродажДо735.НалоговыйПериод
	|	КОНЕЦ
	|ИЗ
	|	ВТ_НДСЗаписиКнигиПродажДо735 КАК ВТ_НДСЗаписиКнигиПродажДо735
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ДополнительныеЛистыКнигиПродажДо735 КАК ВТ_ДополнительныеЛистыКнигиПродажДо735
	|		ПО ВТ_НДСЗаписиКнигиПродажДо735.День = ВТ_ДополнительныеЛистыКнигиПродажДо735.День
	|			И ВТ_НДСЗаписиКнигиПродажДо735.НалоговыйПериод = ВТ_ДополнительныеЛистыКнигиПродажДо735.НалоговыйПериод
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ДопЛистКнигиПродажДляПередачиВЭлектронномВиде"",
	|	ВТ_ДополнительныеЛистыКнигиПродаж735.Ссылка,
	|	ВЫБОР
	|		КОГДА ВТ_ДополнительныеЛистыКнигиПродаж735.Ссылка ЕСТЬ NULL 
	|			ТОГДА ВТ_НДСЗаписиКнигиПродаж735.День
	|		ИНАЧЕ ВТ_ДополнительныеЛистыКнигиПродаж735.Дата
	|	КОНЕЦ,
	|	ВТ_ДополнительныеЛистыКнигиПродаж735.Номер,
	|	ВЫБОР
	|		КОГДА ВТ_ДополнительныеЛистыКнигиПродаж735.Ссылка ЕСТЬ NULL 
	|			ТОГДА ВТ_НДСЗаписиКнигиПродаж735.НалоговыйПериод
	|		ИНАЧЕ ВТ_ДополнительныеЛистыКнигиПродаж735.НалоговыйПериод
	|	КОНЕЦ
	|ИЗ
	|	ВТ_НДСЗаписиКнигиПродаж735 КАК ВТ_НДСЗаписиКнигиПродаж735
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ДополнительныеЛистыКнигиПродаж735 КАК ВТ_ДополнительныеЛистыКнигиПродаж735
	|		ПО ВТ_НДСЗаписиКнигиПродаж735.НалоговыйПериод = ВТ_ДополнительныеЛистыКнигиПродаж735.НалоговыйПериод";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		СписокДокументов = Результат.Выгрузить();
	КонецЕсли;
	
	СписокДокументов.Индексы.Добавить("Имя");
	
	Если ФормироватьКнигуПокупок
		И СписокДокументов.Найти("КнигаПокупокДляПередачиВЭлектронномВиде", "Имя") = Неопределено Тогда
		НоваяСтрока	= СписокДокументов.Вставить(0);
		НоваяСтрока.Имя				= "КнигаПокупокДляПередачиВЭлектронномВиде";
		НоваяСтрока.Дата			= КонецПериода;
		НоваяСтрока.НалоговыйПериод	= НачалоПериода;
	КонецЕсли;
	
	Если ФормироватьКнигуПродаж
		И СписокДокументов.Найти("КнигаПродажДляПередачиВЭлектронномВиде", "Имя") = Неопределено Тогда
		НоваяСтрока	= СписокДокументов.Вставить(1);
		НоваяСтрока.Имя				= "КнигаПродажДляПередачиВЭлектронномВиде";
		НоваяСтрока.Дата			= КонецПериода;
		НоваяСтрока.НалоговыйПериод	= НачалоПериода;
	КонецЕсли;
	
	Если ФормироватьЖурналУчетаСчетовФактур
		И СписокДокументов.Найти("ЖурналУчетаСчетовФактурДляПередачиВЭлектронномВиде", "Имя") = Неопределено Тогда
		НоваяСтрока	= СписокДокументов.Вставить(2);
		НоваяСтрока.Имя				= "ЖурналУчетаСчетовФактурДляПередачиВЭлектронномВиде";
		НоваяСтрока.Дата			= КонецПериода;
		НоваяСтрока.НалоговыйПериод	= НачалоПериода;
	КонецЕсли;
	
	Возврат	СписокДокументов;

КонецФункции

// ОПЕРАЦИИ ПО СТАВКЕ НДС 0%

// Функция возвращает таблицу значений кодов операций НДС 0% с описанием из шаблона с учетом массивов включаемых и исключаемых операций НДС 0%
//
// Параметры:
//  ДатаЗапроса - Дата - дата, на которую получают доступные коды операций НДС 0%
//  ВключаемыеКодыКлассификаций - Массив - коды предопределенных значений справочника Операции0, 
//											которые должны быть включены в результирующую таблицу
//  ИсключаемыеКодыКлассификаций - Массив - коды предопределенных значений справочника Операции0, 
//											которые должны быть исключены из результирующей таблицы
//
// Возвращаемое значение:
//  - ТаблицаЗначений
//		- Колонки:
//			Код - Строка - код операции НДС 0%
//			Название - Строка - описание код операции НДС 0%
//			Номер - Число - порядковый номер строки таблицы для сортировки
Функция КлассификаторКодовОперацийПоСтавке0(Знач ДатаЗапроса, ВключаемыеКодыКлассификаций = Неопределено, ИсключаемыеКодыКлассификаций = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДатаЗапроса) Тогда
		
		ДатаЗапроса = ТекущаяДатаСеанса();
		
	КонецЕсли;
	
	КлассификаторXML = ПолучитьОбщийМакет("ПереченьКодовОпераций0").ПолучитьТекст();
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(КлассификаторXML);
	ТаблицаКодовОпераций0 = СериализаторXDTO.ПрочитатьXML(Чтение); // ТаблицаЗначений
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ШаблонЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаКодовОпераций0.Код КАК Код,
	|	ТаблицаКодовОпераций0.ДатаНачала КАК ДатаНачала,
	|	ТаблицаКодовОпераций0.ДатаОкончания КАК ДатаОкончания,
	|	ТаблицаКодовОпераций0.Классификация КАК Классификация,
	|	ТаблицаКодовОпераций0.Наименование КАК Название,
	|	АВТОНОМЕРЗАПИСИ() КАК Номер
	|ПОМЕСТИТЬ КодыОпераций0
	|ИЗ
	|	&ТаблицаКодовОпераций0 КАК ТаблицаКодовОпераций0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДатаОкончания,
	|	ДатаНачала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КодыОпераций0.Код КАК Код,
	|	КодыОпераций0.Название КАК Название,
	|	МАКСИМУМ(КодыОпераций0.Номер) КАК Номер
	|ИЗ
	|	КодыОпераций0 КАК КодыОпераций0
	|ГДЕ
	|	(КодыОпераций0.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|				И КодыОпераций0.ДатаНачала <= &ДатаЗапроса
	|			ИЛИ &ДатаЗапроса МЕЖДУ КодыОпераций0.ДатаНачала И КодыОпераций0.ДатаОкончания)
	|	И &ВключаемыеКодыКлассификаций
	|	И &ИсключаемыеКодыКлассификаций
	|
	|СГРУППИРОВАТЬ ПО
	|	КодыОпераций0.Код,
	|	КодыОпераций0.Название
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ КодыОпераций0";
	
	Запрос.Параметры.Вставить("ДатаЗапроса", ДатаЗапроса);
	Запрос.Параметры.Вставить("ТаблицаКодовОпераций0", ТаблицаКодовОпераций0);
	
	Если ВключаемыеКодыКлассификаций <> Неопределено Тогда
		
		ШаблонЗапроса = СтрЗаменить(ШаблонЗапроса, "&ВключаемыеКодыКлассификаций",
								"КодыОпераций0.Классификация В (&ВключаемыеКодыКлассификаций)");
		Запрос.Параметры.Вставить("ВключаемыеКодыКлассификаций", ВключаемыеКодыКлассификаций);
		
	Иначе
		
		Запрос.Параметры.Вставить("ВключаемыеКодыКлассификаций", Истина);
		
	КонецЕсли;
	
	Если ИсключаемыеКодыКлассификаций <> Неопределено Тогда
		
		ШаблонЗапроса = СтрЗаменить(ШаблонЗапроса, "&ИсключаемыеКодыКлассификаций",
								"НЕ КодыОпераций0.Классификация В (&ИсключаемыеКодыКлассификаций)");
		Запрос.Параметры.Вставить("ИсключаемыеКодыКлассификаций", ИсключаемыеКодыКлассификаций);
		
	Иначе
		
		Запрос.Параметры.Вставить("ИсключаемыеКодыКлассификаций", Истина);
		
	КонецЕсли;
	
	Запрос.Текст = ШаблонЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Функция возвращает таблицу значений кодов операций НДС 0%, ссылками на классификацию операций НДС 0% и представлением классификации НДС 0%
//с учетом массивов включаемых и исключаемых операций НДС 0%
//
// Параметры:
//  ДатаЗапроса - Дата - дата, на которую получают доступные коды операций НДС 0%
//  ВключаемыеКодыКлассификаций - Массив - коды предопределенных значений справочника Операции0, 
//											которые должны быть включены в результирующую таблицу
//  ИсключаемыеКодыКлассификаций - Массив - коды предопределенных значений справочника Операции0, 
//											которые должны быть исключены из результирующей таблицы
//
// Возвращаемое значение:
//  - ТаблицаЗначений
//		- Колонки:
//			КодОперации - Строка - код операции НДС 0%
//			Операции - СправочникСсылкаОперации0 - классификация кодов операций НДС 0%
//			ПредставлениеОпераций - Строка - представление классификация кодов операций НДС 0%
//											с расшифровкой по кодам операций НДС 0%
Функция ПредставлениеОперацийПоСтавке0 (Знач ДатаЗапроса, ВключаемыеКодыКлассификаций = Неопределено, ИсключаемыеКодыКлассификаций = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДатаЗапроса) Тогда
		
		ДатаЗапроса = ТекущаяДатаСеанса();
		
	КонецЕсли;
	
	КлассификаторXML = ПолучитьОбщийМакет("ПереченьКодовОпераций0").ПолучитьТекст();
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(КлассификаторXML);
	ТаблицаКодовОпераций0 = СериализаторXDTO.ПрочитатьXML(Чтение); // ТаблицаЗначений
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ШаблонЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаКодовОпераций0.Код КАК КодОперации,
	|	ТаблицаКодовОпераций0.ДатаНачала КАК ДатаНачала,
	|	ТаблицаКодовОпераций0.ДатаОкончания КАК ДатаОкончания,
	|	ТаблицаКодовОпераций0.Классификация КАК Классификация
	|ПОМЕСТИТЬ КодыОпераций0
	|ИЗ
	|	&ТаблицаКодовОпераций0 КАК ТаблицаКодовОпераций0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Классификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КодыОпераций0.КодОперации КАК КодОперации,
	|	Операции0.Ссылка КАК Операции,
	|	Операции0.Представление КАК Представление
	|ИЗ
	|	Справочник.Операции0 КАК Операции0
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КодыОпераций0 КАК КодыОпераций0
	|		ПО Операции0.Код = КодыОпераций0.Классификация
	|ГДЕ
	|	(КодыОпераций0.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|				И КодыОпераций0.ДатаНачала <= &ДатаЗапроса
	|			ИЛИ &ДатаЗапроса МЕЖДУ КодыОпераций0.ДатаНачала И КодыОпераций0.ДатаОкончания)
	|	И &ВключаемыеКодыКлассификаций
	|	И &ИсключаемыеКодыКлассификаций
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ КодыОпераций0";
	
	Запрос.Параметры.Вставить("ДатаЗапроса", ДатаЗапроса);
	Запрос.Параметры.Вставить("ТаблицаКодовОпераций0", ТаблицаКодовОпераций0);
	
	Если ВключаемыеКодыКлассификаций <> Неопределено Тогда
		
		ШаблонЗапроса = СтрЗаменить(ШаблонЗапроса, "&ВключаемыеКодыКлассификаций",
								"КодыОпераций0.Классификация В (&ВключаемыеКодыКлассификаций)");
		Запрос.Параметры.Вставить("ВключаемыеКодыКлассификаций", ВключаемыеКодыКлассификаций);
		
	Иначе
		
		Запрос.Параметры.Вставить("ВключаемыеКодыКлассификаций", Истина);
		
	КонецЕсли;
	
	Если ИсключаемыеКодыКлассификаций <> Неопределено Тогда
		
		ШаблонЗапроса = СтрЗаменить(ШаблонЗапроса, "&ИсключаемыеКодыКлассификаций",
								"НЕ КодыОпераций0.Классификация В (&ИсключаемыеКодыКлассификаций)");
		Запрос.Параметры.Вставить("ИсключаемыеКодыКлассификаций", ИсключаемыеКодыКлассификаций);
		
	Иначе
		
		Запрос.Параметры.Вставить("ИсключаемыеКодыКлассификаций", Истина);
		
	КонецЕсли;
	
	Запрос.Текст = ШаблонЗапроса;
	
	КС7 = Новый КвалификаторыСтроки(7); 
	КС1000 = Новый КвалификаторыСтроки(1000);
	
	// Создание описателя типов для таблицы значений
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС7 = Новый ОписаниеТипов(Массив, , КС7);
	ОписаниеТиповС1000 = Новый ОписаниеТипов(Массив, , КС1000);

	// Создание таблицы значений 

	ТаблицаСКодами = Новый ТаблицаЗначений;

	ТаблицаСКодами.Колонки.Добавить("КодОперации",ОписаниеТиповС7);
	ТаблицаСКодами.Колонки.Добавить("Операции",Новый ОписаниеТипов("СправочникСсылка.Операции0"));
	ТаблицаСКодами.Колонки.Добавить("ПредставлениеОпераций",ОписаниеТиповС1000);

	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТаблицы = ТаблицаСКодами.Добавить();
		СтрокаТаблицы.ПредставлениеОпераций = Выборка.Представление + НСтр("ru = ' (коды операций: '");
		СтрокаТаблицы.КодОперации = Выборка.КодОперации;
		СтрокаТаблицы.Операции = Выборка.Операции;
		
	КонецЦикла;
	
	Для каждого СтрокаТаблицы Из ТаблицаСКодами Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Операции", СтрокаТаблицы.Операции);
		Результат = ТаблицаСКодами.НайтиСтроки(Отбор);
		КодыОпераций = "";
		
		Для каждого СтрокаРезультата Из Результат Цикл
			КодыОпераций = КодыОпераций + ?(ЗначениеЗаполнено(КодыОпераций), "; ", "") + СтрокаРезультата.КодОперации;
		КонецЦикла;
		
		СтрокаТаблицы.ПредставлениеОпераций = СтрокаТаблицы.ПредставлениеОпераций +КодыОпераций+ ")";
		
	КонецЦикла;
	
	Возврат ТаблицаСКодами;

КонецФункции

// Возвращает признак того, есть ли в базе хоть одна организация, классифицирующая номенклатуру по операциям НДС 0%
//
// Возвращаемое значение - булево:
//                         ИСТИНА - есть организация, классифицирующая номенклатуру по операциям НДС 0%;
//                         ЛОЖЬ   - нет организаций, классифицирующих номенклатуру по операциям НДС 0%.
//
Функция ЕстьКлассификацияНоменклатурПоОперациям0() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиУчетаНДС.КлассифицироватьНоменклатуруПоОперациям0
	|ИЗ
	|	РегистрСведений.НастройкиУчетаНДС КАК НастройкиУчетаНДС
	|ГДЕ
	|	НастройкиУчетаНДС.КлассифицироватьНоменклатуруПоОперациям0";
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

//-- НЕ УТ

#КонецОбласти
