
#Область ПрограммныйИнтерфейс

// Если XMLСтрока еще не задана, то ОжидаемыйВид - обязательный параметр
//
Процедура УстановитьКомментарийКонтактнойИнформации(XMLСтрока, Комментарий, ОжидаемыйВид = Неопределено) Экспорт
	
	Если ПустаяСтрока(XMLСтрока) Тогда
		XMLСтрока = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению("", ОжидаемыйВид);
	КонецЕсли;
	
	УправлениеКонтактнойИнформацией.УстановитьКомментарийКонтактнойИнформации(XMLСтрока, Комментарий);
	
КонецПроцедуры

// Описание см. УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению()
//
Функция КонтактнаяИнформацияПоПредставлению(Представление, ОжидаемыйВид) Экспорт
	
	Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Представление, ОжидаемыйВид);
	
КонецФункции

// Строка - строка для обработки
//
Функция ПолучитьXMLСтрока(Строка) Экспорт
	
	Возврат КонтактнаяИнформацияУНФ.ПолучитьXMLСтрока(Строка);
	
КонецФункции

#КонецОбласти