#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция НастройкиПоОрганизациям() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ПланыВидовХарактеристик.НастройкиПользователей.ПодписиИДругиеРеквизитыПечати);	
	Результат.Добавить(ПланыВидовХарактеристик.НастройкиПользователей.ОрганизацияОплачиваетПеревозку);	
	Результат.Добавить(ПланыВидовХарактеристик.НастройкиПользователей.ОсновнойАвтомобиль);
	Результат.Добавить(ПланыВидовХарактеристик.НастройкиПользователей.ОсновнойВодитель);
	Результат.Добавить(ПланыВидовХарактеристик.НастройкиПользователей.ОсновнойПеревозчик);	
	Результат.Добавить(ПланыВидовХарактеристик.НастройкиПользователей.ПодписьСтаршегоКассира);
	Результат.Добавить(ПланыВидовХарактеристик.НастройкиПользователей.ПодписьКассира);	
	Результат.Добавить(ПланыВидовХарактеристик.НастройкиПользователей.ПодписьРуководителя);
	Результат.Добавить(ПланыВидовХарактеристик.НастройкиПользователей.ПодписьГлавногоБухгалтера);
	Результат.Добавить(ПланыВидовХарактеристик.НастройкиПользователей.ПодписьБухгалтера);
	Результат.Добавить(ПланыВидовХарактеристик.НастройкиПользователей.ПодписьМол);
	Результат.Добавить(ПланыВидовХарактеристик.НастройкиПользователей.УсловияСчетаЗаказа);
	Результат.Добавить(ПланыВидовХарактеристик.НастройкиПользователей.УсловияГарантии);
	Результат.Добавить(ПланыВидовХарактеристик.НастройкиПользователей.УсловияПриемки);
	Результат.Добавить(ПланыВидовХарактеристик.НастройкиПользователей.УсловияКоммерческогоПредложения);
	Результат.Добавить(ПланыВидовХарактеристик.НастройкиПользователей.РекламныйБлокСчетаЗаказа);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли