#Область ПрограммныйИнтерфейс

Функция ДатаНачалаДеятельности(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.ДатаРегистрации КАК Дата
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &Организация";
	
	НачалоИнтервала = '0001-01-01';
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НачалоИнтервала = Макс(НачалоИнтервала, Выборка.Дата);
	КонецЦикла;
	
	Возврат НачалоИнтервала;
	
КонецФункции

#КонецОбласти
