
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОткрытьУзелОбмена = Параметры.ОткрытьУзелОбмена;
	СсылкаНаУзелОбмена = Параметры.СсылкаНаУзелОбмена;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ОткрытьУзелОбмена Тогда
		ОписаниеУзлаОбменаВК = Новый Структура;
		ОписаниеУзлаОбменаВК.Вставить("Ключ" , СсылкаНаУзелОбмена);
		
		ОткрытьФорму("ПланОбмена.ИнтеграцияСМагазинамиСоцСетей.Форма.ФормаУзлаВКонтакте", ОписаниеУзлаОбменаВК, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокИнтеграцияСМагазинамиСоцСетей" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовЭлементовФормы

&НаКлиенте
Процедура ДобавитьНовуюИнтеграцию(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьНовуюИнтеграциюЗавершение",ЭтаФорма);
	
	ОткрытьФорму("ПланОбмена.ИнтеграцияСМагазинамиСоцСетей.Форма.ФормаУзлаВКонтакте",,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовуюИнтеграциюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда 
		ПоказатьЗначение(,Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
