#Область ОписаниеПеременных

&НаКлиенте
Перем СтрокаПоискаПоКБК;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФормыДокументовДеньги.ПриСозданииНаСервере(ЭтаФорма);
	
	ОтображениеПериодаРегистрации = Формат(Объект.ПериодРегистрации, НСтр("ru = 'ДФ=''MMMM yyyy'''"));
	
	ЭтоФизЛицо = Объект.Организация.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
	БезНалогаНДС = Объект.СтавкаНДС.НеОблагается;
	ВидКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "ВидКонтрагента");
	Договор = Объект.Договор;
	СпособЗаполненияСтавкиНДС = Справочники.ДоговорыКонтрагентов.СпособЗаполненияСтавкиНДСПоДоговору(
		Договор);
		
	ЗаполнитьРеквизитыФормыДляЕНП(Истина);
	
	РегулярныеПлатежиДатаЗаписи = Параметры.РегулярныеПлатежиДатаЗаписи;
	РегулярныеПлатежиИсходныйДокумент = Параметры.РегулярныеПлатежиИсходныйДокумент;
	РегулярныеПлатежиУдалитьЗаписьИзГрафика = Параметры.РегулярныеПлатежиУдалитьЗаписьИзГрафика;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			Если НЕ ЗначениеЗаполнено(Объект.БанковскийСчет)
				И ЗначениеЗаполнено(Объект.ДокументОснование)
				И ОбщегоНазначения.ЕстьРеквизитОбъекта("ВалютаДокумента", Объект.ДокументОснование.Метаданные()) 
				И Объект.ДокументОснование.ВалютаДокумента = Объект.Организация.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств Тогда
				Объект.БанковскийСчет = Объект.Организация.БанковскийСчетПоУмолчанию;
			ИначеЕсли НЕ ЗначениеЗаполнено(Объект.БанковскийСчет)
				И ЗначениеЗаполнено(Объект.ДокументОснование) 
				И Тип("ДокументСсылка.НачислениеНалогов") = ТипЗнч(Объект.ДокументОснование) Тогда
				Объект.БанковскийСчет = Объект.Организация.БанковскийСчетПоУмолчанию;				
			КонецЕсли; 
			
			Если НЕ ЗначениеЗаполнено(Объект.БанковскийСчет)
				И НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
				Объект.БанковскийСчет = Объект.Организация.БанковскийСчетПоУмолчанию;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Объект.ИННПлательщика) Тогда
				Объект.ИННПлательщика = Объект.Организация.ИНН;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Объект.КПППлательщика) Тогда
				НеобходимостьУказанияКПППлательщика = ПолучитьНеобходимостьУказанияКПП(Объект.БанковскийСчет, Объект.ВидОперации);
				Объект.КПППлательщика = ?(НеобходимостьУказанияКПППлательщика, Объект.Организация.КПП, "");
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Объект.ТекстПлательщика) Тогда
				СтруктураДанные = Новый Структура;
				СтруктураДанные.Вставить("НаименованиеПлательщикаПриПеречисленииНалогов",
				Объект.Организация.НаименованиеПлательщикаПриПеречисленииНалогов);
				СтруктураДанные.Вставить("ТекстКорреспондента", Объект.БанковскийСчет.ТекстКорреспондента);
				СтруктураДанные.Вставить("НаименованиеПолное", Объект.Организация.НаименованиеПолное);
				СтруктураДанные.Вставить("ТекстБанкДляРасчетов", Документы.ПлатежноеПоручение.ПолучитьТекстБанкДляРасчетов(
				Объект.БанковскийСчет));
				ЗаполнитьТекстПлательщика(СтруктураДанные);
			КонецЕсли;
			Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
				Если НЕ ЗначениеЗаполнено(Объект.СчетКонтрагента)
					И ЗначениеЗаполнено(Объект.ДокументОснование)
					И Объект.ДокументОснование.ВалютаДокумента = Объект.Контрагент.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств Тогда
					Объект.СчетКонтрагента = Объект.Контрагент.БанковскийСчетПоУмолчанию;
				КонецЕсли;
				Объект.ИННПолучателя = Объект.Контрагент.ИНН;
				Объект.КПППолучателя = Объект.Контрагент.КПП;
				Объект.ТекстПолучателя = ?(
				ЗначениеЗаполнено(Объект.СчетКонтрагента.ТекстКорреспондента),
				Объект.СчетКонтрагента.ТекстКорреспондента,
				Объект.Контрагент.НаименованиеПолное);
				СтруктураДанные = Новый Структура(
				"ТекстКорреспондента, НаименованиеПолное, ТекстБанкДляРасчетов",
				Объект.СчетКонтрагента.ТекстКорреспондента, Объект.Контрагент.НаименованиеПолное, Документы.ПлатежноеПоручение.ПолучитьТекстБанкДляРасчетов(Объект.СчетКонтрагента));
				ЗаполнитьТекстПолучателя(СтруктураДанные);
				Если ПустаяСтрока(СтруктураДанные.ТекстКорреспондента) Тогда
					
					Объект.ТекстПолучателя = СтруктураДанные.НаименованиеПолное;
					Если ЗначениеЗаполнено(СтруктураДанные.ТекстБанкДляРасчетов) Тогда
						Объект.ТекстПолучателя = Объект.ТекстПолучателя + СтруктураДанные.ТекстБанкДляРасчетов;
					КонецЕсли;
					
				Иначе
					
					Объект.ТекстПолучателя = СтруктураДанные.ТекстКорреспондента;
					
				КонецЕсли;
				
			КонецЕсли;
			Если Объект.ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога Тогда
				Если Объект.Налог = ПредопределенноеЗначение("Справочник.ВидыНалогов.ЕдиныйНалоговыйПлатеж") Тогда
					Объект.КодОКАТО = ЕдиныйНалоговыйСчет.ОКТМОЕдиногоНалоговогоСчета();
				Иначе
					Объект.КодОКАТО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "КодПоОКТМО");
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) И НЕ ЭтоВидОперацииБезНДС(Объект.ВидОперации) Тогда
				Объект.СтавкаНДС = РасчетыРаботаСФормамиВызовСервера.СтавкаНДСПоОрганизацииНалогообложениеНДСИСпособуЗаполнения(Объект.Организация, Объект.Дата, СпособЗаполненияСтавкиНДС);
				ОбновитьСуммуНДС();
			КонецЕсли;
			
			ЗаполнитьРеквизитыПоВидуОперации();
			
			ЗаполнитьВидПлатежаИзНастроек();
			
		КонецЕсли;
		
		ДокументыУНФ.ПолучитьНастройкиБыстрыхФорм(ЭтотОбъект);
		
	КонецЕсли;
	
	НазначениеПлатежа = Объект.НазначениеПлатежа;
	
	УстановитьСвязиПараметровВыбораДоступныеТипы();
	
	ИсходнаяСуммаРавнаНулю = (Объект.СуммаДокумента = 0);
	
	Если Объект.ПоказательПериода = "0"
	 ИЛИ ПустаяСтрока(Объект.ПоказательПериода)
	 ИЛИ ПустаяСтрока(СтрЗаменить(Объект.ПоказательПериода, ".", "")) Тогда
		ПериодичностьУплаты = "0";
	Иначе
		СтрокаВидаПериода = Лев(Объект.ПоказательПериода, 2);
		СтрокаПериода     = Сред(Объект.ПоказательПериода, 4, 2);
		СтрокаГода        = Сред(Объект.ПоказательПериода, 7);
		Если СтрокаВидаПериода = "ГД" Тогда
			ПериодичностьУплаты = "ГД";
		ИначеЕсли СтрокаВидаПериода = "ПЛ" Тогда
			ПериодичностьУплаты = "ПЛ";
		ИначеЕсли СтрокаВидаПериода = "КВ" Тогда
			ПериодичностьУплаты = "КВ";
		ИначеЕсли СтрокаВидаПериода = "МС" Тогда
			ПериодичностьУплаты = "МС";
		Иначе
			ПериодичностьУплаты = "-";
		КонецЕсли;
		Попытка
			ГодЧислом    = Число(СтрокаГода);
			ПериодЧислом = Число(СтрокаПериода);
			Если ПериодичностьУплаты = "-" Тогда
				ДеньЧислом  = Число(СтрокаВидаПериода);
				ДатаПлатежа = Дата(ГодЧислом, ПериодЧислом, ДеньЧислом);
			Иначе
				ГодПлатежа    = ГодЧислом;
				ПериодПлатежа = ПериодЧислом;
			КонецЕсли;
		Исключение
			ПериодичностьУплаты = "0";
		КонецПопытки;
	КонецЕсли;

	Если ПериодичностьУплаты = "0" Тогда
		Элементы.ГодПериод.Видимость = Ложь;
		Элементы.ДатаПлатежа.Видимость = Ложь;
	Иначе
		Если ПериодичностьУплаты = "-" Тогда
			Элементы.ГодПериод.Видимость = Ложь;
			Элементы.ДатаПлатежа.Видимость = Истина;
		Иначе
			Элементы.ГодПериод.Видимость = Истина;
			Элементы.ДатаПлатежа.Видимость = Ложь;
			Элементы.ПериодПлатежа.Видимость = ПериодичностьУплаты <> "ГД";
			Если ПериодичностьУплаты = "МС" Тогда
				Элементы.ПериодПлатежа.МинимальноеЗначение = 1;
				Элементы.ПериодПлатежа.МаксимальноеЗначение = 12;
				Элементы.ПериодПлатежа.Заголовок = НСтр("ru = 'Месяц'");
			ИначеЕсли ПериодичностьУплаты = "КВ" Тогда
				Элементы.ПериодПлатежа.МинимальноеЗначение = 1;
				Элементы.ПериодПлатежа.МаксимальноеЗначение = 4;
				Элементы.ПериодПлатежа.Заголовок = НСтр("ru = 'Квартал'");
			ИначеЕсли ПериодичностьУплаты = "ПЛ" Тогда
				Элементы.ПериодПлатежа.МинимальноеЗначение = 1;
				Элементы.ПериодПлатежа.МаксимальноеЗначение = 2;
				Элементы.ПериодПлатежа.Заголовок = НСтр("ru = 'Полугодие'");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
		СтруктураДанные = ПолучитьДанныеДокументОснованиеПриИзменении(Объект.ДокументОснование);
		НомерВходящегоДокумента = СтруктураДанные.НомерВходящегоДокумента;
		ДатаВходящегоДокумента = СтруктураДанные.ДатаВходящегоДокумента;
	КонецЕсли;

	УстановитьФормуС2014Года();
	УстановитьФормуС2015Года();
	
	ВестиРасчетыПоДокументам = Объект.Контрагент.ВестиРасчетыПоДокументам;
	ВестиРасчетыПоДоговорам = Объект.Контрагент.ВестиРасчетыПоДоговорам;
	ВестиУчетОплатыПоСчетам = Объект.Контрагент.ВестиУчетОплатыПоСчетам;
	
	УправлениеФормой(ЭтаФорма);
	УстановитьВидимостьПоДаннымКонтрагента();
	
	ЗаполнитьСписокОчередностьПлатежа();
	
	ДополнительныеДействияРасшифровкаПлатежа(Истина);
	ОбновитьДанныеПоФизЛицуНаСервере();
	ОбновитьЗаголовкиСворачиваемыхГруппНаСервере();
	ОбновитьТекстДекорацииНазначенияНаСервере();
	НастроитьСписокВыбораКодВидаДохода();
	УстановитьВидимостьКодаВидаДохода(ЭтотОбъект);
	УстановитьВидимостьКодаВыплат(ЭтотОбъект);
	
	НовыйМассив = Новый Массив();
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	ПараметрыВыбораДокументаОснования = НовыеПараметры;
	
	Если ТолькоПросмотр И НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Элементы.ДокументОснованиеНадпись.Доступность = Ложь;
	КонецЕсли;
	// Конец Документ основание.
	
	// Остатки ДС и взаиморасчетов на форме
	ОбновитьВидимостьИОстаткиВзаиморасчетов();
	ОбновитьВидимостьИОстаткиДС(Объект.БанковскийСчет);
	// Конец Остатки ДС и взаиморасчетов на форме
	
	АвтоподборКонтактов.ПодключитьОбработчикиСобытияАвтоподбор(ЭтотОбъект);
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	// ЭлектронноеВзаимодействие.ОбменСБанками
	ПараметрыОтображения = ОбменСБанкамиКлиентСервер.ПараметрыСозданияФормыДокумента();
	ПараметрыОтображения.МестоРасположенияСостояния = Элементы.Дополнительно.Имя;
	ОбменСБанками.ПриСозданииФормыДокументаНаСервере(ЭтотОбъект, ПараметрыОтображения);
	// Конец ЭлектронноеВзаимодействие.ОбменСБанками
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СовместноеИспользование
	ОписаниеКонтекста = СовместноеИспользованиеКлиентСервер.КонтекстОбработкиСобытия(ЭтотОбъект, Объект);
	СовместноеИспользование.ПриСозданииНаСервере(ОписаниеКонтекста, Элементы.ИнформационнаяПанельСовместногоИспользования);
	// Конец СовместноеИспользование
	
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечать);
	
	ИспользуетсяОтчетность = ПолучитьФункциональнуюОпцию("ИспользоватьОтчетность");
	
	// МобильныйКлиент
	МобильныйКлиентУНФ.НастроитьФормуОбъектаМобильныйКлиент(Элементы);
	// Конец МобильныйКлиент
	
	КодВидаДоходаПоУмолчанию();
	
	УстановитьСвойстваПоляСостояние(ЭтотОбъект);
	
	НадписьСледующийПлатеж = НадписьСледующийПлатеж(Объект.Ссылка);

	УстановитьВидимостьРегулярныеПлатежи(Элементы.НадписьСледующийПлатеж);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ВестиРасчетыПоДокументам = Объект.Контрагент.ВестиРасчетыПоДокументам;
	ВестиРасчетыПоДоговорам = Объект.Контрагент.ВестиРасчетыПоДоговорам;
	ВестиУчетОплатыПоСчетам = Объект.Контрагент.ВестиУчетОплатыПоСчетам;
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СовместноеИспользование
	ОписаниеКонтекста = СовместноеИспользованиеКлиентСервер.КонтекстОбработкиСобытия(ЭтотОбъект, Объект);
	СовместноеИспользование.ОбновитьИнформационнуюПанель(ОписаниеКонтекста);
	// Конец СовместноеИспользование
	
	Состояние = ПолучитьСостояниеОбмена(Объект.Ссылка);
	
	ДокументыУНФ.ПолучитьНастройкиБыстрыхФорм(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Обсуждения
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Модифицированность",Модифицированность);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Состояние", Состояние);
	// Конец Обсуждения
	
КонецПроцедуры // ПередЗаписьюНаСервере()

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Для работы с расшифровкой платежа
	ДатаПриСозданииНаСервере = Объект.Дата;
	ИсходнаяСуммаРавнаНулю = (Объект.СуммаДокумента = 0);
	// Конец Для работы с расшифровкой платежа
	
	// ЭлектронноеВзаимодействие.ОбменСБанками
	ОбменСБанками.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСБанками
	
	ОбновитьВидимостьИОстаткиВзаиморасчетов();
	ОбновитьВидимостьИОстаткиДС(Объект.БанковскийСчет);
	
	//Обсуждения
	ОбсужденияУНФ.ПослеЗаписиНаСервере(ТекущийОбъект);	
	// Конец Обсуждения
	
	Если ТекущийОбъект.ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.Оплата Тогда
		Справочники.ДоговорыКонтрагентов.ЗаписатьСпособЗаполненияСтавкиНДСПоДокументу(ТекущийОбъект.Договор,
			ТекущийОбъект.Ссылка, ТекущийОбъект.СуммаНДС > 0);
	КонецЕсли;
	
	СохранитьВидПлатежаВНастройки();
	
	Состояние = ПолучитьСостояниеОбмена(Объект.Ссылка);
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СовместноеИспользование
	ОписаниеКонтекста = СовместноеИспользованиеКлиентСервер.КонтекстОбработкиСобытия(ЭтотОбъект, Объект);
	СовместноеИспользование.ПослеЗаписиНаСервере(ОписаниеКонтекста);
	// Конец СовместноеИспользование
	
	Если РегулярныеПлатежиУдалитьЗаписьИзГрафика Тогда
		РегистрыСведений.РегулярныеПлатежиГрафик.УдалитьЗаписьИзГрафика(
			РегулярныеПлатежиИсходныйДокумент, РегулярныеПлатежиДатаЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ЭлектронноеВзаимодействие.ОбменСБанками
	ОбменСБанкамиКлиент.ОбработатьОповещениеФормыДокумента(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец ЭлектронноеВзаимодействие.ОбменСБанками
	
	Если ИмяСобытия = "ОповещениеОЗаписиРасходаСоСчета" И НЕ Модифицированность Тогда
		Прочитать();
	ИначеЕсли ИмяСобытия = "ОбновлениеГрафикаРегулярныхПлатежей" И Параметр = Истина Тогда
		НадписьСледующийПлатеж = НадписьСледующийПлатеж(Объект.Ссылка);
	КонецЕсли; 
	
	// Обсуждения
	ОбсужденияУНФКлиент.ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтотОбъект, Объект.Ссылка);
	// Конец Обсуждения

КонецПроцедуры // ОбработкаОповещения()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	Если СозданПоКомандеИзФормыСписка Тогда
		ПараметрыОповещения = Новый Структура("Ссылка", Объект.Ссылка);
		Оповестить("Запись_ПлатежноеПоручение", ПараметрыОповещения);
	КонецЕсли;
	
	НадписьСледующийПлатеж = НадписьСледующийПлатеж(Объект.Ссылка);
	
	// ЭлектронноеВзаимодействие.ОбменСБанками
	ОбменСБанкамиКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСБанками
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

// Процедура устанавливает видимость счета контрагента в зависимости от установленного параметра контрагенту.
//
&НаСервере
Процедура УстановитьВидимостьСчетаПолучателя()
	
	Элементы.СчетКонтрагента.Видимость = ЗначениеЗаполнено(Объект.Контрагент) 
									ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.ЛичныеСредстваПредпринимателя
									ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.ПереводНаДругойСчет;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоДаннымКонтрагента()
	
	УстановитьВидимостьСчетаПолучателя();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события ПриИзменении реквизита ПериодичностьУплаты.
// В процедуре устанавливается максимальное значение реквизита ПериодПлатежа в
// зависимости от реквизита ПериодичностьУплаты.
//
&НаКлиенте
Процедура ПериодичностьУплатыПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(ПериодичностьУплаты)) Тогда
		ПериодичностьУплаты= "0";
	КонецЕсли;

	Модифицированность = Истина;
	
	Если ПериодичностьУплаты <> "0"
	   И ПериодичностьУплаты <> "-" Тогда
		Если ГодПлатежа = 0 Тогда
			ГодПлатежа = Год(Объект.Дата);
		КонецЕсли;
		Если ПериодичностьУплаты = "ГД" Тогда
			ПериодПлатежа = 0;
		Иначе
			Если ПериодичностьУплаты = "МС" Тогда
				ПериодПлатежа = Мин(ПериодПлатежа, 12);
			ИначеЕсли ПериодичностьУплаты = "КВ" Тогда
				ПериодПлатежа = Мин(ПериодПлатежа, 4);
			ИначеЕсли ПериодичностьУплаты = "ПЛ" Тогда
				ПериодПлатежа = Мин(ПериодПлатежа, 2);
			КонецЕсли;
			ПериодПлатежа = Макс(1, ПериодПлатежа);
		КонецЕсли;
	Иначе
		ГодПлатежа = 0;
	КонецЕсли;
	
	УстановитьПоказательПериода();
	УстановитьДоступностьРеквизитовПеречисленияНалогов();
	
КонецПроцедуры // ПериодичностьУплатыПриИзменении()

// Процедура - обработчик события ПриИзменении реквизита ГодПлатежа.
// В процедуре устанавливается реквизит Показатель периода.
//
&НаКлиенте
Процедура ГодПлатежаПриИзменении(Элемент)
	
	Модифицированность = Истина;
	УстановитьПоказательПериода();
	
КонецПроцедуры // ГодПлатежаПриИзменении()

// Процедура - обработчик события ПриИзменении реквизита ПериодПлатежа.
// В процедуре устанавливается реквизит Показатель периода.
//
&НаКлиенте
Процедура ПериодПлатежаПриИзменении(Элемент)
	
	Модифицированность = Истина;
	УстановитьПоказательПериода();
	
КонецПроцедуры // ПериодПлатежаПриИзменении()

// Процедура - обработчик события ПриИзменении реквизита ДатаПлатежа.
// В процедуре устанавливается реквизит Показатель периода.
//
&НаКлиенте
Процедура ДатаПлатежаПриИзменении(Элемент)
	
	Модифицированность = Истина;
	УстановитьПоказательПериода();
	
КонецПроцедуры // ДатаПлатежаПриИзменении()

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	ОбновитьЗаголовокПлательщика();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Объект.Номер 			= "";
	СтруктураДанные 		= ПолучитьДанныеОрганизацияПриИзменении(Объект.Организация, Объект.БанковскийСчет, Объект.Контрагент, Объект.СчетКонтрагента, Объект.ВидОперации, Объект.Дата);
	Компания 				= СтруктураДанные.Компания;
	Объект.БанковскийСчет	= СтруктураДанные.БанковскийСчет;
	Объект.ВалютаДокумента	= СтруктураДанные.ВалютаДокумента;
	Объект.СчетКонтрагента	= СтруктураДанные.СчетКонтрагента;
	Объект.ИННПлательщика	= СтруктураДанные.ИННПлательщика;
	Объект.КПППлательщика	= СтруктураДанные.КПППлательщика;
	
	ЗаполнитьРеквизитыФормыДляЕНП();
	УправлениеФормой(ЭтотОбъект);
	
	ЗаполнитьТекстПлательщика(СтруктураДанные);
	
	ЭтоФизЛицо = СтруктураДанные.ЭтоФизЛицо;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога") Тогда
			Если Объект.Налог = ПредопределенноеЗначение("Справочник.ВидыНалогов.ЕдиныйНалоговыйПлатеж") Тогда
				Объект.КодОКАТО = ЕдиныйНалоговыйСчет.ОКТМОЕдиногоНалоговогоСчета();
			Иначе
				Объект.КодОКАТО = СтруктураДанные.КодОКАТО;
			КонецЕсли;
			Если ЭтоФизЛицо Тогда
				Объект.КПППлательщика = 0;
			КонецЕсли;
		Иначе
			Объект.КодОКАТО = "";
			Если ЭтоФизЛицо Тогда
				Объект.КПППлательщика = "";
			КонецЕсли;
		КонецЕсли;
	Иначе
		Объект.БанковскийСчет = ПредопределенноеЗначение("Справочник.БанковскиеСчета.ПустаяСсылка");
	КонецЕсли;
	
	ЗаполнитьРеквизитыПоВидуОперации();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении реквизита  СчетОрганизации.
//
&НаКлиенте
Процедура СчетОрганизацииПриИзменении(Элемент)
	
	СтруктураДанные = ПолучитьДанныеСчетОрганизацииПриИзменении(Объект.Организация, Объект.БанковскийСчет, Объект.ВалютаДокумента, Объект.Дата, Объект.ВидОперации);
	Объект.КПППлательщика = СтруктураДанные.КПППлательщика;
	
	Если НЕ Объект.ВалютаДокумента = СтруктураДанные.ВалютаДенежныхСредств Тогда
		
		Объект.СчетКонтрагента = Неопределено;
		Объект.ВалютаДокумента = СтруктураДанные.ВалютаДенежныхСредств;
		
		Если Объект.СуммаДокумента <> 0 Тогда
			ТекстСообщения = НСтр("ru = 'Изменилась валюта банковского счета. Пересчитать суммы документа?'");
			
			Режим = РежимДиалогаВопрос.ДаНет;
			
			ПоказатьВопрос(Новый ОписаниеОповещения("СчетОрганизацииПриИзмененииЗавершение", ЭтотОбъект,
				Новый Структура("СтруктураДанные", СтруктураДанные)), ТекстСообщения, Режим, 0);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьТекстПлательщика(СтруктураДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетОрганизацииПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт

	СтруктураДанные = ДополнительныеПараметры.СтруктураДанные;

	Ответ = Результат;

	Если ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		Курс = ?(
			СтруктураДанные.ВалютаКурсКратность.Курс = 0, 1, СтруктураДанные.ВалютаКурсКратность.Курс);
		Кратность = ?(
			СтруктураДанные.ВалютаКурсКратность.Кратность = 0, 1, СтруктураДанные.ВалютаКурсКратность.Кратность);
	КонецЕсли;

	Если Ответ = КодВозвратаДиалога.Да Тогда

		Объект.СуммаДокумента = ВалютыУНФКлиентСервер.Пересчитать(Объект.СуммаДокумента,
			СтруктураДанные.ВалютаКурсКратностьПередИзменением.Курс, СтруктураДанные.ВалютаКурсКратность.Курс,
			СтруктураДанные.ВалютаКурсКратностьПередИзменением.Кратность, СтруктураДанные.ВалютаКурсКратность.Кратность);
		Объект.СуммаНДС = ВалютыУНФКлиентСервер.Пересчитать(Объект.СуммаНДС,
			СтруктураДанные.ВалютаКурсКратностьПередИзменением.Курс, СтруктураДанные.ВалютаКурсКратность.Курс,
			СтруктураДанные.ВалютаКурсКратностьПередИзменением.Кратность, СтруктураДанные.ВалютаКурсКратность.Кратность);

		Для Каждого СтрокаТабличнойЧасти Из Объект.РасшифровкаПлатежа Цикл
			СтрокаТабличнойЧасти.СуммаПлатежа = ВалютыУНФКлиентСервер.Пересчитать(
				СтрокаТабличнойЧасти.СуммаПлатежа, СтруктураДанные.ВалютаКурсКратностьПередИзменением.Курс,
				СтруктураДанные.ВалютаКурсКратность.Курс, СтруктураДанные.ВалютаКурсКратностьПередИзменением.Кратность,
				СтруктураДанные.ВалютаКурсКратность.Кратность);

			РасчетыРаботаСФормамиКлиент.РассчитатьСуммуНДСНаКлиенте(СтрокаТабличнойЧасти);
		КонецЦикла;

	КонецЕсли;

	ЗаполнитьТекстПлательщика(СтруктураДанные);

КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Дата.
// В процедуре определяется ситуация, когда при изменении своей даты документ 
// оказывается в другом периоде нумерации документов, и в этом случае
// присваивает документу новый уникальный номер.
// Переопределяет соответствующий параметр формы.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДанныеДляИзмененияДаты = ДокументыУНФКлиент.ДанныеДляИзмененияДаты(ЭтотОбъект, Объект);
	Если ДанныеДляИзмененияДаты.ДатаНеМенялась Тогда
		Возврат;
	КонецЕсли;
	
	ДатаПриИзмененииНаСервере(ДанныеДляИзмененияДаты);
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога")
		И ((ПлатежиВБюджетКлиентСервер.ДействуетПриказ107н(Объект.Дата)
		И Не ПлатежиВБюджетКлиентСервер.ДействуетПриказ107н(ДанныеДляИзмененияДаты.ДатаПередИзменением))
		Или (Не ПлатежиВБюджетКлиентСервер.ДействуетПриказ107н(Объект.Дата)
		И ПлатежиВБюджетКлиентСервер.ДействуетПриказ107н(ДанныеДляИзмененияДаты.ДатаПередИзменением))) Тогда
		ЗаполнитьРеквизитыПлатежаВБюджетПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении реквизита ВидОперации.
// В процедуре устанавливается доступность реквизитов формы в зависимости от
// вида операции.
//
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Если Объект.ВидОперации = ВидОперации Тогда
		Возврат;
	КонецЕсли;
	ВидОперации = Объект.ВидОперации;
	
	СтруктураДанные = ПолучитьДанныеОрганизацияПриИзменении(Объект.Организация, Объект.БанковскийСчет, Объект.Контрагент, Объект.СчетКонтрагента, Объект.ВидОперации, Объект.Дата);
	
	Объект.КПППлательщика = СтруктураДанные.КПППлательщика;
	Объект.КПППолучателя = СтруктураДанные.КПППолучателя;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога") Тогда
		Объект.КодБК = "";
		Объект.КодОКАТО = СтруктураДанные.КодОКАТО;
		Объект.ВидПеречисленияВБюджет = ПредопределенноеЗначение("Перечисление.ВидыПеречисленийВБюджет.НалоговыйПлатеж");
		Если ЭтоФизЛицо Тогда
			Объект.КПППлательщика = 0;
		КонецЕсли;
		ЗаполнитьРеквизитыПлатежаВБюджетПоУмолчанию();
		Объект.ИдентификаторПлатежа = "";
		Элементы.ИдентификаторПлатежа.Заголовок = НСтр("ru = 'УИН'");
	Иначе
		Объект.КодБК  = "";
		Объект.КодОКАТО = "";
		Объект.СтатусСоставителя = "";
		Объект.ПоказательОснования = "";
		Объект.ПоказательТипа = "";
		Объект.ПоказательПериода = "";
		Объект.ПоказательНомера = "";
		Объект.ПоказательДаты = "";
		ПериодичностьУплаты = "";
		ГодПлатежа = 0;
		ПериодПлатежа = 0;
		Объект.ВидПеречисленияВБюджет = Неопределено;
		Если ЭтоФизЛицо Тогда
			Объект.КПППлательщика = "";
		КонецЕсли;
		Объект.ИдентификаторПлатежа = "";
		Элементы.ИдентификаторПлатежа.Заголовок = НСтр("ru = 'УИП'");
	КонецЕсли;
	
	ОчиститьРеквизитыНеОтносящиесяКОперации();
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога")
	   И ЗначениеЗаполнено(СтруктураДанные.НаименованиеПлательщикаПриПеречисленииНалогов) Тогда
		Объект.ТекстПлательщика = СтруктураДанные.НаименованиеПлательщикаПриПеречисленииНалогов;
	Иначе
		Объект.ТекстПлательщика = ?(
			ЗначениеЗаполнено(СтруктураДанные.ТекстКорреспондента),
			СтруктураДанные.ТекстКорреспондента,
			СтруктураДанные.НаименованиеПолное);
	КонецЕсли;
	
	Если (ЗначениеЗаполнено(Объект.Дата) И Объект.Дата >= ПлатежиВБюджетКлиентСервер.НачалоПримененияИдентификатораПлатежа())
	 ИЛИ (НЕ ЗначениеЗаполнено(Объект.Дата) И ОбщегоНазначенияКлиент.ДатаСеанса() >= ПлатежиВБюджетКлиентСервер.НачалоПримененияИдентификатораПлатежа())
	 ИЛИ (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога")) Тогда
		Элементы.ИдентификаторПлатежа.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Авто;
		Элементы.ИдентификаторПлатежа.ПредупреждениеПриРедактировании = "";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Оплата") Тогда
		Элементы.ИдентификаторПлатежа.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать;
		Элементы.ИдентификаторПлатежа.ПредупреждениеПриРедактировании = НСтр("ru = 'До 31.03.2014 идентификатор платежа используется только для платежей в бюджет'");
	КонецЕсли;
	
	ВидОперацииПриИзмененииФрагментНаСервере();
	ОбновитьЗаголовокПлательщика();
	ОбновитьЗаголовокПолучателя();
	СформироватьНазначениеПлатежа();
	
	// Заменим (добавим) УИН (уникальный идентификатор начисления)
	// С 01 января 2014 по 30 марта 2014 он указывается в назначении платежа
	ПлатежиВБюджетКлиентСервер.ЗаменитьВНазначенииПлатежаУИН(
		Объект.НазначениеПлатежа,
		Объект.ИдентификаторПлатежа,
		Объект.Дата,
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога"));
	
КонецПроцедуры // ВидОперацииПриИзменении()

&НаСервере
Процедура ВидОперацииПриИзмененииФрагментНаСервере()
	
	// БЗКБ
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.Зарплата Тогда
		ПоказыватьЭлементыБЗКБ = Справочники.Организации.НужноПоказыватьЭлементыБЗКБДляОрганизации(Объект.Организация);
	Иначе
		ПоказыватьЭлементыБЗКБ = Ложь;
	КонецЕсли;
	// Конец БЗКБ
	
	ФормыДокументовДеньги.УстановитьВидимостьЭлементовВЗависимостиОтВидаОперации(ЭтаФорма);
	ДополнительныеДействияРасшифровкаПлатежа(Истина);
	ЗаполнитьРеквизитыПоВидуОперации();
	УстановитьСтатьюДДСПриСменеВидаОперации();
	
	// Код вида дохода
	НастроитьСписокВыбораКодВидаДохода();
	УстановитьВидимостьКодаВидаДохода(ЭтотОбъект);
	УстановитьВидимостьКодаВыплат(ЭтотОбъект);
	КодВидаДоходаПоУмолчанию();
	
	УстановитьСвязиПараметровВыбораДоступныеТипы(); 
	
	// ЕНП
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога")
		И Объект.Налог = ПредопределенноеЗначение("Справочник.ВидыНалогов.ЕдиныйНалоговыйПлатеж") Тогда
		Объект.КодОКАТО = ЕдиныйНалоговыйСчет.ОКТМОЕдиногоНалоговогоСчета();
	КонецЕсли;
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.ЛичныеСредстваПредпринимателя Тогда
		Если Справочники.Организации.ЭтоЮрЛицо(Объект.Организация) Тогда
			Объект.Организация = Справочники.Организации.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении реквизита Контрагент.
// В процедуре устанавливаются реквизиты формы, относящиеся к контрагенту.
//
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент, ВосстанавливатьСтавкиНДС = Истина)
	
	КонтрагентПередИзменением = Контрагент;
	Контрагент = Объект.Контрагент;
	СтруктураДанные = ДанныеКонтрагентаДляИзменения(Объект.Контрагент, Объект.ВалютаДокумента, Объект.ВидОперации);
	
	ВидКонтрагента = СтруктураДанные.ВидКонтрагента;
	
	Если КонтрагентПередИзменением <> Объект.Контрагент Тогда
		ОчиститьКодВыплат();
		Объект.Договор = СтруктураДанные.Договор;
		Договор = Объект.Договор;
		Объект.РасшифровкаПлатежа.Очистить();
		Если ЗначениеЗаполнено(СтруктураДанные.СтатьяДДСПоУмолчанию) Тогда
			Объект.Статья = СтруктураДанные.СтатьяДДСПоУмолчанию;
		КонецЕсли;
	Иначе
		Объект.Договор = Договор; // Восстанавливаем автоматически очищенный договор.
	КонецЕсли;
	
	СпособЗаполненияСтавкиНДСДоИзменения = СпособЗаполненияСтавкиНДС;
	СпособЗаполненияСтавкиНДС = СтруктураДанные.СпособЗаполненияСтавкиНДС;
	Если СпособЗаполненияСтавкиНДСДоИзменения <> СпособЗаполненияСтавкиНДС 
		И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Оплата") Тогда 
		Объект.СтавкаНДС = РасчетыРаботаСФормамиВызовСервера.СтавкаНДСПоОрганизацииНалогообложениеНДСИСпособуЗаполнения(Объект.Организация, Объект.Дата, СпособЗаполненияСтавкиНДС);
	КонецЕсли;
	
	Если СтруктураДанные.Свойство("ДоговорКредитаЗаймаПоУмолчанию") Тогда
		Объект.ДоговорКредитаЗайма = СтруктураДанные.ДоговорКредитаЗаймаПоУмолчанию;
		ОбработатьИзменениеДоговораКредитаИлиЗайма();
	КонецЕсли;
	
	Объект.СчетКонтрагента 	= СтруктураДанные.СчетКонтрагента;
	Объект.ИННПолучателя	= СтруктураДанные.ИННПолучателя;
	Объект.КПППолучателя	= СтруктураДанные.КПППолучателя;
	ЗаполнитьТекстПолучателя(СтруктураДанные);
	
	НазначениеПлатежа 		= СтруктураДанные.НазначениеПлатежа;
	
	ОбновитьЗаголовокПолучателя();
	ДополнительныеДействияРасшифровкаПлатежа();
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
		
		Объект.РасшифровкаПлатежа[0].Договор = СтруктураДанные.Договор;
		Объект.РасшифровкаПлатежа[0].СтавкаНДС = РасчетыРаботаСФормамиВызовСервера.СтавкаНДСПоОрганизацииНалогообложениеНДСИСпособуЗаполнения(
			Объект.Организация, Объект.Дата, СтруктураДанные.СпособЗаполненияСтавкиНДС);
		
		Если ЗначениеЗаполнено(Объект.РасшифровкаПлатежа[0].Договор) Тогда
			Объект.РасшифровкаПлатежа[0].Курс = ?(
				СтруктураДанные.ДоговорВалютаКурсКратность.Курс = 0,
				1,
				СтруктураДанные.ДоговорВалютаКурсКратность.Курс);
			Объект.РасшифровкаПлатежа[0].Кратность = ?(
				СтруктураДанные.ДоговорВалютаКурсКратность.Кратность = 0,
				1,
				СтруктураДанные.ДоговорВалютаКурсКратность.Кратность);
		КонецЕсли;
		
		Объект.РасшифровкаПлатежа[0].Курс = ?(
			Объект.РасшифровкаПлатежа[0].Курс = 0,
			1,
			Объект.РасшифровкаПлатежа[0].Курс);
		Объект.РасшифровкаПлатежа[0].Кратность = ?(
			Объект.РасшифровкаПлатежа[0].Кратность = 0,
			1,
			Объект.РасшифровкаПлатежа[0].Кратность);
		
		Объект.РасшифровкаПлатежа[0].СуммаРасчетов = ВалютыУНФКлиентСервер.Пересчитать(
			Объект.РасшифровкаПлатежа[0].СуммаПлатежа, Курс, Объект.РасшифровкаПлатежа[0].Курс, Кратность,
			Объект.РасшифровкаПлатежа[0].Кратность);
		
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Оплата") Тогда
			Объект.РасшифровкаПлатежа[0].СпособЗачета = РасчетыРаботаСФормамиВызовСервера.СпособРазнесенияОплатыДляДоговора(
			Объект.РасшифровкаПлатежа[0].Договор,
			Объект.Контрагент);
		КонецЕсли;
		
		Если СтруктураДанные.Свойство("Проект") Тогда
			Объект.РасшифровкаПлатежа[0].Проект = СтруктураДанные.Проект;
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураДанные.Свойство("Проект") Тогда
		Объект.Проект = СтруктураДанные.Проект;
	КонецЕсли;
	
	ВестиРасчетыПоДокументам = СтруктураДанные.ВестиРасчетыПоДокументам;
	ВестиРасчетыПоДоговорам = СтруктураДанные.ВестиРасчетыПоДоговорам;
	ВестиУчетОплатыПоСчетам = СтруктураДанные.ВестиУчетОплатыПоСчетам;
	
	СуммаДокументаПриИзмененииФрагмент(ВосстанавливатьСтавкиНДС);
	КонтрагентПриИзмененииФрагментНаСервере();
	
КонецПроцедуры // КонтрагентПриИзменении()

&НаКлиенте
Процедура КонтрагентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если НЕ ИспользоватьБыструюФормуКонтрагентовВДокументах Тогда
		Возврат
	КонецЕсли;
	
	ПараметрыПолученияДанных.Вставить("ВидОперации", Объект.ВидОперации);
	БыстрыеФормыУНФКлиент.КонтрагентАвтоПодбор(
		Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если НЕ ИспользоватьБыструюФормуКонтрагентовВДокументах Тогда
		Возврат
	КонецЕсли;
	
	ПараметрыПолученияДанных.Вставить("ВидОперации", Объект.ВидОперации);
	БыстрыеФормыУНФКлиент.КонтрагентОкончаниеВводаТекста(
		Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если НЕ ИспользоватьБыструюФормуКонтрагентовВДокументах Тогда
		Возврат
	КонецЕсли;
	
	ПараметрыОбъекта = Новый Структура("ВидОперации", Объект.ВидОперации);
	БыстрыеФормыУНФКлиент.ОткрытьБыструюФормуКонтрагента(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ПараметрыОбъекта, Истина);
	
КонецПроцедуры


&НаСервере
Процедура КонтрагентПриИзмененииФрагментНаСервере()
	
	СформироватьНазначениеПлатежа();
	ФормыДокументовДеньги.УстановитьСтатьиДДСВРасшифровкеПлатежа(ЭтотОбъект);
	УстановитьВидимостьКодаВидаДохода(ЭтотОбъект);
	УстановитьВидимостьКодаВыплат(ЭтотОбъект);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении реквизита СчетКонтрагента.
// В процедуре устанавливаются реквизиты формы, относящиеся к счету контрагента.
//
&НаКлиенте
Процедура СчетКонтрагентаПриИзменении(Элемент)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ЗарплатаСотруднику")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Подотчетнику") Тогда
	
		СтруктураДанные = ПолучитьДанныеСчетКонтрагентаПриИзменении(Объект.Контрагент, Объект.СчетКонтрагента, Объект.ВидОперации);
	Иначе
		СтруктураДанные = ПолучитьДанныеСчетКонтрагентаПриИзменении(Объект.Контрагент, Объект.СчетКонтрагента, Объект.ВидОперации);
	КонецЕсли;
	
	Объект.КПППолучателя = СтруктураДанные.КПППолучателя;
	ЗаполнитьТекстПолучателя(СтруктураДанные);
	
	СформироватьНазначениеПлатежа();
	
	ЗаполнитьРеквизитыПоВидуОперации();
	
КонецПроцедуры // СчетКонтрагентаПриИзменении()

// Процедура - обработчик события ПриИзменении реквизита ИННПолучателя.
//
&НаКлиенте
Процедура ИННПолучателяПриИзменении(Элемент)
	ОбновитьЗаголовокПолучателя();
КонецПроцедуры

// Процедура - обработчик события ПриИзменении реквизита КПППолучателя.
//
&НаКлиенте
Процедура КПППолучателяПриИзменении(Элемент)
	ОбновитьЗаголовокПолучателя();
КонецПроцедуры

// Процедура - обработчик события ПриИзменении реквизита ТекстПолучателя.
//
&НаКлиенте
Процедура ТекстПолучателяПриИзменении(Элемент)
	ОбновитьЗаголовокПолучателя();
КонецПроцедуры

// Процедура - обработчик события ПриИзменении реквизита ИННПлательщика.
//
&НаКлиенте
Процедура ИННПлательщикаПриИзменении(Элемент)
	ОбновитьЗаголовокПлательщика();
КонецПроцедуры

// Процедура - обработчик события ПриИзменении реквизита КПППлательщика.
//
&НаКлиенте
Процедура КПППлательщикаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Организация)
	И НЕ ЗначениеЗаполнено(Объект.КПППлательщика)
	И Строка(Объект.ВидОперации) = "Перечисление в бюджет"
	И ЭтоФизЛицо Тогда
		Объект.КПППлательщика = 0;
	КонецЕсли;
	
	ОбновитьЗаголовокПлательщика();
	
КонецПроцедуры // КПППлательщикаПриИзменении()

// Процедура - обработчик события ПриИзменении реквизита ТекстПлательщика.
//
&НаКлиенте
Процедура ТекстПлательщикаПриИзменении(Элемент)
	ОбновитьЗаголовокПлательщика();
КонецПроцедуры

// Процедура - обработчик события ПриИзменении реквизита СуммаДокумента.
// В процедуре формируется реквизит НазначениеПлатежа.
//
&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	
	ИсходнаяСуммаРавнаНулю = (Объект.СуммаДокумента = 0);
	
	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(Объект.СтавкаНДС);
	
	Объект.СуммаНДС = Объект.СуммаДокумента - (Объект.СуммаДокумента) / ((СтавкаНДС + 100) / 100);
	
	СформироватьНазначениеПлатежа(Истина);
	
	СуммаДокументаПриИзмененииФрагмент();
	
КонецПроцедуры // СуммаДокументаПриИзменении()

// Процедура - обработчик события ПриИзменении реквизита СтавкаНДС.
// В процедуре рассчитывается сумма НДС и формируется реквизит НазначениеПлатежа.
//
&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	СтруктураДанные = ПолучитьДанныеСтавкаНДСПриИзменении(Объект.СтавкаНДС);
	
	СтавкаНДС = СтруктураДанные.Ставка;
	БезНалогаНДС = СтруктураДанные.НеОблагается;
	
	Объект.СуммаНДС = Объект.СуммаДокумента - (Объект.СуммаДокумента) / ((СтавкаНДС + 100) / 100);
	
	СтавкаНДСПоУмолчанию =  Объект.СтавкаНДС;
	СтавкаНДСПоУмолчаниюЧисло = СтавкаНДС;
	
	СуммаДокументаПриИзмененииФрагмент();
	СформироватьНазначениеПлатежа(Истина);
	
КонецПроцедуры // СтавкаНДСПриИзменении()

// Процедура - обработчик события ПриИзменении реквизита СуммаНДС.
// В процедуре формируется реквизит НазначениеПлатежа.
//
&НаКлиенте
Процедура СуммаНДСПриИзменении(Элемент)
	
	СформироватьНазначениеПлатежа(Истина);
	
КонецПроцедуры // СуммаНДСПриИзменении()

// Процедура - обработчик события ПриИзменении реквизита ВидПеречисленияВБюджет.
//
&НаКлиенте
Процедура ВидПеречисленияВБюджетПриИзменении(Элемент)
	
	НастроитьСписокВыбора(
		Элементы.ПоказательОснования,
		ПлатежиВБюджетКлиентСервер.ОснованияПлатежа(Объект.ВидПеречисленияВБюджет, Объект.Дата));
	
	НастроитьСписокВыбора(
		Элементы.ПоказательТипа,
		ПлатежиВБюджетКлиентСервер.ТипыПлатежа(Объект.ВидПеречисленияВБюджет, Объект.Дата));
	
	ЗаполнитьРеквизитыПлатежаВБюджетПоУмолчанию();
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры // ВидПеречисленияВБюджетПриИзменении()

// Процедура - обработчик события ПриИзменении реквизита СтатусСоставителя.
//
&НаКлиенте
Процедура СтатусСоставителяПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Объект.СтатусСоставителя)) Тогда
		Объект.СтатусСоставителя = "01";
	КонецЕсли;
		
КонецПроцедуры // СтатусСоставителяПриИзменении()

// Процедура - обработчик события ПриИзменении реквизита ПоказательОснования.
//
&НаКлиенте
Процедура ПоказательОснованияПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Объект.ПоказательОснования)) Тогда
		Объект.ПоказательОснования = "0";
	КонецЕсли;

КонецПроцедуры // ПоказательОснованияПриИзменении()

// Процедура - обработчик события ПриИзменении реквизита ПоказательТипа.
//
&НаКлиенте
Процедура ПоказательТипаПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Объект.ПоказательТипа)) Тогда
		Объект.ПоказательТипа = "0";
	КонецЕсли;
	
КонецПроцедуры // ПоказательТипаПриИзменении()

// Процедура - обработчик события ПриИзменении реквизита ПоказательПериодаТаможенныйПлатеж.
//
&НаКлиенте
Процедура ПоказательПериодаТаможенныйПлатежПриИзменении(Элемент)
	
	Если Объект.ВидПеречисленияВБюджет <> ПредопределенноеЗначение("Перечисление.ВидыПеречисленийВБюджет.ТаможенныйПлатеж")
	   И НЕ ЗначениеЗаполнено(СокрЛП(Объект.ПоказательПериода)) Тогда
		Объект.ПоказательПериода = "0";
	КонецЕсли;
	
КонецПроцедуры // ПоказательПериодаТаможенныйПлатежПриИзменении()

// Процедура - обработчик события ПриИзменении реквизита ПоказательПериодаИнойПлатеж.
//
&НаКлиенте
Процедура ПоказательПериодаИнойПлатежПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Объект.ПоказательПериода)) Тогда
		Объект.ПоказательПериода = "0";
	КонецЕсли;

КонецПроцедуры // ПоказательПериодаИнойПлатежПриИзменении()

&НаКлиенте
Процедура ОстатокВзаиморасчетовОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСФормойДокументаКлиент.ОткрытьОтчетВзаиморасчетыСКонтрагентом(Объект.Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстатокДенежныхСредствОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСФормойДокументаКлиент.ОткрытьОтчетДенежныеСредства(Объект.БанковскийСчет);
	
КонецПроцедуры

&НаКлиенте
Процедура НалогОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если СтрДлина(Текст) > 13 Тогда
		
		СтрокаПоискаПоКБК = СтрЗаменить(ПараметрыПолученияДанных.СтрокаПоиска, " ", "");
		
		Если СтрДлина(СтрокаПоискаПоКБК) <= 20 И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СтрокаПоискаПоКБК) Тогда
			
			// Строка поиска похожа на КБК. Код включает код подвида доходов.
			ДанныеВыбора = ДвиженияДенежныхСредствВызовСервера.ДанныеВыбораНалогаПоКБК(СтрокаПоискаПоКБК);
			
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НалогАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если СтрДлина(Текст) > 13 Тогда
		
		СтрокаПоискаПоКБК = СтрЗаменить(ПараметрыПолученияДанных.СтрокаПоиска, " ", "");
		
		Если СтрДлина(СтрокаПоискаПоКБК) <= 20 И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СтрокаПоискаПоКБК) Тогда
			
			// Строка поиска похожа на КБК. Код включает код подвида доходов.
			ДанныеВыбора = ДвиженияДенежныхСредствВызовСервера.ДанныеВыбораНалогаПоКБК(СтрокаПоискаПоКБК);
			
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НалогПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Налог) Тогда
		СформироватьНазначениеПлатежа();
		
		НастроитьСписокВыбора(
			Элементы.ПоказательОснования,
			ПлатежиВБюджетКлиентСервер.ОснованияПлатежа(Объект.ВидПеречисленияВБюджет, Объект.Дата));
		
		НастроитьСписокВыбора(
			Элементы.ПоказательТипа,
			ПлатежиВБюджетКлиентСервер.ТипыПлатежа(Объект.ВидПеречисленияВБюджет, Объект.Дата));
		
		ЗаполнитьРеквизитыПлатежаВБюджетПоУмолчанию();
		УправлениеФормой(ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодБКПриИзменении(Элемент)
	КодБК = ПлатежиВБюджетКлиентСервер.ОставитьВСтрокеТолькоЦифры(Объект.КодБК);
	Объект.КодБК = КодБК;
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "НачалоВыбора");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидДоговораПриСоздании(ВидОперации)
	Если ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога Тогда
		Возврат Перечисления.ВидыДоговоров.Прочее;
	Иначе
		Возврат Перечисления.ВидыДоговоров.СПоставщиком;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПодотчетникПриИзменении(Элемент)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ЗарплатаСотруднику") Тогда
		Объект.Подразделение = РасчетыРаботаСФормамиВызовСервера.ПолучитьТекущееПодразделениеСотрудника(Объект.Подотчетник);
	КонецЕсли;
	
	ОбновитьДанныеПоФизЛицуНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.Подотчетник.Пустая() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Сначала нужно выбрать подотчетника'"), ,
			"Объект.Подотчетник");
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаИПерсоналКлиент.ПриРегулированииПериодаРегистрации(ЭтотОбъект, Направление);
	ЗарплатаИПерсоналКлиент.ПриИзмененииПериодаРегистрации(ЭтотОбъект);
	
КонецПроцедуры //ПериодРегистрацииРегулирование()

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.ПериодРегистрации) Тогда
		ДатаКалендаряПриОткрытии = Объект.ПериодРегистрации;
	Иначе
		ДатаКалендаряПриОткрытии = ОбщегоНазначенияКлиент.ДатаСеанса();
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ФормаКалендаря", ОбщегоНазначенияУНФКлиент.ПараметрыОткрытияФормыКалендаря(
		ДатаКалендаряПриОткрытии), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетКонтрагентаРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент,
	НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ключ", Объект.Подотчетник);
	СтруктураПараметров.Вставить("НеобходимаОтметкаФизЛицо", Истина);
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеЗаполнениеФизЛица", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаЭлемента", СтруктураПараметров, ЭтотОбъект, , , ,
		ОписаниеОповещенияОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаполнениеФизЛица(Параметры, ДополнительныеПараметры) Экспорт
	
	ОбновитьДанныеПоФизЛицуНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначениеПлатежаПриИзменении(Элемент)
	
	НазначениеПлатежа = Объект.НазначениеПлатежа;
	ОбновитьТекстДекорацииНазначения();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеДоговораКредитаИлиЗайма()
	
	ФормыДокументовДеньги.ЗаполнитьИнформациюПоКредитуЗаймуНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКредитаПриИзменении(Элемент)
	
	ОбработатьИзменениеДоговораКредитаИлиЗайма();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьСледующийПлатежНажатие(Элемент, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая()  Тогда
		// Если редактируем правило по новому документу - запишем документ
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
				|Выполнение команды ""Повторять платеж"" возможно только после записи данных.
				|Данные будут записаны.'");
					
		Оповещение = Новый ОписаниеОповещения("ВопросРедактированиеПравилаЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		
	Иначе
		
		ОткрытьПравилоРегулярногоПлатежа();
		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура РеестрВыплатСамозанятымПриИзмененииНаСервере()
	
	ФормыДокументовДеньги.РеестрВыплатСамозанятымПриИзмененииНаСервере(ЭтотОбъект);
	
	СформироватьНазначениеПлатежа(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РеестрВыплатСамозанятымПриИзменении(Элемент)
	
	РеестрВыплатСамозанятымПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьРеквизитыФормыДляЕНП(ПриСозданииНаСервере = Ложь)
	Если ПриСозданииНаСервере Тогда
		ПлательщикЕНП = РегламентированнаяОтчетностьУСН.ПлательщикЕНП(Объект.Организация, ТекущаяДатаСеанса());
	Иначе
		ПлательщикЕНП = РегламентированнаяОтчетностьУСН.ПлательщикЕНП(Объект.Организация, Объект.Дата);
	КонецЕсли;
КонецПроцедуры

#Область КодВыплат

&НаКлиентеНаСервереБезКонтекста
Функция ВозможноПеречислениеПособияНаКартуМир(ВидОперации, ВидКонтрагента, Контрагент)
	
	ВыплатаФизлицу = (ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Прочее")
		И Не Контрагент.Пустая() И ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ФизическоеЛицо"));
		
	ВыплатаСотруднику = (ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ЗарплатаСотруднику")
		Или ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Зарплата"));
	
	Возврат ВыплатаФизлицу
		Или ВыплатаСотруднику;
	
КонецФункции

#КонецОбласти

#Область КодВидаДохода

&НаСервере
Процедура КодВидаДоходаПоУмолчанию()
	
	Если ВозможноВзысканиеСПеречисленияФизлицу(
			Объект.Дата, Объект.ВидОперации, ВидКонтрагента, Объект.Контрагент) Тогда
		Если ПустаяСтрока(Объект.КодВидаДохода) Тогда
			Если ДвиженияДенежныхСредствКлиентСервер.ПеречислениеЗарплаты(Объект.ВидОперации) Тогда
				Объект.КодВидаДохода = "1";
			КонецЕсли;
		КонецЕсли;
	Иначе
		Объект.КодВидаДохода = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоПрочиеВыплатыКонтрагентам(ВидОперации)
	
	ПрочиеВыплатыКонтрагентам =
		ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Прочее")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.НаРасходы")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПрочиеРасчеты");
		
	Возврат ПрочиеВыплатыКонтрагентам;
	
КонецФункции

&НаСервере
Процедура НастроитьСписокВыбораКодВидаДохода()
	
	СписокВыбора = Элементы.КодВидаДохода.СписокВыбора;
	СписокВыбора.Очистить();
	
	ПрочиеВыплатыКонтрагентам = ЭтоПрочиеВыплатыКонтрагентам(Объект.ВидОперации);
	
	Если ПрочиеВыплатыКонтрагентам Тогда
		СписокВыбора.Добавить("", НСтр("ru = 'разрешено, без ограничения по сумме'"));
	КонецЕсли;
	
	СписокВыбора.Добавить("1", НСтр("ru = '1 - разрешено с ограничением по сумме'"));
	Если ДвиженияДенежныхСредствКлиентСервер.ВступилиВСилуИзменения353ФЗ(Объект.Дата) Тогда
		СписокВыбора.Добавить("2", НСтр("ru = '2 - запрещено без оговорок для периодических выплат'"));
		СписокВыбора.Добавить("3", НСтр("ru = '3 - запрещено кроме алиментов для периодических выплат'"));
		СписокВыбора.Добавить("4", НСтр("ru = '4 - запрещено без оговорок для единовременных выплат'"));
		СписокВыбора.Добавить("5", НСтр("ru = '5 - запрещено кроме алиментов для единовременных выплат'"));
	Иначе
		СписокВыбора.Добавить("2", НСтр("ru = '2 - запрещено без оговорок'"));
		СписокВыбора.Добавить("3", НСтр("ru = '3 - запрещено кроме алиментов'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВозможноВзысканиеСПеречисленияФизлицу(Знач Дата, ВидОперации, ВидКонтрагента, Контрагент)
	
	Дата = ?(Дата = '00010101', ТекущаяДатаСеанса(), Дата);
	
	Результат = Ложь;
	Если Не ДвиженияДенежныхСредствКлиентСервер.ДействуетУказаниеБанкаРоссии5286У(Дата) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПеречислениеСотруднику =
		ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ЗарплатаСотруднику")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Подотчетнику");
		
	ВыплатаВБанкПоВедомости =
		ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Зарплата");
	
	ПрочиеВыплатыКонтрагентам = ЭтоПрочиеВыплатыКонтрагентам(ВидОперации);
	
	КонтрагентФизическоеЛицо =
		НЕ Контрагент.Пустая()
		И ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ФизическоеЛицо");
	
	Результат = ПеречислениеСотруднику
		ИЛИ ВыплатаВБанкПоВедомости
		ИЛИ ПрочиеВыплатыКонтрагентам И КонтрагентФизическоеЛицо;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьВидимостьКодаВидаДохода(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	ВозможноВзысканиеСПеречисленияФизлицу = ВозможноВзысканиеСПеречисленияФизлицу(
		Объект.Дата,
		Объект.ВидОперации,
		Форма.ВидКонтрагента,
		Объект.Контрагент);
		
	Элементы.КодВидаДохода.Видимость = ВозможноВзысканиеСПеречисленияФизлицу;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьВидимостьКодаВыплат(Форма)
	
	ВозможноПеречислениеПособияНаКартуМир = ВозможноПеречислениеПособияНаКартуМир(
		Форма.Объект.ВидОперации, Форма.ВидКонтрагента, Форма.Объект.Контрагент);
	
	Форма.Элементы.КодВыплат.Видимость = ВозможноПеречислениеПособияНаКартуМир;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УстановитьСвязиПараметровВыбораДоступныеТипы()
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.Оплата Тогда
	
		ДопустимыеТипы = Новый ОписаниеТипов("ДокументСсылка.ЗаказПоставщику", ,);
		Элементы.РасшифровкаПлатежаЗаказ.ОграничениеТипа = ДопустимыеТипы;
		
		ДопустимыеТипы = Новый ОписаниеТипов("ДокументСсылка.СчетНаОплатуПоставщика", , );
		Элементы.РасшифровкаПлатежаСчетНаОплату.ОграничениеТипа = ДопустимыеТипы;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.Покупателю Тогда
		
		ДопустимыеТипы = Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя", , );
		Элементы.РасшифровкаПлатежаЗаказ.ОграничениеТипа = ДопустимыеТипы;
		
		ДопустимыеТипы = Новый ОписаниеТипов("ДокументСсылка.СчетНаОплату", , );
		Элементы.РасшифровкаПлатежаСчетНаОплату.ОграничениеТипа = ДопустимыеТипы;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьСписокВыбора(Элемент, СписокДанных, РедактированиеОграничено = Ложь, Предупреждение = "")
	
	Элемент.СписокВыбора.Очистить();
	
	Элемент.РежимВыбораИзСписка = Истина;
	Элемент.КнопкаОчистки       = Ложь;
	Для каждого ЭлементДанных Из СписокДанных Цикл
		Элемент.СписокВыбора.Добавить(ЭлементДанных.Значение, ЭлементДанных.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФормуС2014Года()
	
	Если НЕ ЗначениеЗаполнено(Объект.Дата)
	    ИЛИ Объект.Дата >= '20140101' Тогда // ОКТМО действует в любом случае с 01.01.2014
		Элементы.КодОКАТО.Заголовок = НСтр("ru = 'Код ОКТМО'");
		Элементы.КодОКАТО.Подсказка = НСтр("ru = 'Код ОКТМО - территории (населенного пункта), на которой мобилизуются средства'");
	Иначе
		Элементы.КодОКАТО.Заголовок = НСтр("ru = 'Код ОКАТО'");
		Элементы.КодОКАТО.Подсказка = НСтр("ru = 'Код ОКАТО сборщика платежей'");
	КонецЕсли;
	
	Если (ЗначениеЗаполнено(Объект.Дата) И Объект.Дата >= ПлатежиВБюджетКлиентСервер.НачалоПримененияИдентификатораПлатежа())
	 ИЛИ (НЕ ЗначениеЗаполнено(Объект.Дата) И ТекущаяДатаСеанса() >= ПлатежиВБюджетКлиентСервер.НачалоПримененияИдентификатораПлатежа()) Тогда
		Элементы.ИдентификаторПлатежа.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Авто;
		Элементы.ИдентификаторПлатежа.ПредупреждениеПриРедактировании = "";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.Оплата Тогда
		Элементы.ИдентификаторПлатежа.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать;
		Элементы.ИдентификаторПлатежа.ПредупреждениеПриРедактировании = НСтр("ru = 'До 31.03.2014 идентификатор платежа используется только для платежей в бюджет'");
	КонецЕсли;
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога Тогда
		Элементы.ИдентификаторПлатежа.Заголовок = НСтр("ru = 'УИН'");
	Иначе
		Элементы.ИдентификаторПлатежа.Заголовок = НСтр("ru = 'УИП'");
	КонецЕсли;

	Период = ?(Объект.Дата = Дата("00010101"), ТекущаяДатаСеанса(), Объект.Дата);
	
	НастроитьСписокВыбора(
		Элементы.СтатусСоставителя,
		ПлатежиВБюджетКлиентСервер.СтатусыПлательщика(Период));
	
	НастроитьСписокВыбора(
		Элементы.ПоказательОснования,
		ПлатежиВБюджетКлиентСервер.ОснованияПлатежа(Объект.ВидПеречисленияВБюджет, Период));
		
	НастроитьСписокВыбора(
		Элементы.ПоказательТипа,
		ПлатежиВБюджетКлиентСервер.ТипыПлатежа(Объект.ВидПеречисленияВБюджет, Период));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФормуС2015Года()
	
	Если ДатаДокумента >= '20150101'
		ИЛИ Объект.Дата >= '20150101' Тогда // Приказ Минфина №126н от 30.10.2014.
		Элементы.ПоказательТипа.Видимость = Ложь;
		Объект.ПоказательТипа = "";
	Иначе
		Элементы.ПоказательТипа.Видимость = Истина;
		Объект.ПоказательТипа = "0";
	КонецЕсли;
	
	Период = Объект.Дата;
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ПлатежиВБюджетКлиентСервер.ПрименяетсяОКТМО8Символов(Период) Тогда
		Элементы.КодОКАТО.ОграничениеТипа = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(8));
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет текст плательщика.
//
&НаСервере
Процедура ЗаполнитьТекстПлательщика(СтруктураДанные)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога")
		И ЗначениеЗаполнено(СтруктураДанные.НаименованиеПлательщикаПриПеречисленииНалогов) Тогда
		
		Объект.ТекстПлательщика = СтруктураДанные.НаименованиеПлательщикаПриПеречисленииНалогов;
		
	ИначеЕсли ПустаяСтрока(СтруктураДанные.ТекстКорреспондента) Тогда
		
		Объект.ТекстПлательщика = СтруктураДанные.НаименованиеПолное;
		Если ЗначениеЗаполнено(СтруктураДанные.ТекстБанкДляРасчетов) Тогда
			Объект.ТекстПлательщика = Объект.ТекстПлательщика + СтруктураДанные.ТекстБанкДляРасчетов;
		КонецЕсли;
		
	Иначе
		
		Объект.ТекстПлательщика = СтруктураДанные.ТекстКорреспондента;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет текст получателя.
//
&НаСервере
Процедура ЗаполнитьТекстПолучателя(СтруктураДанные)
	
	Если ПустаяСтрока(СтруктураДанные.ТекстКорреспондента) Тогда
		
		Объект.ТекстПолучателя = СтруктураДанные.НаименованиеПолное;
		Если ЗначениеЗаполнено(СтруктураДанные.ТекстБанкДляРасчетов) Тогда
			Объект.ТекстПолучателя = Объект.ТекстПолучателя + СтруктураДанные.ТекстБанкДляРасчетов;
		КонецЕсли;
		
	Иначе
		
		Объект.ТекстПолучателя = СтруктураДанные.ТекстКорреспондента;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьТекстПолучателя()

// Процедура вызывает обработку заполнения документа по основанию.
//
&НаСервере
Процедура ЗаполнитьПоДокументу(ДокОснование)
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.Заполнить(ДокОснование);
	ЗначениеВРеквизитФормы(Документ, "Объект");
	НазначениеПлатежа = Объект.НазначениеПлатежа;
	
	Модифицированность = Истина;
	ВидОперации = Объект.ВидОперации;
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") 
		ИЛИ ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		СтруктураДанные = ПолучитьДанныеДокументОснованиеПриИзменении(Объект.ДокументОснование);
		НомерВходящегоДокумента = СтруктураДанные.НомерВходящегоДокумента;
		ДатаВходящегоДокумента = СтруктураДанные.ДатаВходящегоДокумента;
	Иначе
		НомерВходящегоДокумента = "";
		ДатаВходящегоДокумента = '00010101';
	КонецЕсли;
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РасходДСПлан") Тогда
		Для Каждого ТекущаяСтрока Из Объект.РасшифровкаПлатежа Цикл
			ТекущаяСтрока.ДокументПланирования = Объект.ДокументОснование;
		КонецЦикла;
	КонецЕсли;
	
	Контрагент = Объект.Контрагент;
	Договор = Объект.Договор;
	
	УстановитьВидимостьПоДаннымКонтрагента();
	
КонецПроцедуры // ЗаполнитьПоДокументу()

&НаКлиенте
Процедура ЗаполнитьПоОснованиюЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Ответ = Результат;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоДокументу(Объект.ДокументОснование);
		ВидОперацииПриИзменении(Неопределено);
		КонтрагентПриИзменении(Неопределено, Ложь);
		УстановитьДоступностьРеквизитовПеречисленияНалогов();
	Иначе
		УстановитьВидимостьПоДаннымКонтрагента();
	КонецЕсли;

КонецПроцедуры

// Процедура выполняет необходимые действия формирования текста назначения
// платежа.
//
&НаСервере
Процедура СформироватьНазначениеПлатежа(ИзменениеСуммы = Ложь)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьНазначениеПлатежа(НазначениеПлатежа, ИзменениеСуммы);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	НазначениеПлатежа = Объект.НазначениеПлатежа;
	
	ОбновитьТекстДекорацииНазначенияНаСервере();
	
КонецПроцедуры // СформироватьНазначениеПлатежа()

// Процедура выполняет необходимые действия по формированию реквизита
// ПоказательПериода.
//
&НаКлиенте
Процедура УстановитьПоказательПериода()
	
	Если Объект.ВидПеречисленияВБюджет = ПредопределенноеЗначение("Перечисление.ВидыПеречисленийВБюджет.ТаможенныйПлатеж") Тогда
		Объект.ПоказательПериода = "";
	ИначеЕсли ПериодичностьУплаты = "0" Тогда
		Объект.ПоказательПериода = "0";
	ИначеЕсли ПериодичностьУплаты = "-" Тогда
		Объект.ПоказательПериода = Формат(ДатаПлатежа, "ДФ=dd.MM.yyyy");
	Иначе
		Объект.ПоказательПериода = Лев(ПериодичностьУплаты, 2)
								 + "."
								 + Формат(ПериодПлатежа, "ЧЦ=2; ЧН=; ЧВН=")
								 + "."
								 + Формат(ГодПлатежа, "ЧЦ=4; ЧГ=");
	КонецЕсли;
	
КонецПроцедуры // УстановитьПоказательПериода()

// Получает набор данных с сервера для процедуры ДоговорПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеДокументОснованиеПриИзменении(ДокументОснование)
	
	СтруктураДанные = Новый Структура();
	
	СтруктураДанные.Вставить("ДатаВходящегоДокумента",  ДокументОснование.ДатаВходящегоДокумента);
	СтруктураДанные.Вставить("НомерВходящегоДокумента", ДокументОснование.НомерВходящегоДокумента);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДокументОснованиеПриИзменении()

// Получает набор данных с сервера для процедуры ДоговорПриИзменении.
//
&НаСервере
Функция ПолучитьДанныеОрганизацияПриИзменении(Организация, БанковскийСчет, Контрагент, СчетКонтрагента, ВидОперации, Период)
	
	СтруктураДанные = Новый Структура();
	
	СтруктураДанные.Вставить("Компания", 				Константы.УчетПоКомпании.Компания(Организация));
	СтруктураДанные.Вставить("НаименованиеПолное",		Организация.НаименованиеПолное);
	СтруктураДанные.Вставить("НаименованиеПлательщикаПриПеречисленииНалогов", Организация.НаименованиеПлательщикаПриПеречисленииНалогов);
	Если Период >= '20140101' Тогда // ОКТМО действует в любом случае с 01.01.2014
		СтруктураДанные.Вставить("КодОКАТО", 			Организация.КодПоОКТМО);
	Иначе
		СтруктураДанные.Вставить("КодОКАТО", 			Организация.КодПоОКАТО);
	КонецЕсли;
	
	//  Банковский счет организации
	ЗначениеДляСтруктуры	= ?(БанковскийСчет.Владелец = Организация, БанковскийСчет, Организация.БанковскийСчетПоУмолчанию);
	СтруктураДанные.Вставить("БанковскийСчет", 			ЗначениеДляСтруктуры);
	НеобходимостьУказанияКПППлательщика = ПолучитьНеобходимостьУказанияКПП(ЗначениеДляСтруктуры, ВидОперации);
	
	//  Валюта документа
	ЗначениеДляСтруктуры	= ?(ЗначениеЗаполнено(ЗначениеДляСтруктуры), ЗначениеДляСтруктуры.ВалютаДенежныхСредств, Константы.НациональнаяВалюта.Получить());
	СтруктураДанные.Вставить("ВалютаДокумента", 		ЗначениеДляСтруктуры);
	
	//  Банковский счет контрагента
	ЗначениеДляСтруктуры	= ?(ЗначениеЗаполнено(СчетКонтрагента) И ЗначениеДляСтруктуры = СчетКонтрагента.ВалютаДенежныхСредств, СчетКонтрагента, Справочники.БанковскиеСчета.ПустаяСсылка());
	СтруктураДанные.Вставить("СчетКонтрагента", 		ЗначениеДляСтруктуры);
	НеобходимостьУказанияКПППолучателя = ПолучитьНеобходимостьУказанияКПП(ЗначениеДляСтруктуры, ВидОперации);
	
	СтруктураДанные.Вставить("ТекстКорреспондента", 	Организация.БанковскийСчетПоУмолчанию.ТекстКорреспондента);
	СтруктураДанные.Вставить("ИННПлательщика", 			Организация.ИНН);
	СтруктураДанные.Вставить("КПППлательщика", 			?(НеобходимостьУказанияКПППлательщика, Организация.КПП, ""));
	СтруктураДанные.Вставить("ЭтоФизЛицо", 				Организация.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
	
	СтруктураДанные.Вставить("КПППолучателя",			?(НеобходимостьУказанияКПППолучателя, Контрагент.КПП, ""));
	
	СтруктураДанные.Вставить("ТекстБанкДляРасчетов", 	Документы.ПлатежноеПоручение.ПолучитьТекстБанкДляРасчетов(СтруктураДанные.БанковскийСчет));
	
	ОбновитьВидимостьИОстаткиДС(СтруктураДанные.БанковскийСчет);
	Если Документы.ПлатежноеПоручение.ЭтоВидОперацииБезНДС(Объект.ВидОперации) Тогда
		Объект.СтавкаНДС = Неопределено;
		Объект.СуммаНДС = 0;
	Иначе
		Объект.СтавкаНДС = РасчетыРаботаСФормамиВызовСервера.СтавкаНДСПоОрганизацииНалогообложениеНДСИСпособуЗаполнения(Объект.Организация, Объект.Дата, СпособЗаполненияСтавкиНДС);
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции

// Получает набор данных с сервера для процедуры СчетОрганизацииПриИзменении.
//
&НаСервере
Функция ПолучитьДанныеСчетОрганизацииПриИзменении(Организация, СчетОрганизации, ВалютаПередИзменением, Дата, ВидОперации)
	
	НеобходимостьУказанияКПП = ПолучитьНеобходимостьУказанияКПП(СчетОрганизации, ВидОперации);
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("ТекстКорреспондента", СчетОрганизации.ТекстКорреспондента);
	СтруктураДанные.Вставить("НаименованиеПолное", ?(ЗначениеЗаполнено(СчетОрганизации), СчетОрганизации.Владелец.НаименованиеПолное, ""));
	СтруктураДанные.Вставить("НаименованиеПлательщикаПриПеречисленииНалогов", ?(ЗначениеЗаполнено(СчетОрганизации), СчетОрганизации.Владелец.НаименованиеПлательщикаПриПеречисленииНалогов, ""));
	СтруктураДанные.Вставить("ВалютаДенежныхСредств", СчетОрганизации.ВалютаДенежныхСредств);
	СтруктураДанные.Вставить("КПППлательщика", ?(НеобходимостьУказанияКПП, Организация.КПП, ""));
	
	СтруктураДанные.Вставить(
		"ВалютаКурсКратность",
		РегистрыСведений.КурсыВалют.ПолучитьПоследнее(
			Дата,
			Новый Структура("Валюта", СчетОрганизации.ВалютаДенежныхСредств)));
	
	СтруктураДанные.Вставить(
		"ВалютаКурсКратностьПередИзменением",
		РегистрыСведений.КурсыВалют.ПолучитьПоследнее(
			Дата,
			Новый Структура("Валюта", ВалютаПередИзменением)));
	
	СтруктураДанные.Вставить("ТекстБанкДляРасчетов", Документы.ПлатежноеПоручение.ПолучитьТекстБанкДляРасчетов(СчетОрганизации));
	
	ОбновитьВидимостьИОстаткиДС(СчетОрганизации);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеСчетОрганизацииПриИзменении()

&НаСервере
Процедура ДатаПриИзмененииНаСервере(ДанныеДляИзмененияДаты)
	
	ДокументыУНФ.ДатаПриИзменении(ДанныеДляИзмененияДаты, ЭтотОбъект, Объект);
	
	УстановитьФормуС2014Года();
	УстановитьФормуС2015Года();
	УстановитьВидимостьКодаВидаДохода(ЭтотОбъект);
	НастроитьСписокВыбораКодВидаДохода();
	КодВидаДоходаПоУмолчанию();
	
	// Заменим (добавим) УИН (уникальный идентификатор начисления)
	// С 01 января 2014 по 30 марта 2014 он указывается в назначении платежа
	ПлатежиВБюджетКлиентСервер.ЗаменитьВНазначенииПлатежаУИН(
	Объект.НазначениеПлатежа,
	Объект.ИдентификаторПлатежа,
	Объект.Дата,
	Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога"));
	
	ЗаполнитьРеквизитыФормыДляЕНП();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

// Получает необходимость указания КПП.
//
&НаСервереБезКонтекста
Функция ПолучитьНеобходимостьУказанияКПП(СчетКонтрагента, ВидОперации)
	
	Если ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога Тогда
		НеобходимостьУказанияКПП = Истина;
	Иначе
		Если СчетКонтрагента.ВариантУказанияКПП = Перечисления.ВариантыУказанияКПП.ВоВсехПлатежныхПоручениях Тогда
			НеобходимостьУказанияКПП = Истина;
		Иначе
			НеобходимостьУказанияКПП = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НеобходимостьУказанияКПП;

КонецФункции // ПолучитьНеобходимостьУказанияКПП()

// Получает набор данных с сервера для процедуры ДоговорПриИзменении.
//
&НаСервере
Функция ДанныеКонтрагентаДляИзменения(Знач ПолучательПлатежа, ВалютаДокумента, ВидОперации)
	
	ЭтоРасчетыССотрудником = (ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.ЗарплатаСотруднику ИЛИ ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.Подотчетнику);
	
	Если ЭтоРасчетыССотрудником И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПолучательПлатежа, "ФизЛицо") Тогда
		ПолучательПлатежа = ПолучательПлатежа.ФизЛицо;
	КонецЕсли;
	
	СчетКонтрагента = ДвижениеДенежныхСредствСервер.ПолучитьБанковскийСчетКонтрагентаПоВалюте(ПолучательПлатежа, ВалютаДокумента);
	
	НеобходимостьУказанияКПП = ПолучитьНеобходимостьУказанияКПП(СчетКонтрагента, ВидОперации);
	
	Результат = Новый Структура();
	Результат.Вставить("НаименованиеПолное", 	?(ЭтоРасчетыССотрудником, ПолучательПлатежа.Наименование, ПолучательПлатежа.НаименованиеПолное));
	Результат.Вставить("СчетКонтрагента", 	СчетКонтрагента);
	Результат.Вставить("ИННПолучателя", 		ПолучательПлатежа.ИНН);
	Результат.Вставить("КПППолучателя", 		?(НеобходимостьУказанияКПП И НЕ ЭтоРасчетыССотрудником, ПолучательПлатежа.КПП, ""));
	Результат.Вставить("НазначениеПлатежа",	ПолучательПлатежа.БанковскийСчетПоУмолчанию.ТекстНазначения);
	Результат.Вставить("ТекстКорреспондента",	ПолучательПлатежа.БанковскийСчетПоУмолчанию.ТекстКорреспондента);
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.РасчетыПоКредитам Тогда
		ДоговорКредитаЗаймаПоУмолчанию = ПолучитьДоговорКредитаЗаймаПоУмолчанию(Объект.Ссылка, Объект.Контрагент, Объект.Организация, Объект.ВидОперации);
		Результат.Вставить(
			"ДоговорКредитаЗаймаПоУмолчанию",
			ДоговорКредитаЗаймаПоУмолчанию);
	КонецЕсли;
	
	Если ЭтоРасчетыССотрудником Тогда
		Результат.Вставить("СтатьяДДСПоУмолчанию", Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());
		Результат.Вставить("Договор", Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
		Результат.Вставить("ДоговорВалютаКурсКратность", РаботаСКурсамиВалют.ПолучитьКурсВалюты(
				Объект.ВалютаДокумента, Объект.Дата));
	Иначе
		Результат.Вставить("СтатьяДДСПоУмолчанию", ПолучательПлатежа.СтатьяДДСПоУмолчанию);
		ДоговорПоУмолчанию = Справочники.ДоговорыКонтрагентов.ПоДокументуКонтрагентуОрганизацииИВидуОперации(
			Объект.Ссылка, ПолучательПлатежа, Объект.Организация);
		Результат.Вставить("Договор", ДоговорПоУмолчанию);
		ОбновитьВидимостьИОстаткиВзаиморасчетов();
		УстановитьВидимостьПоДаннымКонтрагента();
		Результат.Вставить("ДоговорВалютаКурсКратность", РаботаСКурсамиВалют.ПолучитьКурсВалюты(
				ДоговорПоУмолчанию.ВалютаРасчетов, Объект.Дата));
		
		Результат.Вставить("ВестиРасчетыПоДоговорам", ПолучательПлатежа.ВестиРасчетыПоДоговорам);
		Результат.Вставить("ВестиРасчетыПоДокументам", ПолучательПлатежа.ВестиРасчетыПоДокументам);
		Результат.Вставить("ВестиРасчетыПоЗаказам", ПолучательПлатежа.ВестиРасчетыПоЗаказам);
		Результат.Вставить("ВестиУчетОплатыПоСчетам", ПолучательПлатежа.ВестиУчетОплатыПоСчетам);
	КонецЕсли;
	
	Результат.Вставить(
		"СпособЗаполненияСтавкиНДС",
		Справочники.ДоговорыКонтрагентов.СпособЗаполненияСтавкиНДСПоДоговору(
			Результат.Договор));
			
	Если ПолучитьФункциональнуюОпцию("УчетПоПроектам") И ЗначениеЗаполнено(ДоговорПоУмолчанию) И НЕ ЗначениеЗаполнено(Объект.Проект) Тогда
		Результат.Вставить("Проект", Справочники.Проекты.ПолучитьПроектПоДоговору(ДоговорПоУмолчанию));
	КонецЕсли;
	
	Результат.Вставить("ТекстБанкДляРасчетов",  Документы.ПлатежноеПоручение.ПолучитьТекстБанкДляРасчетов(СчетКонтрагента));
	Результат.Вставить("ВидКонтрагента", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "ВидКонтрагента"));
	
	Возврат Результат;
	
КонецФункции

// Получает набор данных с сервера для процедуры ДоговорПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеСчетКонтрагентаПриИзменении(Контрагент, СчетКонтрагента, ВидОперации)
	
	НеобходимостьУказанияКПП = ПолучитьНеобходимостьУказанияКПП(СчетКонтрагента, ВидОперации);
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("НазначениеПлатежа", СчетКонтрагента.ТекстНазначения);
	СтруктураДанные.Вставить("ТекстКорреспондента", СчетКонтрагента.ТекстКорреспондента);
	СтруктураДанные.Вставить("КПППолучателя", ?(НеобходимостьУказанияКПП, Контрагент.КПП, ""));
	
	Если ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.ЗарплатаСотруднику
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.Подотчетнику Тогда
		
		Если ЗначениеЗаполнено(СчетКонтрагента.Владелец) Тогда
			СтруктураДанные.Вставить("НаименованиеПолное", СчетКонтрагента.Владелец.Наименование);
		Иначе
			СтруктураДанные.Вставить("НаименованиеПолное", Контрагент.НаименованиеПолное);
		КонецЕсли;
		
	Иначе
		Если ЗначениеЗаполнено(СчетКонтрагента.Владелец) Тогда
			СтруктураДанные.Вставить("НаименованиеПолное", СчетКонтрагента.Владелец.НаименованиеПолное);
		Иначе
			СтруктураДанные.Вставить("НаименованиеПолное", Контрагент.НаименованиеПолное);
		КонецЕсли;
	КонецЕсли;
	СтруктураДанные.Вставить("ТекстБанкДляРасчетов",  Документы.ПлатежноеПоручение.ПолучитьТекстБанкДляРасчетов(СчетКонтрагента));
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеСчетКонтрагентаПриИзменении()

// Получает набор данных с сервера для процедуры СтавкаНДСПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеСтавкаНДСПриИзменении(СтавкаНДС)
	
	СтруктураДанные = Новый Структура();
	
	СтруктураДанные.Вставить("НеОблагается", СтавкаНДС.НеОблагается);
	СтруктураДанные.Вставить("Ставка", СтавкаНДС.Ставка);	
		
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеСтавкаНДСПриИзменении()

// Заполняет реквизиты платежа в бюджет по умолчанию.
//
&НаКлиенте
Процедура ЗаполнитьРеквизитыПлатежаВБюджетПоУмолчанию()
	
	Если Объект.ВидПеречисленияВБюджет = ПредопределенноеЗначение("Перечисление.ВидыПеречисленийВБюджет.НалоговыйПлатеж") Тогда
		
		Если ЗначениеЗаполнено(Объект.Налог)
			И Объект.Налог = ПредопределенноеЗначение("Справочник.ВидыНалогов.ЕдиныйНалоговыйПлатеж") Тогда
			
			ДанныеДляЗаполненияПоЕНП = ДанныеДляЗаполненияПоЕНП(Объект.Налог, Объект.Организация, Объект.Дата);
			
			Объект.СтатусСоставителя = "01";
			Объект.КодОКАТО = ДанныеДляЗаполненияПоЕНП.КодОКАТО;
			Объект.ПоказательНомера = "0";
			Объект.ПоказательПериода = "0";
			ПериодичностьУплаты = "0";
			Объект.ИдентификаторПлатежа = "0";
			
			ИндексПоследнегоЭлементаПоказателяОснования = Элементы.ПоказательОснования.СписокВыбора.Количество() - 1;
			Объект.ПоказательОснования = Элементы.ПоказательОснования.СписокВыбора[ИндексПоследнегоЭлементаПоказателяОснования].Значение;
			Получатель = ДанныеДляЗаполненияПоЕНП.АдминистраторНалогаОрганизации;
			Если ЗначениеЗаполнено(Получатель) И Объект.Контрагент <> Получатель Тогда
				Объект.Контрагент = Получатель;
				Объект.СчетКонтрагента = ДанныеДляЗаполненияПоЕНП.ЕдиныйБанковскийСчетГосударственногоОргана;
				КонтрагентПриИзменении(Элементы.Контрагент);
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(Объект.Налог)
				И (Объект.Налог = ПредопределенноеЗначение("Справочник.ВидыНалогов.НДФЛСотрудники")
				Или Объект.Налог = ПредопределенноеЗначение("Справочник.ВидыНалогов.НДФЛДоходыСвышеПредельнойВеличины")) Тогда
				Объект.СтатусСоставителя = "02";
			ИначеЕсли ЭтоФизЛицо Тогда
				Если ПлатежиВБюджетКлиентСервер.ДействуетПриказ2020_199н_Отложенный(Объект.Дата) Тогда
					Объект.СтатусСоставителя = "13";
				Иначе
					Объект.СтатусСоставителя = "09";
				КонецЕсли;
			Иначе
				Объект.СтатусСоставителя = "01";
			КонецЕсли;
			
			Объект.ПоказательПериода   = "МС." + Формат(Месяц(Объект.Дата), "ЧЦ=2; ЧВН=") + "." + Формат(Год(Объект.Дата), "ЧГ=");
			ПериодичностьУплаты = "МС";
			Объект.ПоказательОснования = Элементы.ПоказательОснования.СписокВыбора[0].Значение;
			Объект.ПоказательНомера = "";
		КонецЕсли;
		


		ГодПлатежа = Год(Объект.Дата);
		ПериодПлатежа = Месяц(Объект.Дата);

		Объект.ПоказательДаты = "";
		
	ИначеЕсли Объект.ВидПеречисленияВБюджет = ПредопределенноеЗначение("Перечисление.ВидыПеречисленийВБюджет.ТаможенныйПлатеж") Тогда
		Объект.СтатусСоставителя   = "06";
		Объект.ПоказательОснования = Элементы.ПоказательОснования.СписокВыбора[0].Значение;
		Объект.ПоказательПериода   = "";
		Объект.ПоказательНомера    = "";
		Объект.ПоказательДаты = "";
		ПериодичностьУплаты = "0";
		ГодПлатежа = 0;
	Иначе
		Объект.СтатусСоставителя   = "08";
		Объект.ПоказательОснования = "0";
		Объект.ПоказательПериода   = "0";
		Объект.ПоказательНомера    = "";
		Объект.ПоказательДаты = "";
		ПериодичностьУплаты = "0";
		ГодПлатежа = 0;
	КонецЕсли;
	
	Если ДатаДокумента >= '20150101'
	 ИЛИ Объект.Дата >= '20150101' Тогда // Приказ Минфина №126н от 30.10.2014.
		Объект.ПоказательТипа = "";
	Иначе
		Объект.ПоказательТипа = "0";
	КонецЕсли;
	
	УстановитьПоказательПериода();
	УстановитьДоступностьРеквизитовПеречисленияНалогов();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеДляЗаполненияПоЕНП(Налог, Организация, Дата)
	
	СтруктураДляВозврата = Новый Структура();
	СтруктураДляВозврата.Вставить("АдминистраторНалогаОрганизации", ДанныеГосударственныхОрганов.АдминистраторНалогаОрганизации(Налог, Организация, Дата));
	СтруктураДляВозврата.Вставить("КодОКАТО", ЕдиныйНалоговыйСчет.ОКТМОЕдиногоНалоговогоСчета()); 
	СтруктураДляВозврата.Вставить("ЕдиныйБанковскийСчетГосударственногоОргана",
	ЕдиныйНалоговыйСчет.ЕдиныйБанковскийСчетГосударственногоОргана(СтруктураДляВозврата.АдминистраторНалогаОрганизации));
	
	Возврат СтруктураДляВозврата;
	
КонецФункции

// Устанавливает текущую страницу в зависимости от вида перечисления в бюджет.
//
&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы =  Форма.Элементы;
	Элементы.НалоговыйПлатеж.Видимость = Ложь;
	Элементы.ТаможенныйПлатеж.Видимость = Ложь;
	Элементы.ИнойПлатеж.Видимость = Ложь;
	
	Если Форма.Объект.ВидПеречисленияВБюджет = ПредопределенноеЗначение("Перечисление.ВидыПеречисленийВБюджет.НалоговыйПлатеж") Тогда
		Элементы.НалоговыйПлатеж.Видимость = Истина;
	ИначеЕсли Форма.Объект.ВидПеречисленияВБюджет = ПредопределенноеЗначение("Перечисление.ВидыПеречисленийВБюджет.ТаможенныйПлатеж") Тогда
		Элементы.ТаможенныйПлатеж.Видимость = Истина;
	Иначе
		Элементы.ИнойПлатеж.Видимость = Истина;
	КонецЕсли;
	
	НовыеПараметры = Новый Массив;
	НовыеПараметры.Добавить(Новый ПараметрВыбора("Отбор.ПрименяетсяОсобыйПорядокУплатыНалога", Форма.ПлательщикЕНП));
	Форма.Элементы.Налог.ПараметрыВыбора = Новый ФиксированныйМассив(НовыеПараметры);
	
	// БЗКБ
	Если Форма.Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Зарплата") Тогда
		Форма.ПоказыватьЭлементыБЗКБ = НужноПоказыватьЭлементыБЗКБДляОрганизации(Форма.Объект.Организация);
		Форма.Элементы.ВыплатыРегламентированнойЗаработнойПлаты.Видимость = Форма.ПоказыватьЭлементыБЗКБ;
	КонецЕсли;
	// Конец БЗКБ
	
КонецПроцедуры // УстановитьТекущуюСтраницуВЗависимостиОтВидаПеречисленияВБюджет()

&НаСервере
Процедура ОбновитьВидимостьИОстаткиВзаиморасчетов()
	
	Элементы.ОстатокВзаиморасчетов.Видимость = НЕ ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.Контрагент);

	Если НЕ Элементы.ОстатокВзаиморасчетов.Видимость Тогда
		// Только для новых объектов
		Элементы.Контрагент.АвтоМаксимальнаяШирина = Истина;
		Возврат;
	КонецЕсли;
	
	Элементы.Контрагент.АвтоМаксимальнаяШирина = Ложь;
	Элементы.Контрагент.МаксимальнаяШирина = 22;
	Элементы.ОстатокВзаиморасчетов.Заголовок = РаботаСКонтрагентамиУНФ.ЗаголовокНадписиВзаиморасчетов(Объект.Контрагент);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьИОстаткиДС(БанковскийСчет = Неопределено)
	
	Если БанковскийСчет = Неопределено Тогда
		ТекущийБанковскийСчет = Объект.БанковскийСчет;
	Иначе
		ТекущийБанковскийСчет = БанковскийСчет;
	КонецЕсли;
	
	Элементы.ОстатокДенежныхСредств.Видимость = НЕ ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(ТекущийБанковскийСчет);

	Если НЕ Элементы.ОстатокДенежныхСредств.Видимость Тогда
		Элементы.СчетОрганизации.АвтоМаксимальнаяШирина = Истина;
		// Только для новых объектов
		Возврат;
	КонецЕсли;
	
	Элементы.СчетОрганизации.АвтоМаксимальнаяШирина = Ложь;
	Элементы.СчетОрганизации.МаксимальнаяШирина = 22;
	Элементы.ОстатокДенежныхСредств.Заголовок = ДвиженияДенежныхСредствВызовСервера.ЗаголовокНадписиОстатковДС(ТекущийБанковскийСчет, Объект.Организация);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОчередностьПлатежа()
	
	Элементы.ОчередностьПлатежа.СписокВыбора.Добавить(1, НСтр("ru = '1 - Платежи по исполнительным документам: алименты и др.'"));
	Элементы.ОчередностьПлатежа.СписокВыбора.Добавить(2, НСтр("ru = '2 - Платежи по исполнительным документам: оплата труда и др.'"));
	Элементы.ОчередностьПлатежа.СписокВыбора.Добавить(3, НСтр("ru = '3 - Оплата труда, платежи по поручениям контролирующих органов'"));
	Элементы.ОчередностьПлатежа.СписокВыбора.Добавить(4, НСтр("ru = '4 - Платежи по исполнительным документам прочие'"));
	Элементы.ОчередностьПлатежа.СписокВыбора.Добавить(5, НСтр("ru = '5 - Прочие платежи (в т.ч. налоги и взносы)'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКодВыплат()
	
	Если Не ВозможноПеречислениеПособияНаКартуМир(Объект.ВидОперации, ВидКонтрагента, Объект.Контрагент) Тогда
		Объект.КодВыплат = "";
	КонецЕсли;
	
КонецПроцедуры

// Процедура очищает реквизиты, которые ранее могли быть заполнены, но не
// относятся к текущей операции.
//
&НаКлиенте
Процедура ОчиститьРеквизитыНеОтносящиесяКОперации()
	
	ОчиститьКодВыплат();
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Оплата")
	 ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Покупателю") Тогда
	 	Объект.Контрагент = Неопределено;
		Объект.СчетКонтрагента = Неопределено;
	 	Объект.Корреспонденция = Неопределено;
		Объект.ВыплатаЗаработнойПлаты.Очистить();
		Объект.ВыплатаРегламентированнойЗаработнойПлаты.Очистить();
		Объект.Подразделение = Неопределено;
		Объект.НаправлениеДеятельности = Неопределено;
		Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
		Объект.ПериодРегистрации = Неопределено;
		Объект.Подотчетник = Неопределено;
		Объект.Документ = Неопределено;
		Объект.ДоговорКредитаЗайма = Неопределено;
		Объект.РеестрВыплатСамозанятым = Неопределено;
		Для каждого СтрокаТаблицы Из Объект.РасшифровкаПлатежа Цикл
			СтрокаТаблицы.Заказ = Неопределено;
			СтрокаТаблицы.Документ = Неопределено;
			СтрокаТаблицы.ПризнакАванса = Ложь;
			СтрокаТаблицы.ЭтоВзаимозачет = Ложь;
		КонецЦикла;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Зарплата") Тогда
		Объект.ПериодРегистрации = Неопределено;
		Объект.Подотчетник = Неопределено;
		Объект.Документ = Неопределено;
		Объект.Корреспонденция = Неопределено;
		Объект.Контрагент = Неопределено;
		Объект.Договор = Неопределено;
		Объект.СчетКонтрагента = Неопределено;
		Объект.Подразделение = Неопределено;
		Объект.СтавкаНДС = Неопределено;
		Объект.СуммаНДС = 0;
		Объект.ДоговорКредитаЗайма = Неопределено;
		Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
		Если НЕ ФункциональнаяОпцияКассовыйМетодУчетаДоходовИРасходов Тогда
			Объект.НаправлениеДеятельности = Неопределено;
		КонецЕсли;
		Объект.РеестрВыплатСамозанятым = Неопределено;
		Объект.РасшифровкаПлатежа.Очистить();
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Прочее")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПереводНаДругойСчет") 
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ЛичныеСредстваПредпринимателя") Тогда
		Объект.ПериодРегистрации = Неопределено;
		Объект.Подотчетник = Неопределено;
		Объект.Документ = Неопределено;
		Объект.Контрагент = Неопределено;
		Объект.Договор = Неопределено;
		Объект.СчетКонтрагента = Неопределено;
		Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
		Объект.СтавкаНДС = Неопределено;
		Объект.СуммаНДС = 0;
		Объект.ДоговорКредитаЗайма = Неопределено;
		Объект.РеестрВыплатСамозанятым = Неопределено;
		Объект.ВыплатаЗаработнойПлаты.Очистить();
		Объект.ВыплатаРегламентированнойЗаработнойПлаты.Очистить();
		Для каждого СтрокаТаблицы Из Объект.РасшифровкаПлатежа Цикл
			СтрокаТаблицы.Договор = Неопределено;
			СтрокаТаблицы.ПризнакАванса = Ложь;
			СтрокаТаблицы.Документ = Неопределено;
			СтрокаТаблицы.Заказ = Неопределено;
			СтрокаТаблицы.СчетНаОплату = Неопределено;
			СтрокаТаблицы.СтавкаНДС = Неопределено;
			СтрокаТаблицы.СуммаНДС = Неопределено;
			СтрокаТаблицы.ЭтоВзаимозачет = Ложь;
		КонецЦикла;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.НаРасходы") Тогда
		Объект.ПериодРегистрации = Неопределено;
		Объект.Подотчетник = Неопределено;
		Объект.Документ = Неопределено;
		Объект.Контрагент = Неопределено;
		Объект.Договор = Неопределено;
		Объект.СчетКонтрагента = Неопределено;
		Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
		Объект.СтавкаНДС = Неопределено;
		Объект.СуммаНДС = 0;
		Объект.ДоговорКредитаЗайма = Неопределено;
		Объект.РеестрВыплатСамозанятым = Неопределено;
		Объект.ВыплатаЗаработнойПлаты.Очистить();
		Объект.ВыплатаРегламентированнойЗаработнойПлаты.Очистить();
		Для каждого СтрокаТаблицы Из Объект.РасшифровкаПлатежа Цикл
			СтрокаТаблицы.Договор = Неопределено;
			СтрокаТаблицы.ПризнакАванса = Ложь;
			СтрокаТаблицы.Документ = Неопределено;
			СтрокаТаблицы.Заказ = Неопределено;
			СтрокаТаблицы.СчетНаОплату = Неопределено;
			СтрокаТаблицы.СтавкаНДС = Неопределено;
			СтрокаТаблицы.СуммаНДС = Неопределено;
			СтрокаТаблицы.ЭтоВзаимозачет = Ложь;
		КонецЦикла;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Подотчетнику") Тогда
		Объект.Корреспонденция = Неопределено;
		Объект.Контрагент = Неопределено;
		Объект.Договор = Неопределено;
		Объект.СчетКонтрагента = Неопределено;
		Объект.Подразделение = Неопределено;
		Объект.НаправлениеДеятельности = Неопределено;
		Объект.ПериодРегистрации = Неопределено;
		Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
		Объект.СтавкаНДС = Неопределено;
		Объект.СуммаНДС = 0;
		Объект.ДоговорКредитаЗайма = Неопределено;
		Объект.РеестрВыплатСамозанятым = Неопределено;
		Объект.ВыплатаЗаработнойПлаты.Очистить();
		Объект.ВыплатаРегламентированнойЗаработнойПлаты.Очистить();
		Для каждого СтрокаТаблицы Из Объект.РасшифровкаПлатежа Цикл
			СтрокаТаблицы.Договор = Неопределено;
			СтрокаТаблицы.ПризнакАванса = Ложь;
			СтрокаТаблицы.Документ = Неопределено;
			СтрокаТаблицы.Заказ = Неопределено;
			СтрокаТаблицы.СчетНаОплату = Неопределено;
			СтрокаТаблицы.СтавкаНДС = Неопределено;
			СтрокаТаблицы.СуммаНДС = Неопределено;
			СтрокаТаблицы.ЭтоВзаимозачет = Ложь;
		КонецЦикла;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ЗарплатаСотруднику") Тогда
		Объект.Корреспонденция = Неопределено;
		Объект.Контрагент = Неопределено;
		Объект.Договор = Неопределено;
		Объект.СчетКонтрагента = Неопределено;
		Объект.Подразделение = Неопределено;
		Объект.НаправлениеДеятельности = Неопределено;
		Объект.ПериодРегистрации = Неопределено;
		Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
		Объект.СтавкаНДС = Неопределено;
		Объект.СуммаНДС = 0;
		Объект.ДоговорКредитаЗайма = Неопределено;
		Объект.РеестрВыплатСамозанятым = Неопределено;
		Объект.ВыплатаЗаработнойПлаты.Очистить();
		Объект.ВыплатаРегламентированнойЗаработнойПлаты.Очистить();
		Если НЕ ФункциональнаяОпцияКассовыйМетодУчетаДоходовИРасходов Тогда
			Объект.НаправлениеДеятельности = Неопределено;
		КонецЕсли;
		Для каждого СтрокаТаблицы Из Объект.РасшифровкаПлатежа Цикл
			СтрокаТаблицы.Договор = Неопределено;
			СтрокаТаблицы.ПризнакАванса = Ложь;
			СтрокаТаблицы.Документ = Неопределено;
			СтрокаТаблицы.Заказ = Неопределено;
			СтрокаТаблицы.СчетНаОплату = Неопределено;
			СтрокаТаблицы.СтавкаНДС = Неопределено;
			СтрокаТаблицы.СуммаНДС = Неопределено;
			СтрокаТаблицы.ЭтоВзаимозачет = Ложь;
		КонецЦикла;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПрочиеРасчеты") Тогда
		Объект.ПериодРегистрации = Неопределено;
		Объект.Подотчетник = Неопределено;
		Объект.Документ = Неопределено;
		Объект.Корреспонденция = Неопределено;
		Объект.Контрагент = Неопределено;
		Объект.Договор = Неопределено;
		Объект.СчетКонтрагента = Неопределено;
		Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
		Объект.СтавкаНДС = Неопределено;
		Объект.СуммаНДС = 0;
		Объект.ДоговорКредитаЗайма = Неопределено;
		Объект.РеестрВыплатСамозанятым = Неопределено;
		Объект.ВыплатаЗаработнойПлаты.Очистить();
		Объект.ВыплатаРегламентированнойЗаработнойПлаты.Очистить();
		Объект.РасшифровкаПлатежа.Очистить();
		Объект.РасшифровкаПлатежа.Добавить();
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога") Тогда
		Объект.ВыплатаЗаработнойПлаты.Очистить();
		Объект.ВыплатаРегламентированнойЗаработнойПлаты.Очистить();
		Объект.ПериодРегистрации = Неопределено;
		Объект.Подотчетник = Неопределено;
		Объект.СтавкаНДС = Неопределено;
		Объект.СуммаНДС = 0;
		Объект.ДоговорКредитаЗайма = Неопределено;
		Объект.РеестрВыплатСамозанятым = Неопределено;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.РасчетыПоКредитам") Тогда
		Объект.ПериодРегистрации = Неопределено;
		Объект.Подотчетник = Неопределено;
		Объект.Документ = Неопределено;
		Объект.Корреспонденция = Неопределено;
		Объект.Контрагент = Неопределено;
		Объект.Договор = Неопределено;
		Объект.СчетКонтрагента = Неопределено;
		Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
		Объект.СтавкаНДС = Неопределено;
		Объект.СуммаНДС = 0;
		Объект.РеестрВыплатСамозанятым = Неопределено;
		Объект.ВыплатаЗаработнойПлаты.Очистить();
		Объект.ВыплатаРегламентированнойЗаработнойПлаты.Очистить();
		Объект.РасшифровкаПлатежа.Очистить();
		Объект.РасшифровкаПлатежа.Добавить();
	ИначеЕсли Объект.ВидОперации =
			ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ВыплатаСамозанятому")
			Или Объект.ВидОперации =
				ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ВыплатыСамозанятым") Тогда
		Объект.ПериодРегистрации = Неопределено;
		Объект.Подотчетник = Неопределено;
		Объект.Документ = Неопределено;
		Объект.Корреспонденция = Неопределено;
		Объект.Контрагент = Неопределено;
		Объект.Договор = Неопределено;
		Объект.СчетКонтрагента = Неопределено;
		Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
		Объект.СтавкаНДС = Неопределено;
		Объект.СуммаНДС = 0;
		Объект.ДоговорКредитаЗайма = Неопределено;
		Объект.ВыплатаЗаработнойПлаты.Очистить();
		Объект.ВыплатаРегламентированнойЗаработнойПлаты.Очистить();
		Объект.РасшифровкаПлатежа.Очистить();
		Объект.РасшифровкаПлатежа.Добавить();
	КонецЕсли;
	
	Корреспонденция = Объект.Корреспонденция;
	
КонецПроцедуры // ОчиститьРеквизитыНеОтносящиесяКОперации()

// Процедура устанавливает устанавливает видимость реквизитов в зависимости от корреспонденции.
//
&НаСервере
Процедура УстановитьВидимостьРеквизитовВЗависимостиОтКорреспонденции(ОчиститьАналитику = Ложь)
	
	ФормыДокументовДеньги.УстановитьВидимостьРеквизитовВЗависимостиОтКорреспонденции(ЭтаФорма, ОчиститьАналитику)
	
КонецПроцедуры

// Процедура обработки изменения поля Вид операции на сервере.
//
&НаСервере
Процедура УстановитьСтатьюДДСПриСменеВидаОперации()
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.Покупателю
		И (Объект.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам
		ИЛИ Объект.Статья = Справочники.СтатьиДвиженияДенежныхСредств.Прочее
		ИЛИ Объект.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей) Тогда
		Объект.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.Оплата
		И (Объект.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей
		ИЛИ Объект.Статья = Справочники.СтатьиДвиженияДенежныхСредств.Прочее
		ИЛИ Объект.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам) Тогда
		Объект.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам;
	ИначеЕсли (Объект.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей
		ИЛИ Объект.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам) Тогда
		Объект.Статья = Справочники.СтатьиДвиженияДенежныхСредств.Прочее;
	КонецЕсли;
	
КонецПроцедуры // УстановитьСтатьюДДСПриСменеВидаОперации()

// Получает структуру параметров формы выбора договора контрагента.
//
&НаСервереБезКонтекста
Функция ПолучитьПараметрыФормыВыбора(Документ, Организация, Контрагент, Договор, ВидОперации)
	
	СписокВидовДоговоров = Справочники.ДоговорыКонтрагентов.ПолучитьСписокВидовДоговораДляДокумента(Документ, ВидОперации);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КонтролироватьВыборДоговора", Контрагент.ВестиРасчетыПоДоговорам);
	ПараметрыФормы.Вставить("Контрагент", Контрагент);
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("ВидыДоговоров", СписокВидовДоговоров);
	ПараметрыФормы.Вставить("ТекущаяСтрока", Договор);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРеквизитыПоВидуОперации()
	
	Если ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.Оплата Тогда
		ДополнительныеДействияРасшифровкаПлатежа(Истина);
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.ПереводНаДругойСчет ИЛИ ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.ЛичныеСредстваПредпринимателя Тогда
		Объект.ИННПолучателя = Объект.Организация.ИНН;
		Объект.КПППолучателя = Объект.Организация.КПП;
		СтруктураДанные = ПолучитьДанныеСчетКонтрагентаПриИзменении(Объект.Организация, Объект.БанковскийСчет, Объект.ВидОперации);
		ЗаполнитьТекстПолучателя(СтруктураДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоФизЛицуНаСервере(ПриИзменении = Ложь)
	
	Если Объект.ВидОперации <> Перечисления.ВидыОперацийПлатежноеПоручение.ЗарплатаСотруднику
		 И Объект.ВидОперации <> Перечисления.ВидыОперацийПлатежноеПоручение.Подотчетнику Тогда
		 
		Элементы.СчетКонтрагента.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		Физлицо = Справочники.ФизическиеЛица.ПустаяСсылка();
		Возврат;
		
	КонецЕсли;
	
	Если ПриИзменении Тогда
		
		СтруктураДанные = ДанныеКонтрагентаДляИзменения(Объект.Подотчетник, Объект.ВалютаДокумента, Объект.ВидОперации);
		
		Объект.СчетКонтрагента 	= СтруктураДанные.СчетКонтрагента;
		Объект.ИННПолучателя	= СтруктураДанные.ИННПолучателя;
		Объект.КПППолучателя	= СтруктураДанные.КПППолучателя;
		ЗаполнитьТекстПолучателя(СтруктураДанные);
		
		НазначениеПлатежа 		= СтруктураДанные.НазначениеПлатежа;
		
		СформироватьНазначениеПлатежа();
		
	КонецЕсли;
	
	Физлицо = Объект.Подотчетник.Физлицо;
	
	Элементы.СчетКонтрагента.Доступность = ЗначениеЗаполнено(Объект.Подотчетник) И ЗначениеЗаполнено(Физлицо);
	Элементы.СчетКонтрагента.Видимость = ЗначениеЗаполнено(Объект.Подотчетник);
	
	Если ЗначениеЗаполнено(Объект.Подотчетник) Тогда
		Элементы.СчетКонтрагента.ОтображениеПодсказки = ?(ЗначениеЗаполнено(Физлицо), ОтображениеПодсказки.Нет, ОтображениеПодсказки.ОтображатьСнизу); 
	КонецЕсли;
	
	ОбновитьЗаголовкиСворачиваемыхГруппНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокПолучателя()
	
	ЗаголовокПолучателя = ПолучитьЗаголовокПлательщикаПолучателя(Объект.ИННПолучателя, Объект.КПППолучателя, Объект.ТекстПолучателя, Истина, Элементы.КПППолучателя.Видимость);
	Элементы.ИННКПППолучателяТекст.Заголовок = ЗаголовокПолучателя;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокПлательщика()
	
	ЗаголовокПлательщика = ПолучитьЗаголовокПлательщикаПолучателя(Объект.ИННПлательщика, Объект.КПППлательщика, Объект.ТекстПлательщика, Ложь, Элементы.КПППлательщика.Видимость);
	Элементы.ИННКПППлательщикаТекст.Заголовок = ЗаголовокПлательщика;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовкиСворачиваемыхГруппНаСервере()
	
	ЗаголовокПолучателя = ПолучитьЗаголовокПлательщикаПолучателя(Объект.ИННПолучателя, Объект.КПППолучателя, Объект.ТекстПолучателя, Истина, Элементы.КПППолучателя.Видимость);
	ЗаголовокПлательщика = ПолучитьЗаголовокПлательщикаПолучателя(Объект.ИННПлательщика, Объект.КПППлательщика, Объект.ТекстПлательщика, Ложь, Элементы.КПППлательщика.Видимость);
	Элементы.ИННКПППолучателяТекст.Заголовок = ЗаголовокПолучателя;
	Элементы.ИННКПППлательщикаТекст.Заголовок = ЗаголовокПлательщика;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекстДекорацииНазначения()
	
	ТекстЗаголовка = ПолучитьТекстДекорацииНазначения(Объект.НазначениеПлатежа);
	Элементы.ДекорацияДлинаНазначенияПлатежа.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТекстДекорацииНазначенияНаСервере()
	
	ТекстЗаголовка = ПолучитьТекстДекорацииНазначения(Объект.НазначениеПлатежа);
	Элементы.ДекорацияДлинаНазначенияПлатежа.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьЗаголовокПлательщикаПолучателя(Знач ИНН, Знач КПП, Знач Текст, ЭтоГруппаПолучателя, КППИспользуется = Истина)
	
	Если КППИспользуется Тогда
		Шаблон = НСтр("ru='%1: %2 / %3 - %4'");
	Иначе
		Шаблон = НСтр("ru='%1: %2 - %4'");
	КонецЕсли;
	
	Если ЭтоГруппаПолучателя Тогда
		НаименованиеГруппы = НСтр("ru='Получатель'");
		ПустойТекст = НСтр("ru='<Текст получателя>'");
	Иначе
		НаименованиеГруппы = НСтр("ru='Плательщик'");
		ПустойТекст = НСтр("ru='<Текст плательщика>'");
	КонецЕсли;
	
	ИНН = ?(ЗначениеЗаполнено(ИНН), ИНН, НСтр("ru='<ИНН>'"));
	КПП = ?(ЗначениеЗаполнено(КПП), КПП, НСтр("ru='<КПП>'"));
	Текст = ?(ЗначениеЗаполнено(Текст), Текст, ПустойТекст);
	
	ТекстЗаголовка = СтрШаблон(Шаблон, НаименованиеГруппы, ИНН, КПП, Текст);
	Возврат СтрЗаменить(ТекстЗаголовка, " ", Символы.НПП);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьТекстДекорацииНазначения(НазначениеПлатежа)
	
	РекомендуемаяДлина = 210;
	ТекстЗаголовка = "";
	
	Если СтрДлина(НазначениеПлатежа) > РекомендуемаяДлина Тогда
		Шаблон = НСтр("ru='Длина назначения превышена на %1'");
		СклоняемыйТекст = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
							НСтр("ru = ';%1 символ;;%1 символа;%1 символов;%1 символа'"), СтрДлина(НазначениеПлатежа) - РекомендуемаяДлина);
		ТекстЗаголовка = СтрШаблон(Шаблон, СклоняемыйТекст);
	КонецЕсли;
	
	Возврат ТекстЗаголовка;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоВидОперацииБезНДС(ВидОперации)
	
	Возврат Документы.ПлатежноеПоручение.ЭтоВидОперацииБезНДС(ВидОперации);
	
КонецФункции

&НаСервере
Процедура ОбновитьСуммуНДС()
	СтавкаНДСЗначение = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(Объект.СтавкаНДС);
	Объект.СуммаНДС = Объект.СуммаДокумента - (Объект.СуммаДокумента) / ((СтавкаНДСЗначение + 100) / 100);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидПлатежаИзНастроек()
	
	ВидПлатежаИзНастроек = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(ИмяФормы, ЭтаФОрма.Элементы.ВидПлатежа.Имя, ""); // Не локализуется
	
	Если 	ВидПлатежаИзНастроек = ""
		ИЛИ ВРег(ВидПлатежаИзНастроек) = "ЭЛЕКТРОННО" // Не локализуется
		ИЛИ ВРег(ВидПлатежаИзНастроек) = "ПОЧТОЙ" // Не локализуется
		ИЛИ ВРег(ВидПлатежаИзНастроек) = "ТЕЛЕГРАФОМ" // Не локализуется
		ИЛИ ВРег(ВидПлатежаИзНастроек) = "СРОЧНО" Тогда // Не локализуется
		
		Объект.ВидПлатежа = ВидПлатежаИзНастроек;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьВидПлатежаВНастройки()
	
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить(ИмяФормы, ЭтаФОрма.Элементы.ВидПлатежа.Имя, Объект.ВидПлатежа);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НужноПоказыватьЭлементыБЗКБДляОрганизации(Организация)
	Возврат Справочники.Организации.НужноПоказыватьЭлементыБЗКБДляОрганизации(Организация);
КонецФункции

#Область ОбластьРаботаСРегулярнымиПлатежами

&НаСервереБезКонтекста
Процедура УстановитьВидимостьРегулярныеПлатежи(Элемент)
	
	Элемент.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьРегулярныеПлатежи");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДатаСледующегоПлатежа(ИсходныйДокумент)
	
	Возврат РегистрыСведений.РегулярныеПлатежиГрафик.ДатаБлижайшегоПлатежа(ИсходныйДокумент);

КонецФункции

&НаКлиенте
Процедура ОткрытьПравилоРегулярногоПлатежа()
	
	Если ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРегулярныхПлатежей = Новый Структура;
	ПараметрыРегулярныхПлатежей.Вставить("ОтображатьОдинДокумент", Истина);
	ПараметрыРегулярныхПлатежей.Вставить("ИсходныйДокумент", Объект.Ссылка);
	ОткрытьФорму("Обработка.АссистентУправления.Форма.ОповещениеПользователяОРегулярномПлатеже",
		ПараметрыРегулярныхПлатежей, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НадписьСледующийПлатеж(ИсходныйДокумент)
	
	ДатаСледующегоПлатежа = ДатаСледующегоПлатежа(ИсходныйДокумент);
	
	Если ЗначениеЗаполнено(ДатаСледующегоПлатежа) Тогда
		
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Следующий платеж %1'"),
			Формат(ДатаСледующегоПлатежа, "ДЛФ=D"));
	
	Иначе
		
		Возврат НСтр("ru = 'Повторять платеж'");
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВопросРедактированиеПравилаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ПараметрыЗаписи = Новый Структура("ОткрытьПравилоРегулярногоПлатежа");
		
		Если Записать(ПараметрыЗаписи) Тогда
			
			ОткрытьПравилоРегулярногоПлатежа();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область УправлениеВнешнимВидомФормы

// Процедура устанавливает доступность реквизитов перечисления налогов.
//
&НаКлиенте
Процедура УстановитьДоступностьРеквизитовПеречисленияНалогов()
	
	Если ПериодичностьУплаты = "0" Тогда
		Элементы.ГодПериод.Видимость = Ложь;
		Элементы.ДатаПлатежа.Видимость = Ложь;
	Иначе
		Если ПериодичностьУплаты = "-" Тогда
			Элементы.ГодПериод.Видимость = Ложь;
			Элементы.ДатаПлатежа.Видимость = Истина;
		Иначе
			Элементы.ГодПериод.Видимость = Истина;
			Элементы.ДатаПлатежа.Видимость = Ложь;
			Элементы.ПериодПлатежа.Видимость = ПериодичностьУплаты <> "ГД";
			Если ПериодичностьУплаты = "МС" Тогда
				Элементы.ПериодПлатежа.МинимальноеЗначение = 1;
				Элементы.ПериодПлатежа.МаксимальноеЗначение = 12;
				Элементы.ПериодПлатежа.Заголовок = НСтр("ru = 'Месяц'");
			ИначеЕсли ПериодичностьУплаты = "КВ" Тогда
				Элементы.ПериодПлатежа.МинимальноеЗначение = 1;
				Элементы.ПериодПлатежа.МаксимальноеЗначение = 4;
				Элементы.ПериодПлатежа.Заголовок = НСтр("ru = 'Квартал'");
			ИначеЕсли ПериодичностьУплаты = "ПЛ" Тогда
				Элементы.ПериодПлатежа.МинимальноеЗначение = 1;
				Элементы.ПериодПлатежа.МаксимальноеЗначение = 2;
				Элементы.ПериодПлатежа.Заголовок = НСтр("ru = 'Полугодие'");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // УстановитьДоступностьРеквизитовПеречисленияНалогов()

#КонецОбласти

#Область ЗаполнениеОбъектов

&НаКлиенте
Процедура СохранитьДокументКакШаблон(Параметр) Экспорт
	
	ЗаполнениеОбъектовУНФКлиент.СохранитьДокументКакШаблон(Объект, ОтображаемыеРеквизиты(), Параметр);
	
КонецПроцедуры

&НаСервере
Функция ОтображаемыеРеквизиты()
	
	Возврат ЗаполнениеОбъектовУНФ.ОтображаемыеРеквизиты(ЭтотОбъект);
	
КонецФункции

#КонецОбласти

#Область АвтоподборКонтактов

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	АвтоподборКонтактовКлиент.Подключаемый_ОбработкаВыбора(ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_АвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	АвтоподборКонтактовКлиент.Подключаемый_АвтоПодбор(ЭтотОбъект, Элемент, Текст, ДанныеВыбора, Параметры, Ожидание,
		СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиБиблиотек

// ЭлектронноеВзаимодействие.ОбменСБанками
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ПриНажатииНаСсылкуДиректБанк()
	
	ОбменСБанкамиКлиент.ОткрытьАктуальныйЭД(Объект.Ссылка, ЭтотОбъект);
	
КонецПроцедуры
// Конец ЭлектронноеВзаимодействие.ОбменСБанками

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьВКлиентБанкаТекущийДокумент(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Сначала запишите документ.'"));
		Возврат;
	КонецЕсли;
	
	СписокВыгрузки = Новый СписокЗначений;
	СписокВыгрузки.Добавить(Объект.Ссылка);
	ПараметрыОткрытия = Новый Структура("СписокПлатежек, БанковскийСчет", СписокВыгрузки, Объект.БанковскийСчет);
	ОткрытьФорму("Обработка.КлиентБанкУНФ.Форма.СохранениеПлатежек", ПараметрыОткрытия,,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КонструкторКБК(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КБК", Объект.КодБК);
	ВидПеречисления = ПлатежиВБюджетКлиентСервер.ВидПеречисления(Объект.КодБК, ОбщегоНазначенияКлиент.ДатаСеанса());
	ПараметрыФормы.Вставить("ВидПеречисления", ВидПеречисления);
	ОткрытьФорму("Справочник.ВидыНалогов.Форма.КонструкторКБК", ПараметрыФормы, Элементы.КодБК);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДоговоруКредита(Команда)
	
	Если Объект.ДоговорКредитаЗайма.Пустая() Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Выберите договор'"));
		Возврат;
	КонецЕсли;
	
	АдресРасшифровкиПлатежаВХранилище = ПоместитьРасшифровкаПлатежаВХранилище();
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("АдресРасшифровкиПлатежаВХранилище", АдресРасшифровкиПлатежаВХранилище);
	ПараметрыОтбора.Вставить("Организация", Объект.Организация);
	ПараметрыОтбора.Вставить("Регистратор", Объект.Ссылка);
	ПараметрыОтбора.Вставить("ИдентификаторФормыДокумента", УникальныйИдентификатор);
	ПараметрыОтбора.Вставить("ВидОперации", Объект.ВидОперации);
	ПараметрыОтбора.Вставить("Дата", Объект.Дата);
	ПараметрыОтбора.Вставить("Валюта", Объект.ВалютаДокумента);
	ПараметрыОтбора.Вставить("ДоговорКредитаЗайма", Объект.ДоговорКредитаЗайма);
	ПараметрыОтбора.Вставить("СуммаДокумента", Объект.СуммаДокумента);
	ПараметрыОтбора.Вставить("Контрагент", Объект.Контрагент);
	ПараметрыОтбора.Вставить("СтавкаНДСПоУмолчанию", СтавкаНДСПоУмолчанию);
	ПараметрыОтбора.Вставить("СуммаПлатежа", Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа"));
	ПараметрыОтбора.Вставить("Курс", Курс);
	ПараметрыОтбора.Вставить("Кратность", Кратность);
	ПараметрыОтбора.Вставить("Сотрудник", Неопределено);
	
	ОткрытьФорму("ОбщаяФорма.ФормаЗаполненияРасшифровкиПлатежаПоКредитамИЗаймам", ПараметрыОтбора, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ЗаполнитьПоДоговоруКредитаЗавершение", ЭтотОбъект));
	
КонецПроцедуры

// Процедура - обработчик команды ЗаполнитьПоДоговоруКредита. Завершающая часть, которая вызывается после выбора данных заполнения.
//
&НаКлиенте
Процедура ЗаполнитьПоДоговоруКредитаЗавершение(РезультатЗаполнения, ПараметрыЗавершения) Экспорт

	Если ТипЗнч(РезультатЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьСуммуДокумента = Ложь;
		Если РезультатЗаполнения.Свойство("ОчищатьТабличнуюЧастьПриЗаполнении") И РезультатЗаполнения.ОчищатьТабличнуюЧастьПриЗаполнении Тогда
			Объект.РасшифровкаПлатежа.Очистить();
			ЗаполнитьСуммуДокумента = Истина;
		КонецЕсли;
		Если РезультатЗаполнения.Свойство("АдресРасшифровкиПлатежаВХранилище") Тогда
			ПолучитьРасшифровкаПлатежаИзХранилища(РезультатЗаполнения.АдресРасшифровкиПлатежаВХранилище, Ложь);
			
			Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
				Объект.СуммаДокумента = Объект.РасшифровкаПлатежа[0].СуммаПлатежа;
			КонецЕсли;
		КонецЕсли;
		Если ЗаполнитьСуммуДокумента Тогда
			Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
			СуммаДокументаПриИзменении(Элементы.СуммаДокумента);
		КонецЕсли;
		
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШапкаТабличнаяЧасть(Команда)
	
	ФормыДокументовДеньгиКлиент.ШапкаТабличнаяЧасть(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ШапкаТабличнаяЧастьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.БылиВнесеныИзменения Тогда
		ШапкаТабличнаяЧастьЗавершениеНаСервере(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ШапкаТабличнаяЧастьЗавершениеНаСервере(Знач Результат)
	
	ФормыДокументовДеньги.ШапкаТабличнаяЧастьЗавершение(ЭтаФорма, Результат);
	
КонецПроцедуры

#КонецОбласти

#Область Основание

&НаКлиенте
Процедура ДокументОснованиеНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ФормыДокументовДеньгиКлиент.ДокументОснованиеНадписьОбработкаНавигационнойСсылки(ЭтаФорма, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "удалить" Тогда // Не локализуется
		СформироватьНазначениеПлатежа();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборТипаОснованияЗавершение(ИмяФормыОснования, Параметры) Экспорт
	
	Если ИмяФормыОснования <> Неопределено Тогда
		
		СтруктураПараметровОтбора = Новый Структура();
		Для каждого ЭлементОтбора Из ПараметрыВыбораДокументаОснования Цикл
			ИмяПоляОтбора = СтрЗаменить(ЭлементОтбора.Имя,"Отбор.","");
			СтруктураПараметровОтбора.Вставить(ИмяПоляОтбора, ЭлементОтбора.Значение);
		КонецЦикла;
		Если СтрНайти(ИмяФормыОснования.Значение, "Документ.НачислениеНалогов") > 0 Тогда
			СтруктураПараметровОтбора.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийНачислениеНалогов.Начисление"));
		КонецЕсли;
		Если СтрНайти(ИмяФормыОснования.Значение, "Документ.РасходДСПлан") > 0 Тогда
			СтруктураПараметровОтбора.Вставить("ТипДенежныхСредств", ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Безналичные"));
		КонецЕсли;
		ПараметрыДляОткрытияФормы = Новый Структура("Отбор", СтруктураПараметровОтбора);
		_ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыбратьОснованиеЗавершение", ЭтотОбъект);
		ОткрытьФорму(ИмяФормыОснования.Значение, ПараметрыДляОткрытияФормы, ЭтотОбъект, ,,,_ОповещениеОЗакрытии);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОснованиеЗавершение(ВыбЗначение, Параметры) Экспорт

	Если ВыбЗначение<>Неопределено Тогда
		Объект.ДокументОснование = ВыбЗначение;
		Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(ВыбЗначение);
		Модифицированность = Истина;
		
		ФормыДокументовДеньгиКлиент.ЗаполнитьПоОснованиюНачало(ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область РасшифровкаПлатежа

// Процедура выполняет дополнительные действия, необходимые для корректной работы табличной части "Расшифровка платежа"
//
&НаСервере
Процедура ДополнительныеДействияРасшифровкаПлатежа(ПриСозданииНаСервере = Ложь)
	
	Если  Объект.ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.Оплата
			   ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.Покупателю Тогда
		
		Если ПриСозданииНаСервере Тогда
			
			УстановитьУсловноеОформление();
			
			Если ЗначениеЗаполнено(Объект.СтавкаНДС) Тогда
				СтавкаНДСПоУмолчанию = Объект.СтавкаНДС;
				СтавкаНДСПоУмолчаниюЧисло = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(Объект.СтавкаНДС);
			Иначе
				СтавкаНДСПоУмолчанию = РасчетыРаботаСФормамиВызовСервера.СтавкаНДСПоОрганизацииНалогообложениеНДСИСпособуЗаполнения(
					Объект.Организация, Объект.Дата, СпособЗаполненияСтавкиНДС);
				СтавкаНДСПоУмолчаниюЧисло = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтавкаНДСПоУмолчанию);
			КонецЕсли; 
			
			Если НЕ ЗначениеЗаполнено(Объект.СтавкаНДС) И (ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.Покупателю
				ИЛИ ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.Оплата) Тогда
					Объект.СтавкаНДС = СтавкаНДСПоУмолчанию;
			КонецЕсли;
			
			ДатаПриСозданииНаСервере = Объект.Дата;
			
		КонецЕсли;
		
		РасчетыРаботаСФормамиВызовСервера.УстановитьВидимостьРеквизитовРасчетовФрагмент(ЭтотОбъект);
		РасчетыРаботаСФормамиВызовСервера.ЗаполнитьРеквизитыКурсИКратность(ЭтотОбъект);
		
		Если Элементы.РасшифровкаПлатежаДоговор.Видимость Тогда
			Элементы.РасшифровкаПлатежаДоговорИСтатьяДДС.Заголовок = НСтр("ru = 'Договор / Статья ДДС'");
		Иначе
			Элементы.РасшифровкаПлатежаДоговорИСтатьяДДС.Заголовок = НСтр("ru = 'Статья ДДС'");
		КонецЕсли;
		
		Элементы.РасшифровкаПлатежаСчетНаОплату.Видимость = Объект.Контрагент.ВестиУчетОплатыПоСчетам;
		Элементы.РасчетыСКонтрагентом.Видимость = Истина;
		Элементы.РасшифровкаПлатежаСуммаПлатежа.Видимость = УчетВалютныхОпераций;
		
		СпособЗачетаПоУмолчаниюДляКонтрагента = РасчетыРаботаСФормамиВызовСервера.СпособРазнесенияОплатыДляКонтрагента(Объект.Контрагент);
		
	КонецЕсли;
	
		Если НЕ (Объект.ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога
			ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.Зарплата) Тогда
			
		Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда
			ДобавитьПервуюСтрокуРасшифровкиНаСервере();
			Если НЕ Объект.Ссылка.Пустая() Тогда //Открыт документ, созданный до добавления табличной части РасшифровкаПлатежа
				Модифицированность = Ложь;
			КонецЕсли; 
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Обновляет суммы в шапке соответствие с табличной частью "Расшифровка платежа", если в расшифровке указана одна строка
//
&НаКлиенте
Процедура ОбновитьСуммыВШапкеДокумента() Экспорт
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 ИЛИ ИсходнаяСуммаРавнаНулю Тогда
		Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
		Объект.СуммаНДС = Объект.РасшифровкаПлатежа.Итог("СуммаНДС");
		СформироватьНазначениеПлатежа(Истина);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода СуммаДокумента.
//
// Параметры:
//  ВосстанавливатьСтавкиНДС - Булево	 - Признак необходимости восстанавливать ставки НДС
//
&НаКлиенте
Процедура СуммаДокументаПриИзмененииФрагмент(ВосстанавливатьСтавкиНДС = Истина)
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
		
		СтрокаТабличнойЧасти = Объект.РасшифровкаПлатежа[0];
		
		СтрокаТабличнойЧасти.СуммаПлатежа = Объект.СуммаДокумента;
		
		СтрокаТабличнойЧасти.Курс = ?(
			СтрокаТабличнойЧасти.Курс = 0,
			1,
			СтрокаТабличнойЧасти.Курс);
		
		СтрокаТабличнойЧасти.Кратность = ?(
			СтрокаТабличнойЧасти.Кратность = 0,
			1,
			СтрокаТабличнойЧасти.Кратность);
		
		СтрокаТабличнойЧасти.СуммаРасчетов = ВалютыУНФКлиентСервер.Пересчитать(
			СтрокаТабличнойЧасти.СуммаПлатежа, Курс, СтрокаТабличнойЧасти.Курс, Кратность,
			СтрокаТабличнойЧасти.Кратность);
		
		СтрокаТабличнойЧасти.СтавкаНДС = Объект.СтавкаНДС;
		
		СтрокаТабличнойЧасти.Аванс = ?(СтрокаТабличнойЧасти.ПризнакАванса, СтрокаТабличнойЧасти.СуммаПлатежа, 0);
		
		Если ВосстанавливатьСтавкиНДС = Истина Тогда
			РасчетыРаботаСФормамиКлиент.РассчитатьСуммуНДСНаКлиенте(СтрокаТабличнойЧасти);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // СуммаДокументаПриИзменении()

// Рассчитывает сумму платежа в зависимости от валюты и кратности в строке и документе
//
&НаКлиенте
Процедура РассчитатьСуммуПлатежаНаКлиенте(СтрокаТабличнойЧасти, ИмяКолонки = "", НеПересчитыватьИтоги = Ложь, ЭтоПомощник = Ложь) Экспорт
	
	СтруктураДанные = РасчетыРаботаСФормамиВызовСервера.ПолучитьДанныеРасшифровкаПлатежаДоговорПриИзменении(
			?(ЭтоПомощник, ДатаДокумента, Объект.Дата),
			СтрокаТабличнойЧасти.Договор);
		
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
		?(СтруктураДанные.ДоговорВалютаКурсКратность.Курс =0, 1, СтруктураДанные.ДоговорВалютаКурсКратность.Курс),
		СтрокаТабличнойЧасти.Курс);
	СтрокаТабличнойЧасти.Кратность = ?(
		СтрокаТабличнойЧасти.Кратность = 0,
		1,
		СтрокаТабличнойЧасти.Кратность);
	
	Если СтрокаТабличнойЧасти.СуммаРасчетов = 0 Тогда
		СтрокаТабличнойЧасти.СуммаПлатежа = 0;
		СтрокаТабличнойЧасти.Курс = СтруктураДанные.ДоговорВалютаКурсКратность.Курс;
	ИначеЕсли Объект.ВалютаДокумента = СтруктураДанные.ВалютаРасчетов Тогда
		СтрокаТабличнойЧасти.СуммаПлатежа = СтрокаТабличнойЧасти.СуммаРасчетов;
	ИначеЕсли СтрокаТабличнойЧасти.СуммаПлатежа = 0 ИЛИ
		(ИмяКолонки = "Курс" ИЛИ ИмяКолонки = "Кратность") Тогда
		Если СтрокаТабличнойЧасти.Курс = 0 Тогда
			СтрокаТабличнойЧасти.СуммаПлатежа = 0;
		Иначе
			СтрокаТабличнойЧасти.СуммаПлатежа = ВалютыУНФКлиентСервер.Пересчитать(
				СтрокаТабличнойЧасти.СуммаРасчетов, СтрокаТабличнойЧасти.Курс, Курс, СтрокаТабличнойЧасти.Кратность,
				Кратность);
		КонецЕсли;
	Иначе
		СтрокаТабличнойЧасти.Курс = ?(
			СтрокаТабличнойЧасти.СуммаРасчетов = 0 ИЛИ СтрокаТабличнойЧасти.СуммаПлатежа = 0,
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс, //СтрокаТабличнойЧасти.Курс,
			СтрокаТабличнойЧасти.СуммаПлатежа / СтрокаТабличнойЧасти.СуммаРасчетов * Курс);
		СтрокаТабличнойЧасти.Кратность = ?(
			СтрокаТабличнойЧасти.СуммаРасчетов = 0 ИЛИ СтрокаТабличнойЧасти.СуммаПлатежа = 0,
			СтруктураДанные.ДоговорВалютаКурсКратность.Кратность,
			СтрокаТабличнойЧасти.Кратность);
	КонецЕсли;
	
	Если Не ЭтоПомощник Тогда
		СтрокаТабличнойЧасти.Аванс = ?(СтрокаТабличнойЧасти.ПризнакАванса, СтрокаТабличнойЧасти.СуммаПлатежа, 0);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтавкаНДС) Тогда
		СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
	КонецЕсли;
	
	РасчетыРаботаСФормамиКлиент.РассчитатьСуммуНДСНаКлиенте(СтрокаТабличнойЧасти);
	
КонецПроцедуры // РассчитатьСуммуПлатежаНаКлиенте()

// Процедура заполняет расшифровку платежа.
//
&НаСервере
Процедура ЗаполнитьРасшифровкуПлатежа(ТекущийОбъект = Неопределено)
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.ЗаполнитьРасшифровкуПлатежа();
	ЗначениеВРеквизитФормы(Документ, "Объект");
	Модифицированность = Истина;
	
КонецПроцедуры // ЗаполнитьРасшифровкуПлатежа()

// Устанавливает условное оформление табличной части "Расшифровка платежа"
//
&НаСервере
Процедура УстановитьУсловноеОформление()
	
	РасчетыРаботаСФормамиВызовСервера.УстановитьУсловноеОформлениеРасчетов(ЭтотОбъект, Перечисления.ВидыОперацийРасходСоСчета.Поставщику);
	
КонецПроцедуры

// Добавляет строку расшифровки платежа, если табличная часть "РасшифровкаПлатежа" пуста
//
&НаСервере
Процедура ДобавитьПервуюСтрокуРасшифровкиНаСервере()
	
	Модифицированность = Истина;
	
	Объект.РасшифровкаПлатежа.Добавить();
	Объект.РасшифровкаПлатежа[0].СуммаПлатежа = Объект.СуммаДокумента;
	Объект.РасшифровкаПлатежа[0].Договор =
		?(Объект.Контрагент = Договор.Владелец, Договор,
		ДанныеКонтрагентаДляИзменения(Объект.Контрагент, Объект.ВалютаДокумента, ВидОперации).Договор);
	Объект.РасшифровкаПлатежа[0].СпособЗачета = РасчетыРаботаСФормамиВызовСервера.СпособРазнесенияОплатыДляДоговора(Объект.РасшифровкаПлатежа[0].Договор, Объект.Контрагент);
	Объект.РасшифровкаПлатежа[0].ПризнакАванса = Истина;
	
	// Для совместимости с предыдущей версией, заполнение расшифровки по данным основания
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		Если НЕ Объект.Ссылка.Пустая() Тогда
			Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				
				Если Объект.Контрагент.ВестиРасчетыПоЗаказам Тогда
					Объект.РасшифровкаПлатежа[0].Заказ = Объект.ДокументОснование;
				КонецЕсли; 
				
			ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
				Объект.РасшифровкаПлатежа[0].СчетНаОплату = Объект.ДокументОснование;
				Объект.РасшифровкаПлатежа[0].Заказ = Объект.ДокументОснование.ДокументОснование;
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РасходДСПлан") Тогда
			Объект.РасшифровкаПлатежа[0].ДокументПланирования = Объект.ДокументОснование;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события Выполнить команды Подбор.
// Открывает форму подбора документов.
//
&НаКлиенте
Процедура Подбор(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПоказатьПредупреждение(Неопределено,НСтр("ru = 'Укажите вначале контрагента.'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.БанковскийСчет)
	   И НЕ ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		ПоказатьПредупреждение(Неопределено,НСтр("ru = 'Укажите вначале банковский счет.'"));
		Возврат;
	КонецЕсли;
	
	АдресРасшифровкаПлатежаВХранилище = ПоместитьРасшифровкаПлатежаВХранилище();
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("АдресРасшифровкаПлатежаВХранилище", АдресРасшифровкаПлатежаВХранилище); 
	ПараметрыПодбора.Вставить("Компания", Компания);
	ПараметрыПодбора.Вставить("Дата", Объект.Дата);
	ПараметрыПодбора.Вставить("Контрагент", Объект.Контрагент);
	ПараметрыПодбора.Вставить("Ссылка", Объект.Ссылка);
	ПараметрыПодбора.Вставить("ВидОперации", Объект.ВидОперации);
	ПараметрыПодбора.Вставить("ВалютаДенежныхСредств", Объект.ВалютаДокумента);
	ПараметрыПодбора.Вставить("СуммаДокумента", Объект.СуммаДокумента);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодборЗавершение", ЭтотОбъект,
		Новый Структура("АдресРасшифровкаПлатежаВХранилище", АдресРасшифровкаПлатежаВХранилище));
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораДолговПоставщикам", ПараметрыПодбора, , , , , ОписаниеОповещения);
	
КонецПроцедуры

// Процедура - обработчик результата выполнения команды Подбор.
// Завершение подбора документов.
//
&НаКлиенте
Процедура ПодборЗавершение(Результат1, ДополнительныеПараметры) Экспорт
	
	АдресРасшифровкаПлатежаВХранилище = ДополнительныеПараметры.АдресРасшифровкаПлатежаВХранилище;
	
	Результат = Результат1;
	Если Результат = КодВозвратаДиалога.OK Тогда
		
		ПолучитьРасшифровкаПлатежаИзХранилища(АдресРасшифровкаПлатежаВХранилище);
		Для каждого СтрокаРасшифровкаПлатежа Из Объект.РасшифровкаПлатежа Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаРасшифровкаПлатежа.СтавкаНДС) Тогда
				СтрокаРасшифровкаПлатежа.СтавкаНДС = СтавкаНДСПоУмолчанию;
			КонецЕсли;
			РассчитатьСуммуПлатежаНаКлиенте(СтрокаРасшифровкаПлатежа);
			СтрокаРасшифровкаПлатежа.СпособЗачета = ПредопределенноеЗначение("Перечисление.СпособыЗачетаИРаспределенияПлатежей.Вручную");
		КонецЦикла;
		
		ОбновитьСуммыВШапкеДокумента();
		
	КонецЕсли;

КонецПроцедуры // Подбор()

// Процедура - обработчик события Выполнить команды ЗаполнитьРасшифровку.
// Заполняет табличную часть "Расшифровка платежа" данными документов.
//
&НаКлиенте
Процедура ЗаполнитьРасшифровку(Команда)
		
	Если Объект.СуммаДокумента = 0 Тогда
		ПоказатьПредупреждение(Неопределено,НСтр("ru='Укажите вначале сумму документа.'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.БанковскийСчет)
	   И НЕ ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		ПоказатьПредупреждение(Неопределено,НСтр("ru = 'Укажите вначале банковский счет.'"));
		Возврат;
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьРасшифровкуЗавершение", ЭтотОбъект), НСтр(
		"ru='Расшифровка будет полностью перезаполнена. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

// Процедура - обработчик результата выполнения команды ЗаполнитьРасшифровку.
// Завершение заполнения табличной части "Расшифровка платежа" данными документов.
//
&НаКлиенте
Процедура ЗаполнитьРасшифровкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Объект.РасшифровкаПлатежа.Очистить();
	
	ЗаполнитьРасшифровкуПлатежа();
	
КонецПроцедуры // ЗаполнитьРасшифровку()

// Процедура - обработчик события Выполнить команды РаспределитьСуммуПлатежа.
// Начинает открытие формы распределения платежа.
//
&НаКлиенте
Процедура РаспределитьСуммуПлатежа(Команда) Экспорт
	
	Если Объект.Контрагент.Пустая() Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Укажите вначале контрагента.'"));
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуРаспределенияПлатежа();
	
КонецПроцедуры

// Открывает форму распределения платежа при выполнении команды РаспределитьСуммуПлатежа.
//
&НаКлиенте
Процедура ОткрытьФормуРаспределенияПлатежа()
	
	СтруктураПараметров = Новый Структура();
	СтруктураАдресов = ПолучитьСтруктуруАдресовВХранилище();
	СтруктураПараметров.Вставить("СтруктураАдресов", СтруктураАдресов);
	СтруктураПараметров.Вставить("ЭтоРасчетыСПоставщиком", Истина);
	СтруктураПараметров.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	
	РасчетыРаботаСФормамиКлиент.ОткрытьФормуРаспределенияСуммыПлатежа(Истина, ЭтотОбъект, СтруктураПараметров);
	
КонецПроцедуры

// Заполняет табличную часть "Расшифровка платежа" результатом выбора данных заполнения в помощнике
//
&НаКлиенте
Процедура РаспределитьСуммуПлатежаПослеРаспределения(РезультатЗакрытия, ДопПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") И РезультатЗакрытия.Свойство("ДеревоРаспределенияСуммыПлатежа") Тогда
		
		СтруктураВидыИзменяемыхДокументов = РасчетыРаботаСФормамиКлиент.ЗаполнитьРасшифровкуПлатежаДеньгиПоДеревуРаспределения(ЭтотОбъект, РезультатЗакрытия, ДопПараметры);
		ЗаполнитьРасшифровкуПлатежаПоДеревуРаспределенияЗавершение(РезультатЗакрытия, ДопПараметры);
		
		РасчетыРаботаСФормамиКлиент.НастроитьЭлементыДляИзменяемыхДокументов(Истина, ЭтотОбъект, СтруктураВидыИзменяемыхДокументов);
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет табличную часть "Расшифровка платежа" результатом выбора данных заполнения в помощнике
//
&НаКлиенте
Процедура ЗаполнитьРасшифровкуПлатежаПоДеревуРаспределенияЗавершение(РезультатЗакрытия, ДопПараметры)
	
	// Если больше строк не осталось, то добавить одну строку с автоматическим распределением всей суммы на основной договор.
	Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда
		Объект.РасшифровкаПлатежа.Добавить();
		Объект.РасшифровкаПлатежа[0].СуммаПлатежа = Объект.СуммаДокумента;
		Объект.РасшифровкаПлатежа[0].Договор = РезультатЗакрытия.ДоговорПоУмолчанию;
		Объект.РасшифровкаПлатежа[0].СпособЗачета = РасчетыРаботаСФормамиВызовСервера.СпособРазнесенияОплатыДляДоговора(Объект.РасшифровкаПлатежа[0].Договор, Объект.Контрагент);
		Элементы.РасшифровкаПлатежа.ТекущаяСтрока = Объект.РасшифровкаПлатежа[0].ПолучитьИдентификатор();
		РасшифровкаПлатежаСуммаПлатежаПриИзменении(Неопределено);
	КонецЕсли;
	
	Если Объект.СуммаДокумента = 0 Тогда
		Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
		Объект.СуммаНДС = Объект.РасшифровкаПлатежа.Итог("СуммаНДС");
		СформироватьНазначениеПлатежа(Истина);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает структуру адресов хранения данных табличных частей формы для передачи в обработку подбора документов
//
&НаСервере
Функция ПолучитьСтруктуруАдресовВХранилище()
	
	СтруктураДляВозврата = Новый Структура();
	
	СтруктураДляВозврата.Вставить("АдресРасшифровкаПлатежаВХранилище",
		ПоместитьВоВременноеХранилище(
			Объект.РасшифровкаПлатежа.Выгрузить(),
			УникальныйИдентификатор));
	
	СтруктураДляВозврата.Вставить("АдресТаблицаДокументовДляИзмененияВХранилище",
		ПоместитьВоВременноеХранилище(
			Новый ТаблицаЗначений,
			УникальныйИдентификатор));
	
	Возврат СтруктураДляВозврата;
	
КонецФункции // ПоместитьРасшифровкаПлатежаВХранилище()

// Функция получает табличную часть РасшифровкаРасчетов из временного хранилища.
//
&НаСервере
Процедура ПолучитьРасшифровкаПлатежаИзХранилища(АдресРасшифровкаПлатежаВХранилище, Очищать = Истина)
	
	ТаблицаРасшифровкаПлатежа = ПолучитьИзВременногоХранилища(АдресРасшифровкаПлатежаВХранилище);
	Если Очищать Тогда
		Объект.РасшифровкаПлатежа.Очистить();
	КонецЕсли;
	Для каждого СтрокаРасшифровкаПлатежа Из ТаблицаРасшифровкаПлатежа Цикл
		Строка = Объект.РасшифровкаПлатежа.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, СтрокаРасшифровкаПлатежа);
		Если НЕ Строка.Договор.Пустая() Тогда
			Строка.СтатьяДДС = Строка.Договор.СтатьяДДСПоУмолчанию;
		КонецЕсли;
		Если Строка.СпособЗачета.Пустая() Тогда
			Строка.СпособЗачета = РасчетыРаботаСФормамиВызовСервера.СпособРазнесенияОплатыДляДоговора(Строка.Договор, Объект.Контрагент);
		КонецЕсли;
		Если ФормыДокументовДеньгиКлиентСервер.ВидОперацииНДС(Объект.ВидОперации) И НЕ ЗначениеЗаполнено(Строка.СтавкаНДС) Тогда
			Строка.СтавкаНДС = РасчетыРаботаСФормамиВызовСервера.СтавкаНДСПоОрганизацииНалогообложениеНДСИСпособуЗаполнения(
				Объект.Организация, Объект.Дата, Справочники.ДоговорыКонтрагентов.СпособЗаполненияСтавкиНДСПоДоговору(Строка.Договор));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПолучитьРасшифровкаПлатежаИзХранилища()

// Функция помещает табличную часть РасшифровкаРасчетов во временное хранилище
// и возвращает адрес
//
&НаСервере
Функция ПоместитьРасшифровкаПлатежаВХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(
		Объект.РасшифровкаПлатежа.Выгрузить(,
			"Договор,
			|ПризнакАванса,
			|Документ,
			|Заказ,
			|СуммаРасчетов,
			|Курс,
			|Кратность,
			|СпособЗачета,
			|СуммаПлатежа"
		),
		УникальныйИдентификатор);
	
КонецФункции // ПоместитьРасшифровкаПлатежаВХранилище()

#Область ОбработчикиСобытийРасшифровкиПлатежа

// Процедура - обработчик события ПередУдалением табличной части РасшифровкаПлатежа.
//
&НаКлиенте
Процедура РасшифровкаПлатежаПередУдалением(Элемент, Отказ)
	
	Если Объект.РасшифровкаПлатежа.Количество() <= 1 Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры // РасшифровкаПлатежаПередУдалением()

// Процедура - обработчик события ПриНачалеРедактирования табличной части РасшифровкаПлатежа.
//
&НаКлиенте
Процедура РасшифровкаПлатежаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено И ТекущиеДанные.СпособЗачета.Пустая() Тогда
			ТекущиеДанные.СпособЗачета = СпособЗачетаПоУмолчаниюДляКонтрагента;
		КонецЕсли;
		Если НЕ Копирование Тогда
			Если ЗначениеЗаполнено(Объект.Договор) Тогда
				ТекущиеДанные.Договор = Объект.Договор;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаСпособЗачета.
//
&НаКлиенте
Процедура РасшифровкаПлатежаСпособЗачетаПриИзменении(Элемент)
	
	РасчетыРаботаСФормамиКлиент.РасшифровкаПлатежаСпособЗачетаПриИзменении(Элементы.РасшифровкаПлатежа.ТекущиеДанные);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаВидРасчетов.
// Очищает реквизит документ если тип расчетов - "Аванс".
//
&НаКлиенте
Процедура РасшифровкаПлатежаПризнакАвансаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти.ПризнакАванса Тогда
		СтрокаТабличнойЧасти.Документ = Неопределено;
	КонецЕсли;
	
	СтрокаТабличнойЧасти.Аванс = ?(СтрокаТабличнойЧасти.ПризнакАванса , СтрокаТабличнойЧасти.СуммаПлатежа, 0);
	
КонецПроцедуры // РасшифровкаПлатежаПризнакАвансаПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаЗаказ.
//
&НаКлиенте
Процедура РасшифровкаПлатежаЗаказПриИзменении(Элемент)
	
	РасшифровкаПлатежаЗаказПриИзмененииФрагмент(Элементы.РасшифровкаПлатежа.ТекущиеДанные.ПолучитьИдентификатор());
	ОбновитьСуммыВШапкеДокумента();
	СформироватьНазначениеПлатежа();
	
КонецПроцедуры

// Процедура - фрагмент обработчика события ПриИзменении поля ввода РасшифровкаПлатежаЗаказ.
//
&НаСервере
Функция РасшифровкаПлатежаЗаказПриИзмененииФрагмент(ТекущиеДанныеИдентификатор)
	
	Возврат РасчетыРаботаСФормамиВызовСервера.РасшифровкаПлатежаЗаказПриИзмененииФрагмент(Объект, ТекущиеДанныеИдентификатор);
	
КонецФункции

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаДокумент.
//
&НаКлиенте
Процедура РасшифровкаПлатежаДокументПриИзменении(Элемент)
	
	ВыполнитьДействияПриИзмененииДокументаРасчетов();
	
КонецПроцедуры // РасшифровкаПлатежаДокументПриИзменении() 

// Процедура - обработчик события НачалоВыбора поля ввода РасшифровкаПлатежаДокумент.
// Передает в параметры текущее значение реквизита.
//
&НаКлиенте
Процедура РасшифровкаПлатежаДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти <> Неопределено И СтрокаТабличнойЧасти.СпособЗачета = ПредопределенноеЗначение("Перечисление.СпособыЗачетаИРаспределенияПлатежей.Авто") Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоРасчетыСПокупателями = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Покупателю");
	
	СтруктураОтбор = Новый Структура();
	СтруктураОтбор.Вставить("Контрагент", Объект.Контрагент);
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Договор) Тогда
		СтруктураОтбор.Вставить("Договор", СтрокаТабличнойЧасти.Договор);
	КонецЕсли;
	Если НЕ УчетПоКомпании Тогда
		СтруктураОтбор.Вставить("Организация", Объект.Организация);
	КонецЕсли;
	
	СтруктураПараметры = Новый Структура("Отбор, ЭтоРасчетыСПокупателями, ТипДокумента",
		СтруктураОтбор,
		ЭтоРасчетыСПокупателями,
		ТипЗнч(Объект.Ссылка));
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыборДокументаРасчетов", СтруктураПараметры, Элемент);
	
КонецПроцедуры // РасшифровкаПлатежаДокументНачалоВыбора()

// Процедура - обработчик события ОбработкаВыбора поля ввода РасшифровкаПлатежаДокумент.
//
&НаКлиенте
Процедура РасшифровкаПлатежаДокументОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбработатьВыборДокументаРасчетов(ВыбранноеЗначение);
	
КонецПроцедуры

// Процедура заполняет строку ТЧ РасшифровкаПлатежа данными документа расчетов.
//
&НаКлиенте
Процедура ОбработатьВыборДокументаРасчетов(ДанныеДокумента)
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Если ТипЗнч(ДанныеДокумента) = Тип("Структура") Тогда
		
		СтрокаТабличнойЧасти.Документ = ДанныеДокумента.Документ;
		СтрокаТабличнойЧасти.Заказ = ДанныеДокумента.Заказ;
		СтрокаТабличнойЧасти.СчетНаОплату = ДанныеДокумента.СчетНаОплату;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Договор) Тогда
			СтрокаТабличнойЧасти.Договор = ДанныеДокумента.Договор;
			ОбработатьИзменениеДоговораКонтрагента(СтрокаТабличнойЧасти);
		КонецЕсли;
		
		ВыполнитьДействияПриИзмененииДокументаРасчетов();
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработатьВыборДокументаРасчетов()

// Процедура выполняет действия при изменении договора контрагента.
//
&НаКлиенте
Процедура ОбработатьИзменениеДоговораКонтрагента(СтрокаТабличнойЧасти)
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Договор) Тогда
		СтруктураДанные = РасчетыРаботаСФормамиВызовСервера.ПолучитьДанныеРасшифровкаПлатежаДоговорПриИзменении(
			Объект.Дата,
			СтрокаТабличнойЧасти.Договор,
			СтрокаТабличнойЧасти.ДокументПланирования,
			СтрокаТабличнойЧасти.СтатьяДДС);
		СтрокаТабличнойЧасти.Курс = ?(
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс = 0,
			1,
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс);
		СтрокаТабличнойЧасти.Кратность = ?(
			СтруктураДанные.ДоговорВалютаКурсКратность.Кратность = 0,
			1,
			СтруктураДанные.ДоговорВалютаКурсКратность.Кратность);
		
		СтрокаТабличнойЧасти.СтатьяДДС = СтруктураДанные.СтатьяДДСПоУмолчанию;
		СтрокаТабличнойЧасти.СпособЗачета = СтруктураДанные.СпособЗачета;
		СтрокаТабличнойЧасти.СтавкаНДС = РасчетыРаботаСФормамиВызовСервера.СтавкаНДСПоОрганизацииНалогообложениеНДСИСпособуЗаполнения(
			Объект.Организация, Объект.Дата,
			СтруктураДанные.СпособЗаполненияСтавкиНДС);
	Иначе
		СтрокаТабличнойЧасти.СтатьяДДС = РасчетыРаботаСФормамиВызовСервера.ПолучитьСтатьюДДСПоУмолчаниюДляСтрокиРасшифровки(
			СтрокаТабличнойЧасти.Договор,
			СтрокаТабличнойЧасти.ДокументПланирования,
			СтрокаТабличнойЧасти.СтатьяДДС);
		СтрокаТабличнойЧасти.СпособЗачета = РасчетыРаботаСФормамиВызовСервера.СпособРазнесенияОплатыДляДоговора(
			СтрокаТабличнойЧасти.Договор,
			Объект.Контрагент);
	КонецЕсли;
	
	СтрокаТабличнойЧасти.СуммаРасчетов = ВалютыУНФКлиентСервер.Пересчитать(
		СтрокаТабличнойЧасти.СуммаПлатежа,
		Курс,
		СтрокаТабличнойЧасти.Курс,
		Кратность,
		СтрокаТабличнойЧасти.Кратность);
	
	
	СтрокаТабличнойЧасти.ЭтоВзаимозачет = (ТипЗнч(СтрокаТабличнойЧасти.Документ) = Тип("ДокументСсылка.Взаимозачет"));
	
КонецПроцедуры // ОбработатьИзменениеДоговораКонтрагента()

// Процедура определяет признак аванса в зависимости от типа документа расчетов.
//
&НаКлиенте
Процедура ВыполнитьДействияПриИзмененииДокументаРасчетов()
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.ПризнакАванса = НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Документ);
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Документ) Тогда
		СтрокаТабличнойЧасти.СпособЗачета = ПредопределенноеЗначение("Перечисление.СпособыЗачетаИРаспределенияПлатежей.Вручную");
	КонецЕсли;
	
	СтрокаТабличнойЧасти.ЭтоВзаимозачет = (ТипЗнч(СтрокаТабличнойЧасти.Документ) = Тип("ДокументСсылка.Взаимозачет"));
	
	ФормыДокументовДеньгиВызовСервера.ЗаполнитьПодразделениеИзДокументаРасчетов(СтрокаТабличнойЧасти.Подразделение,
		СтрокаТабличнойЧасти.Документ);
		
	СформироватьНазначениеПлатежа();
	
КонецПроцедуры // ВыполнитьДействияПриИзмененииДокументаРасчетов()

&НаСервере
Функция СпособЗаполненияСтавкиНДС()
	Возврат Справочники.ДоговорыКонтрагентов.СпособЗаполненияСтавкиНДСПоДоговору(
		Объект.Договор);
КонецФункции

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаСуммаПлатежа.
// Рассчитывает курс и кратность валюты расчетов и сумму НДС.
//
&НаКлиенте
Процедура РасшифровкаПлатежаСуммаПлатежаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	РасчетыРаботаСФормамиКлиент.РасшифровкаПлатежаСуммаПлатежаПриИзмененииЗавершениеНаКлиенте(СтрокаТабличнойЧасти,
		Объект.Дата, Объект.ВалютаДокумента, СтрокаТабличнойЧасти.Курс, СтрокаТабличнойЧасти.Кратность, СтавкаНДСПоУмолчанию);
	
	ОбновитьСуммыВШапкеДокумента();
		
КонецПроцедуры // РасшифровкаПлатежаСуммаПлатежаПриИзменении()

// Процедура - обработчик события ПриИзменении поля в РасшифровкаПлатежаСуммаРасчетов.
// Рассчитывает сумму платежа.
//
&НаКлиенте
Процедура РасшифровкаПлатежаСуммаРасчетовПриИзменении(Элемент)
	
	РассчитатьСуммуПлатежаНаКлиенте(Элементы.РасшифровкаПлатежа.ТекущиеДанные);
	ОбновитьСуммыВШапкеДокумента();
	
КонецПроцедуры // РасшифровкаПлатежаСуммаРасчетовПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаКурс.
// Рассчитывает сумму платежа.
//
&НаКлиенте
Процедура РасшифровкаПлатежаКурсПриИзменении(Элемент)
	
	РасшифровкаПлатежаКурсПриИзмененииФрагмент(Элементы.РасшифровкаПлатежа.ТекущиеДанные);
	
КонецПроцедуры // РасшифровкаПлатежаКурсПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаКурс.
// Рассчитывает сумму платежа.
//
&НаКлиенте
Процедура РасшифровкаПлатежаКурсПриИзмененииФрагмент(ТекущиеДанные)
	
	Если ТекущиеДанные.СуммаПлатежа = 0 И ТекущиеДанные.СуммаРасчетов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьСуммуПлатежаНаКлиенте(ТекущиеДанные, "Курс");
		
	ОбновитьСуммыВШапкеДокумента();
	
КонецПроцедуры // РасшифровкаПлатежаКурсПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаКратность.
// Рассчитывает сумму платежа.
//
&НаКлиенте
Процедура РасшифровкаПлатежаКратностьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Если ТекущиеДанные.СуммаПлатежа = 0 И ТекущиеДанные.СуммаРасчетов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьСуммуПлатежаНаКлиенте(Элементы.РасшифровкаПлатежа.ТекущиеДанные, "Кратность");
	
	ОбновитьСуммыВШапкеДокумента();
	
КонецПроцедуры // РасшифровкаПлатежаКратностьПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаСтавкаНДС.
// Рассчитывает сумму НДС.
//
&НаКлиенте
Процедура РасшифровкаПлатежаСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	РасчетыРаботаСФормамиКлиент.РассчитатьСуммуНДСНаКлиенте(СтрокаТабличнойЧасти);
	
КонецПроцедуры // РасшифровкаПлатежаСтавкаНДСПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаСчетНаОплату.
//
&НаКлиенте
Процедура РасшифровкаПлатежаСчетНаОплатуПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	РасшифровкаПлатежаСчетНаОплатуПриИзмененииФрагмент(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.СчетНаОплату) Тогда
		
		РассчитатьСуммуПлатежаНаКлиенте(Элементы.РасшифровкаПлатежа.ТекущиеДанные);
		ОбновитьСуммыВШапкеДокумента();
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - фрагмент обработчика события ПриИзменении поля ввода РасшифровкаПлатежаСчетНаОплату.
// Заполняет поле "Заказ" данными документа основания счета на оплату
//
&НаСервере
Процедура РасшифровкаПлатежаСчетНаОплатуПриИзмененииФрагмент(ТекущиеДанныеИдентификатор)
	
	ТекущиеДанные = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(ТекущиеДанныеИдентификатор);
	
	ФормыДокументовДеньгиВызовСервера.ЗаполнитьПодразделениеИзСчетаНаОплату(ТекущиеДанные.Подразделение,
		ТекущиеДанные.СчетНаОплату);
	
	Если Объект.Контрагент.ВестиРасчетыПоЗаказам Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.СчетНаОплату) Тогда
			ТекущиеДанные.СпособЗачета = Перечисления.СпособыЗачетаИРаспределенияПлатежей.Вручную;
			Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Заказ) И
				ТипЗнч(ТекущиеДанные.СчетНаОплату) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") И
				ТипЗнч(ТекущиеДанные.СчетНаОплату.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				ТекущиеДанные.Заказ = ТекущиеДанные.СчетНаОплату.ДокументОснование;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СчетНаОплату) И НЕ ЗначениеЗаполнено(ТекущиеДанные.СуммаПлатежа) Тогда
		ТекущиеДанные.Договор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.СчетНаОплату, "Договор");
		СтруктураДанные = РасчетыРаботаСФормамиВызовСервера.ПолучитьДанныеРасшифровкаПлатежаДоговорПриИзменении(
			Объект.Дата,
			ТекущиеДанные.Договор,,);
			
		ТекущиеДанные.Курс = ?(
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс = 0,
			1,
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс);
			
		ТекущиеДанные.Кратность = ?(
			СтруктураДанные.ДоговорВалютаКурсКратность.Кратность = 0,
			1,
			СтруктураДанные.ДоговорВалютаКурсКратность.Кратность);
		
		ТекущиеДанные.СуммаРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.СчетНаОплату, "СуммаДокумента");
		
	КонецЕсли;
	
	СформироватьНазначениеПлатежа();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаДокументПланирования.
//
&НаКлиенте
Процедура РасшифровкаПлатежаДокументПланированияПриИзменении(Элемент)
	
	ФормыДокументовДеньгиКлиент.ДокументПланированияПриИзменении(ЭтотОбъект, "РасшифровкаПлатежа");
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаСуммаНДС.
//
&НаКлиенте
Процедура РасшифровкаПлатежаСуммаНДСПриИзменении(Элемент)
	
	ОбновитьСуммыВШапкеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаДоговорПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	ОбработатьИзменениеДоговораКонтрагента(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РасчетыРаботаСФормамиКлиент.ОбработатьНачалоВыбораДоговораКонтрагента(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаДоговорСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Владелец", Объект.Контрагент);
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("ВидДоговора", ВидДоговораПриСоздании(Объект.ВидОперации));
	ПараметрыФормы.Вставить("ОповеститьОЗаписиДоговора", Ложь);
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаОбъекта", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаКурсНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РасчетыРаботаСФормамиКлиент.ПредоплатаКурсНачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка,
		"РасшифровкаПлатежа");
	
КонецПроцедуры

#КонецОбласти 


#КонецОбласти 

#Область ВыплатаЗаработнойПлаты

// Процедура - обработчик события ПриИзменении поля ввода ВыплатаЗаработнойПлатыВедомость.
//
&НаКлиенте
Процедура ВыплатаЗаработнойПлатыВедомостьПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ВыплатаЗаработнойПлаты.ТекущиеДанные;
	ПараметрыВедомости = ПолучитьДанныеВыплатаЗаработнойПлатыВедомостьПриИзменении(СтрокаТабличнойЧасти.Ведомость);
	СтрокаТабличнойЧасти.Подразделение = ПараметрыВедомости.Подразделение;
	СтрокаТабличнойЧасти.СуммаПлатежа = ПараметрыВедомости.СуммаПлатежа;
	
КонецПроцедуры // ВыплатаЗаработнойПлатыВедомостьПриИзменении()

&НаКлиенте
Процедура ВыплатаРегламентированнойЗаработнойПлатыВедомостьПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ВыплатаРегламентированнойЗаработнойПлаты.ТекущиеДанные;
	ПараметрыВедомости = ПолучитьДанныеВыплатаРегламентированнойЗаработнойПлатыВедомостьПриИзменении(СтрокаТабличнойЧасти.Ведомость);
	СтрокаТабличнойЧасти.СуммаПлатежа = ПараметрыВедомости.СуммаПлатежа;
	
КонецПроцедуры

// Получает набор данных с сервера для процедуры ВыплатаЗаработнойПлатыВедомостьПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеВыплатаЗаработнойПлатыВедомостьПриИзменении(Ведомость)
	
	ПараметрыВедомости = Новый Структура;
	ПараметрыВедомости.Вставить("Подразделение", Ведомость.СтруктурнаяЕдиница);
	ПараметрыВедомости.Вставить("СуммаПлатежа", Ведомость.Сотрудники.Итог("СуммаПлатежа"));
	
	Возврат ПараметрыВедомости;
	
КонецФункции // ПолучитьДанныеВыплатаЗаработнойПлатыВедомостьПриИзменении()

&НаСервереБезКонтекста
Функция ПолучитьДанныеВыплатаРегламентированнойЗаработнойПлатыВедомостьПриИзменении(Ведомость)
	
	ПараметрыВедомости = Новый Структура;
	ПараметрыВедомости.Вставить("СуммаПлатежа", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ведомость, "СуммаПоДокументу"));
	
	Возврат ПараметрыВедомости;
	
КонецФункции // ПолучитьДанныеВыплатаРегламентированнойЗаработнойПлатыВедомостьПриИзменении()

#КонецОбласти

#Область ПрочийРасход

// Процедура - обработчик события ПриИзменении поля ввода Корреспонденция.
//
&НаКлиенте
Процедура КорреспонденцияПриИзменении(Элемент)
	
	Если Корреспонденция <> Объект.Корреспонденция Тогда
		УстановитьВидимостьРеквизитовВЗависимостиОтКорреспонденции(Истина);
		Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
		Корреспонденция = Объект.Корреспонденция;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ПрочиеРасчеты

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаПрочиеРасчеты.СуммаРасчетов.
//
&НаКлиенте
Процедура РасшифровкаПлатежаПрочиеРасчетыСуммаРасчетовПриИзменении(Элемент)
	
	РассчитатьСуммуПлатежаНаКлиенте(Элементы.РасшифровкаПлатежаПрочиеРасчеты.ТекущиеДанные);
	ОбновитьСуммыВШапкеДокумента();
	
КонецПроцедуры

// Процедура - обработчик события ПередУдалением элемента РасшифровкаПлатежаПрочиеРасчеты (ТЧ).
//
&НаКлиенте
Процедура РасшифровкаПлатежаПрочиеРасчетыПередУдалением(Элемент, Отказ)
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПрочиеРасчетыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.РасшифровкаПлатежаПрочиеРасчеты.ТекущиеДанные;
		Если НЕ Копирование Тогда
			Если ЗначениеЗаполнено(Объект.Договор) Тогда
				ТекущиеДанные.Договор = Объект.Договор;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаПрочиеРасчеты.Курс.
//
&НаКлиенте
Процедура РасшифровкаПлатежаПрочиеРасчетыКурсПриИзменении(Элемент)
		
	РасшифровкаПлатежаКурсПриИзмененииФрагмент(Элементы.РасшифровкаПлатежаПрочиеРасчеты.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПрочиеРасчетыКурсНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РасчетыРаботаСФормамиКлиент.ПредоплатаКурсНачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка, "РасшифровкаПлатежаПрочиеРасчеты");
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаПрочиеРасчеты.Кратность.
//
&НаКлиенте
Процедура РасшифровкаПлатежаПрочиеРасчетыКратностьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РасшифровкаПлатежаПрочиеРасчеты.ТекущиеДанные;
	Если ТекущиеДанные.СуммаПлатежа = 0 И ТекущиеДанные.СуммаРасчетов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьСуммуПлатежаНаКлиенте(Элементы.РасшифровкаПлатежаПрочиеРасчеты.ТекущиеДанные, "Кратность");
	
	ОбновитьСуммыВШапкеДокумента();

	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаПрочиеРасчеты.СуммаПлатежа.
//
&НаКлиенте
Процедура РасшифровкаПлатежаПрочиеРасчетыСуммаПлатежаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежаПрочиеРасчеты.ТекущиеДанные;
	
	РасчетыРаботаСФормамиКлиент.РасшифровкаПлатежаСуммаПлатежаПриИзмененииЗавершениеНаКлиенте(СтрокаТабличнойЧасти,
		Объект.Дата, Объект.ВалютаДокумента, СтрокаТабличнойЧасти.Курс, СтрокаТабличнойЧасти.Кратность, СтавкаНДСПоУмолчанию);
	
	ОбновитьСуммыВШапкеДокумента();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаПрочиеРасчеты.Договор.
//
&НаКлиенте
Процедура РасшифровкаПлатежаПрочиеРасчетыДоговорПриИзменении(Элемент)
	
	ОбработатьИзменениеДоговораКонтрагентаПрочиеРасчеты();
	
КонецПроцедуры

// Процедура выполняет действия при изменении договора контрагента.
//
&НаКлиенте
Процедура ОбработатьИзменениеДоговораКонтрагентаПрочиеРасчеты()
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежаПрочиеРасчеты.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Договор) Тогда
		СтруктураДанные = РасчетыРаботаСФормамиВызовСервера.ПолучитьДанныеРасшифровкаПлатежаДоговорПриИзменении(
			Объект.Дата,
			СтрокаТабличнойЧасти.Договор,
			СтрокаТабличнойЧасти.ДокументПланирования,
			СтрокаТабличнойЧасти.СтатьяДДС);
		СтрокаТабличнойЧасти.Курс = ?(
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс = 0,
			1,
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс);
		СтрокаТабличнойЧасти.Кратность = ?(
			СтруктураДанные.ДоговорВалютаКурсКратность.Кратность = 0,
			1,
			СтруктураДанные.ДоговорВалютаКурсКратность.Кратность);
		
		СтрокаТабличнойЧасти.СтатьяДДС = СтруктураДанные.СтатьяДДСПоУмолчанию;
	Иначе
		СтрокаТабличнойЧасти.СтатьяДДС = Неопределено;
	КонецЕсли;
	
	СтрокаТабличнойЧасти.СуммаРасчетов = ВалютыУНФКлиентСервер.Пересчитать(
		СтрокаТабличнойЧасти.СуммаПлатежа, Курс, СтрокаТабличнойЧасти.Курс, Кратность, СтрокаТабличнойЧасти.Кратность);
	
КонецПроцедуры // ОбработатьИзменениеДоговораКонтрагента()

// Процедура - обработчик события НачалоВыбора поля ввода РасшифровкаПлатежаПрочиеРасчеты.Договор.
//
&НаКлиенте
Процедура РасшифровкаПлатежаПрочиеРасчетыДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.Контрагент.Пустая() Тогда
		СтандартнаяОбработка = Ложь;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Сначала выберите контрагента'");
		Сообщение.Поле = "Объект.Контрагент";
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;
	
	ОбработатьНачалоВыбораДоговораКонтрагентаПрочиеРасчеты(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// Процедура выполняет действия при начале выбора договора контрагента.
//
&НаКлиенте
Процедура ОбработатьНачалоВыбораДоговораКонтрагентаПрочиеРасчеты(Элемент, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежаПрочиеРасчеты.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = ПолучитьПараметрыФормыВыбора(Объект.Ссылка, Объект.Организация, Объект.Контрагент, СтрокаТабличнойЧасти.Договор, Объект.ВидОперации);
	Если ПараметрыФормы.КонтролироватьВыборДоговора Тогда
		
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработатьИзменениеДоговораКонтрагента()

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаПрочиеРасчеты.СтавкаНДС.
//
&НаКлиенте
Процедура РасшифровкаПлатежаПрочиеРасчетыСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежаПрочиеРасчеты.ТекущиеДанные;
	РасчетыРаботаСФормамиКлиент.РассчитатьСуммуНДСНаКлиенте(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПрочиеРасчетыДокументПланированияПриИзменении(Элемент)
	
	ФормыДокументовДеньгиКлиент.ДокументПланированияПриИзменении(ЭтотОбъект, "РасшифровкаПлатежаПрочиеРасчеты");
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.Очистить();
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Оплата") Тогда
		
		СуммаИтог = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
		
		Если СуммаИтог <> 0 И СуммаИтог <> Объект.СуммаДокумента Тогда
			НадписьВСкобках = НСтр("ru = 'разнесено вручную'");
			Элемент.СписокВыбора.Добавить(СуммаИтог, ""+СуммаИтог+" ("+НадписьВСкобках+")");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РасчетыПоКредитам

// Получает договор кредита (займа) по умолчанию в зависимости от вида операции документа.
//
&НаСервереБезКонтекста
Функция ПолучитьДоговорКредитаЗаймаПоУмолчанию(Документ, Контрагент, Организация, ВидОперации)
	
	МенеджерДокумента = Документы.ДоговорКредитаИЗайма;
	
	СписокВидовДоговоров = Новый СписокЗначений;
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКредитаИЗайма.КредитПолученный);
	
	ДоговорКредитаЗаймаПоУмолчанию = МенеджерДокумента.ПолучитьДоговорКредитаИЗаймаПоУмолчаниюПоОрганизацииВидуДоговора(Контрагент, Организация, СписокВидовДоговоров);
	
	Возврат ДоговорКредитаЗаймаПоУмолчанию;
	
КонецФункции


// Процедура - обработчик события ПередУдалением табличной части РасшифровкаПлатежаРасчетыПоКредитам.
//
&НаКлиенте
Процедура РасшифровкаПлатежаРасчетыПоКредитамПередУдалением(Элемент, Отказ)
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаРасчетыПоКредитам.СуммаРасчетов.
//
&НаКлиенте
Процедура РасшифровкаПлатежаРасчетыПоКредитамСуммаРасчетовПриИзменении(Элемент)
	
	РассчитатьСуммуПлатежаНаКлиенте(Элементы.РасшифровкаПлатежаРасчетыПоКредитам.ТекущиеДанные);
	ОбновитьСуммыВШапкеДокумента();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаРасчетыПоКредитам.СуммаРасчетов.
//
&НаКлиенте
Процедура РасшифровкаПлатежаРасчетыПоКредитамКурсПриИзменении(Элемент)
	
		РассчитатьСуммуПлатежаНаКлиенте(Элементы.РасшифровкаПлатежаРасчетыПоКредитам.ТекущиеДанные);
	ОбновитьСуммыВШапкеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаРасчетыПоКредитамКурсНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РасчетыРаботаСФормамиКлиент.ПредоплатаКурсНачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка, "РасшифровкаПлатежаРасчетыПоКредитам");
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаРасчетыПоКредитам.Кратность.
//
&НаКлиенте
Процедура РасшифровкаПлатежаРасчетыПоКредитамКратностьПриИзменении(Элемент)
	
	РассчитатьСуммуПлатежаНаКлиенте(Элементы.РасшифровкаПлатежаРасчетыПоКредитам.ТекущиеДанные);
	ОбновитьСуммыВШапкеДокумента();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаРасчетыПоКредитам.СуммаПлатежа.
//
&НаКлиенте
Процедура РасшифровкаПлатежаРасчетыПоКредитамСуммаПлатежаПриИзменении(Элемент)
	
	РассчитатьСуммуПлатежаНаКлиенте(Элементы.РасшифровкаПлатежаРасчетыПоКредитам.ТекущиеДанные);
	ОбновитьСуммыВШапкеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаРасчетыПоКредитамДокументПланированияПриИзменении(Элемент)
	
	ФормыДокументовДеньгиКлиент.ДокументПланированияПриИзменении(ЭтотОбъект, "РасшифровкаПлатежаРасчетыПоКредитам");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплатаЗаработнойПлатыСчетНаОплатуПриИзменении(Элемент)
	
	ФормыДокументовДеньгиКлиент.ДокументПланированияПриИзменении(ЭтотОбъект, "ВыплатаЗаработнойПлаты");
	
КонецПроцедуры

#КонецОбласти

#Область ДиректБанк

&НаКлиенте
Процедура СостояниеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСБанкамиКлиент.ОткрытьАктуальныйЭД(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваПоляСостояние(Форма)
	
	НастроитьПолеСостояние(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьПолеСостояние(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	Если Форма.ТолькоПросмотр
		ИЛИ НЕ ЗначениеЗаполнено(Объект.Организация)
		ИЛИ НЕ ЗначениеЗаполнено(Объект.БанковскийСчет) Тогда
		Элементы.Состояние.ТолькоПросмотр = Истина;
		Элементы.Состояние.КнопкаОткрытия = Ложь;
	Иначе
		Если НЕ Форма.ПодключенаИнтеграцияСБанком Тогда
			СписокВыбора = Новый Массив;
			ЕстьНастройкаДиректБанк = Ложь;
			НастройкаДиректБанк(ЕстьНастройкаДиректБанк, Объект.Организация, Объект.БанковскийСчет, СписокВыбора);
			Элементы.Состояние.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
			Элементы.Состояние.ТолькоПросмотр = ЕстьНастройкаДиректБанк;
			Элементы.Состояние.КнопкаОткрытия = ЕстьНастройкаДиректБанк;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура НастройкаДиректБанк(ЕстьНастройкаДиректБанк, Знач Организация, Знач БанковскийСчет, СписокВыбора)
	
	Банк = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанковскийСчет, "Банк");
	
	ЕстьНастройкаДиректБанк = ОбменСБанками.НастройкаОбмена(Организация, Банк) <> Неопределено;
	
	СписокВыбора.Добавить(Перечисления.СостоянияБанковскихДокументов.Подготовлено);
	СписокВыбора.Добавить(Перечисления.СостоянияБанковскихДокументов.Отправлено);
	СписокВыбора.Добавить(Перечисления.СостоянияБанковскихДокументов.Оплачено);
	СписокВыбора.Добавить(Перечисления.СостоянияБанковскихДокументов.Отклонено);
	Если ЕстьНастройкаДиректБанк Тогда
		
		СписокВыбора.Добавить(Перечисления.СостоянияБанковскихДокументов.НаПодписи);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСостояниеОбмена(Ссылка)
	
	Возврат РегистрыСведений.СостоянияБанковскихДокументов.ТекущееСостояниеДокумента(Ссылка);
	
КонецФункции

&НаКлиенте
Процедура НазначениеПлатежаРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.СчетКонтрагента.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ключ", Объект.СчетКонтрагента);
	СтруктураПараметров.Вставить("НеобходимаОтметкаНазначениеПлатежа", Истина);
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеЗаполненияНазначенияВСчетеКонтрагента", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.БанковскиеСчета.Форма.ФормаЭлемента", СтруктураПараметров, ЭтотОбъект, , , ,
		ОписаниеОповещенияОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаполненияНазначенияВСчетеКонтрагента(Параметры, ДополнительныеПараметры) Экспорт
	
	СформироватьНазначениеПлатежа();
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти


#Область СовместноеИспользование
&НаКлиенте
Процедура Подключаемый_ИнформационнаяПанельСовместногоИспользованияОбработкаНавигационнойСсылки(Источник, НавигационнаяСсылка, СтандартнаяОбработка)
	
	ОписаниеКонтекста = СовместноеИспользованиеКлиентСервер.КонтекстОбработкиСобытия(ЭтотОбъект, Объект);
	СовместноеИспользованиеКлиент.ОбработкаНавигационнойСсылкиИнформационнойПанели(ОписаниеКонтекста, Источник, НавигационнаяСсылка, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ИнформационнаяПанельСовместногоИспользованияЗавершениеДействия(Результат, ДополнительныеПараметры) Экспорт
	
	Подключаемый_ИнформационнаяПанельСовместногоИспользованияЗавершениеДействияНаСервере(Результат, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ИнформационнаяПанельСовместногоИспользованияЗавершениеДействияНаСервере(Результат, ДополнительныеПараметры)
	
	ОписаниеКонтекста = СовместноеИспользованиеКлиентСервер.КонтекстОбработкиСобытия(ЭтотОбъект, Объект);
	СовместноеИспользование.ОбновитьИнформационнуюПанель(ОписаниеКонтекста);
	
КонецПроцедуры
#КонецОбласти     

