#Область ПрограммныйИнтерфейс

// См. ИнтеграцияУРМКПереопределяемый.ПриИзмененииОбщихПараметров.
//
Процедура ПриИзмененииОбщихПараметров(ОбщиеПараметры, ИмяПараметра) Экспорт
	
	Если ИмяПараметра = "ТорговыйОбъект"
		И ЗначениеЗаполнено(ОбщиеПараметры.ТорговыйОбъект) Тогда
		ОбщиеПараметры.ВидЦен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбщиеПараметры.ТорговыйОбъект, "РозничныйВидЦен");
	КонецЕсли;
	
КонецПроцедуры

// См. ИнтеграцияУРМКПереопределяемый.ПланОбменаУРМК.
//
Процедура ПланОбменаУРМК(ПланыОбменаXDTO) Экспорт
	ПланыОбменаXDTO.Добавить(Метаданные.ПланыОбмена.ОбменСУРМК);
КонецПроцедуры

// См. ИнтеграцияУРМКПереопределяемый.ТорговыйОбъектУРМКПоУмолчанию.
//
Процедура ТорговыйОбъектУРМКПоУмолчанию(ТорговыйОбъект) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("УчетПоНесколькимСкладам") Тогда
		ТорговыйОбъект = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
	КонецЕсли;
	
КонецПроцедуры

// См. ИнтеграцияУРМКПереопределяемый.УстановитьПараметрыВыбораКассыККМ.
//
Процедура УстановитьПараметрыВыбораКассыККМ(Форма, ИмяПоляВвода) Экспорт
	
	ПараметрыВыбора = ОбщегоНазначения.СкопироватьРекурсивно(Форма.Элементы[ИмяПоляВвода].ПараметрыВыбора, Ложь);
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипКассы", Перечисления.ТипыКассККМ.ККМED);
	ПараметрыВыбора.Добавить(НовыйПараметр);
	
	Форма.Элементы[ИмяПоляВвода].ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	
КонецПроцедуры

// См. ИнтеграцияУРМКПереопределяемый.УстановитьПараметрыВыбораТорговыйОбъект.
//
Процедура УстановитьПараметрыВыбораТорговыйОбъект(Форма, ИмяПоляВвода) Экспорт
	
	ПараметрыВыбора = ОбщегоНазначения.СкопироватьРекурсивно(Форма.Элементы[ИмяПоляВвода].ПараметрыВыбора, Ложь);
	
	ЗначениеМассив		= Новый Массив;
	ЗначениеМассив.Добавить(Перечисления.ТипыСтруктурныхЕдиниц.Розница);
	ЗначениеМассив.Добавить(Перечисления.ТипыСтруктурныхЕдиниц.Склад);
	
	ЗначениеПараметра	= Новый ФиксированныйМассив(ЗначениеМассив);
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСтруктурнойЕдиницы", ЗначениеПараметра);
	ПараметрыВыбора.Добавить(НовыйПараметр);
	
	Форма.Элементы[ИмяПоляВвода].ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	
КонецПроцедуры

// См. ИнтеграцияУРМКПереопределяемый.УстановитьОтборПоТипуКассыККМ.
//
Процедура УстановитьОтборПоТипуКассыККМ(Список) Экспорт
	
	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы,,
	                                                                        ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ГруппаОтбора,
		"ТипКассы",
		ВидСравненияКомпоновкиДанных.Равно,
		ПредопределенноеЗначение("Перечисление.ТипыКассККМ.ККМED"),
		,
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
КонецПроцедуры

// См. ИнтеграцияУРМКПереопределяемый.ПараметрыЗаполненияПередНачаломДобавленияУРМК.
//
Функция ПараметрыЗаполненияПередНачаломДобавленияУРМК(Форма, СтруктураПараметров) Экспорт
	
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ТипКассы", 			ПредопределенноеЗначение("Перечисление.ТипыКассККМ.ККМED"));
	ПараметрыЗаполнения.Вставить("СтруктурнаяЕдиница",	Форма.ТорговыйОбъект);
	
	Если СтруктураПараметров.Свойство("ОбъектКопирования") Тогда
		ПараметрыЗаполнения.Вставить("Владелец",
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураПараметров.ОбъектКопирования, "Владелец"));
	КонецЕсли;
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

// См. ИнтеграцияУРМКПереопределяемый.ОтборыТекстаЗапросовПодготовитьДанныеНастроекОбмена.
//
Функция ОтборыТекстаЗапросовПодготовитьДанныеНастроекОбмена() Экспорт
	
	ТекстЗапроса = "И КассыККМ.ТипКассы = ЗНАЧЕНИЕ(Перечисление.ТипыКассККМ.ККМED)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

