////////////////////////////////////////////////////////////////////////////////
// ЕдиныйНалоговыйСчетЛичныйКабинетПереопределяемый
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОсновнаяОрганизация(ТекущаяОрганизация) Экспорт
	
КонецПроцедуры

Процедура ГоловнаяОрганизация(ТекущаяОрганизация) Экспорт
	
КонецПроцедуры

Процедура ДоступныеОрганизации(ТаблицаОрганизация) Экспорт
	
КонецПроцедуры

Процедура ОсновнаяРегистрацияВНалоговомОргане(Организация, ТекущаяРегистрация) Экспорт
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

Процедура ПодготовитьФормуНаСервере(Форма) Экспорт
	
КонецПроцедуры

Процедура УправлениеФормой(Форма) Экспорт
	
КонецПроцедуры

Процедура УстановитьУсловноеОформление(Форма) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандПлатежиРасхождение(Форма) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандОтчетыРасхождение(Форма) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандНачисленияРасхождение(Форма) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандПениШтрафыРасхождение(Форма) Экспорт
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверки(Признак) Экспорт
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиПлатежи(Признак) Экспорт
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиОтчеты(Признак) Экспорт
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиНачисления(Признак) Экспорт
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиПениШтрафы(Признак) Экспорт
	
КонецПроцедуры

Процедура ПоддерживаетсяАвтоматическаяРегистрацияУплат(Признак) Экспорт
	
КонецПроцедуры

Процедура ПериодОбработкиДанныхДляРегистрацииУплат(Организация, НачалоПериода, КонецПериода) Экспорт
	
КонецПроцедуры

Процедура ДоступноОтражениеВУчетеНачислений(Признак) Экспорт
	
КонецПроцедуры

Процедура ДоступноОтражениеВУчетеПениШтрафов(Признак) Экспорт
	
КонецПроцедуры

Процедура ОтражениеВУчетеДоступноСтрокаНачисления(ДанныеСтроки, Признак) Экспорт
	
КонецПроцедуры

Процедура ОтражениеВУчетеДоступноСтрокаПениШтрафы(ДанныеСтроки, Признак) Экспорт
	
КонецПроцедуры

#КонецОбласти
