#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечать);
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПодключаемоеОборудование
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	Если ИспользоватьПодключаемоеОборудование Тогда
		ТипыОборудования = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
		ТипыОборудования.СканерШтрихкода = Истина;
		МенеджерОборудования.ПриСозданииНаСервере(ЭтотОбъект, ТипыОборудования);
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	// СовместноеИспользование
	ОписаниеКонтекста = СовместноеИспользованиеКлиентСервер.КонтекстОбработкиСобытия(ЭтотОбъект, Объект);
	СовместноеИспользование.ПриСозданииНаСервере(ОписаниеКонтекста, Элементы.ИнформационнаяПанельСовместногоИспользования);
	// Конец СовместноеИспользование

	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если Не ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Пользователь = Пользователи.ТекущийПользователь();
	
	РезервированиеЗапасов = ПолучитьФункциональнуюОпцию("РезервированиеЗапасов");
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПоложениеСчетФактурыНаФорме = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ПоложениеСчетФактурыНаФорме");
		Объект.СчетФактураВТабличнойЧастиДокумента = ПоложениеСчетФактурыНаФорме = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
		
		Объект.НеПодбиратьВОснованиеСчетФактурыТабличныхЧастей = Истина;
		
		ДокументыУНФ.ПолучитьНастройкиБыстрыхФорм(ЭтотОбъект);
		
	КонецЕсли;
	
	ДоступенОрдерныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьОрдерныйСклад");
	
	Компания = Константы.УчетПоКомпании.Компания(Объект.Организация);
	ИспользоватьПроекты = ПолучитьФункциональнуюОпцию("УчетПоПроектам");
	
	КэшЗначений = Новый Структура;
	КэшЗначений.Вставить("ВерсияПодчиненногоСчетФактуры", Неопределено);
	КэшЗначений.Вставить("МодифицированностьФормы", Ложь);
	
	НаборСвойств_Документ_АвансовыйОтчет = УправлениеСвойствами.НаборСвойствПоИмени("Документ_АвансовыйОтчет");
	КэшЗначений.Вставить("НаборСвойств_Документ_АвансовыйОтчет", НаборСвойств_Документ_АвансовыйОтчет);
	
	// Установить надписи счет-фактура и основание
	СчетФактураСсылка = СчетаФактурыУНФ.ПолучитьПодчиненныйСчетФактуру(Объект.Ссылка, Истина);
	Элементы.СчетФактураНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьСчетФактура(СчетФактураСсылка, Истина);
	КэшЗначений.Вставить("СчетФактураСсылка", ?(ТипЗнч(СчетФактураСсылка) = Тип("Структура"), СчетФактураСсылка.Ссылка, Неопределено));

	// АвторегистрацияЦен
	ЗначенияРеквизитовДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.СчетФактураДоговорКонтрагента, 
		"АвтоматическиРегистрироватьЦены, ВидЦенКонтрагента");
	
	КэшЗначений.Вставить("УчетЦенКонтрагентов", ПолучитьФункциональнуюОпцию("УчетЦенКонтрагентов"));
	
	АвтоРегистрацияЦенПоставщика = ЗначенияРеквизитовДоговора.АвтоматическиРегистрироватьЦены;
	ВидЦенКонтрагентаДоговора = ЗначенияРеквизитовДоговора.ВидЦенКонтрагента; 

	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ЗаполнитьПризнакРегистрацииЦенПоставщика();
	КонецЕсли;
   // Конец АвторегистрацияЦен
   
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка)
		И НЕ ЗначениеЗаполнено(Параметры.Основание) 
		И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ЗаполнитьСтавкуНДСПоНалогообложениеНДС();
		НалогиУНФ.ЗаполнитьНДСВключенВСтоимостьВДокументе(Объект);
	Иначе
		УстановитьВидимостьПоНалогообложению();
	КонецЕсли;
	
	// Сформируем надпись цены и валюты.
	УчетВалютныхОпераций = Константы.ФункциональнаяУчетВалютныхОпераций.Получить();
	ПоляНадписи = Новый Структура;
	ПоляНадписи.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	ПоляНадписи.Вставить("Курс", Объект.Курс);
	ПоляНадписи.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	ПоляНадписи.Вставить("УчетВалютныхОпераций", УчетВалютныхОпераций);
	ПоляНадписи.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	ВалютаДокумента = СформироватьНадписьЦеныИВалюта(ПоляНадписи);
	
	ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнойСклад");
	ОсновнойСклад = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
	
	ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновноеПодразделение");
	ОсновноеПодразделение = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
	
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
	
	Элементы.ЗапасыЗапасыПодбор.Видимость = ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.Запасы);
	Элементы.РасходыРасходыПодбор.Видимость = ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.Запасы);
	
	// Надпись для документа-основания
	Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Объект.ДокументОснование);
	
	// Заполнение дополнительных реквизитов табличной части.
	УстановитьВидимостьРеквизитовРасчетов();
		
	// КопированиеСтрокТабличныхЧастей
	КопированиеТабличнойЧастиСервер.ПриСозданииНаСевере(Элементы, "Запасы");
	КопированиеТабличнойЧастиСервер.ПриСозданииНаСевере(Элементы, "Расходы");
	
	// ГрупповоеИзменениеСтрок
	ЗаполнитьСписокДействий("Запасы");
	ГрупповоеИзменениеСтрокСервер.ПриСозданииНаСервере(НаборЭлементовГрупповогоИзмененияСтрокСервер("Запасы"), ЭтотОбъект.ЗапасыИзменениеСтрокДействие);
	ЗапасыИзменениеСтрокДействиеПриОткрытии = ЗапасыИзменениеСтрокДействие;
	УстановитьПометку("Запасы", Истина);
	
	ЗаполнитьСписокДействий("Расходы");
	ГрупповоеИзменениеСтрокСервер.ПриСозданииНаСервере(НаборЭлементовГрупповогоИзмененияСтрокСервер("Расходы"), ЭтотОбъект.РасходыИзменениеСтрокДействие);
	РасходыИзменениеСтрокДействиеПриОткрытии = РасходыИзменениеСтрокДействие;
	УстановитьПометку("Расходы", Истина);
	// Конец ГрупповоеИзменениеСтрок
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	// ПодключаемоеОборудование
	МенеджерОборудованияУНФ.УстановитьВидимостьЭлементовПоДоступномуПодключаемомуОборудованию(Элементы,
		"ЗапасыЗагрузитьДанныеИзТСД",
		"ЗапасыПолучитьВес");
	// Конец ПодключаемоеОборудование
	
	ОпределитьВидимостьНастроекУчетаВНалогообложении();
	
	// Характеристики
	НоменклатураВДокументахСервер.ОбновитьУсловноеОформлениеТабличнойЧастиДляХарактеристик(ЭтотОбъект);
	
	ПоказыватьКолонкуСодержаниеВАвансовомОтчетеЗапасы = 
		УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь,
			"ПоказыватьКолонкуСодержаниеВАвансовомОтчетеЗапасы");

	ПоказыватьКолонкуСодержаниеВАвансовомОтчетеРасходы = 
		УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь,
			"ПоказыватьКолонкуСодержаниеВАвансовомОтчетеРасходы");
	
	ДополнитьУсловноеОформлениеФормы();
	УстановитьВидимостьОтПользовательскихНастроек(ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая()
		Тогда
		НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект, Истина)
	КонецЕсли;
	
	МобильныйКлиентУНФ.НастроитьФормуОбъектаМобильныйКлиент(Элементы);
	
	НоменклатураВДокументахКлиентСервер.ЗаполнитьТаблицуНастроекФормыВыбораНоменклатуры(ЭтотОбъект, "АвансовыйОтчет",
		НастройкиФормыВыбораНоменклатуры, Истина, "Запасы");
	НоменклатураВДокументахКлиентСервер.ЗаполнитьТаблицуНастроекФормыВыбораНоменклатуры(ЭтотОбъект, "АвансовыйОтчет",
		НастройкиФормыВыбораНоменклатуры, Истина, "Расходы");
	НоменклатураВДокументахКлиентСервер.ОбновитьПараметрыОткрытияФормыВыбора(ЭтотОбъект, "Запасы");
	НоменклатураВДокументахКлиентСервер.ОбновитьПараметрыОткрытияФормыВыбора(ЭтотОбъект, "Расходы");
	
	СтруктураВыбораНоменклатуры = Новый Структура("Характеристика, Партия");
	
	НастройкиКоличества = ПолучитьНастройкиИзмененияКоличества();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиКоличества);
		
	УстановитьВидимостьКолонкиДокументаПоступления(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
	// ГрупповоеИзменениеСтрок
	ОпределитьОбъектИзменений("Запасы");
	ОпределитьОбъектИзменений("Расходы");
	// Конец ГрупповоеИзменениеСтрок
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
	Если НЕ ЗавершениеРаботы Тогда
		
		// ГрупповоеИзменениеСтрок
		СохранитьТекущееДействиеИзмененияСтрок();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			Данные = МенеджерОборудованияУНФКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр);
			ПолученыШтрихкоды(Данные);
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	Если ИмяСобытия = "ОбновлениеТекстаПроСчетФактуруПолученный" Тогда
		
		ПредставлениеЗаголовка = РаботаСФормойДокументаКлиент.ПредставлениеЗаголовкаПодчиненногоСчетаФактуры(
			Объект.Ссылка, Источник, Параметр, КэшЗначений);
		Если ПредставлениеЗаголовка <> Неопределено Тогда

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СчетФактураНадпись", "Заголовок",
				ПредставлениеЗаголовка);
				
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСчетФактураНомерДата", "Видимость", Ложь);
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Запись_Контрагент" 
		И ЗначениеЗаполнено(Параметр) Тогда
			
		Для каждого ТекСтрока Из Объект.Оплаты Цикл
			
			Если Параметр = ТекСтрока.Контрагент Тогда
				
				УстановитьВидимостьРеквизитовРасчетов();
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
			
	ИначеЕсли ИмяСобытия = "ПодборПроизведен" 
		И ЗначениеЗаполнено(Параметр) 
		// Проверка на владельца формы
		И Источник <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")
		И Источник = УникальныйИдентификатор
		Тогда
			
		АдресЗапасовВХранилище	= Параметр;
		ТекущаяСтраницыЗапасы	= (Элементы.Страницы.ТекущаяСтраница = Элементы.Товары);
		ИмяТабличнойЧасти		= ?(ТекущаяСтраницыЗапасы, "Запасы", "Расходы");

		Если ЗапрашиватьОбъединениеСтрок Тогда
			
			МассивНомеровИдентичныхСтрок = НомераИдентичныхСтрокВТабличнойЧасти(АдресЗапасовВХранилище, ИмяТабличнойЧасти);
			
			Если МассивНомеровИдентичныхСтрок.Количество() Тогда
				ДопПараметр = Новый Структура("ЭтоПодбор, АдресЗапасовВХранилище", Истина, АдресЗапасовВХранилище);
				Оповещение = Новый ОписаниеОповещения("ЗапасыПодтверждениеСбросаКоличестваЗавершение", ЭтотОбъект, ДопПараметр);
				ОткрытьФорму("ОбщаяФорма.ПодтверждениеОбъединенияСтрокПриДобавленииВТабличнуюЧасть", , , , , , Оповещение);
				
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
		МассивНомеровИдентичныхСтрок = Новый Массив;
		ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, ИмяТабличнойЧасти, ТекущаяСтраницыЗапасы, ТекущаяСтраницыЗапасы, МассивНомеровИдентичныхСтрок);
		
		Для Каждого НомерСтроки Из МассивНомеровИдентичныхСтрок Цикл
			
			СтрокаТабличнойЧасти = Объект[ИмяТабличнойЧасти][НомерСтроки];
			РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// КопированиеСтрокТабличныхЧастей
	Если ИмяСобытия = "БуферОбменаТабличнаяЧастьКопированиеСтрок" Тогда
		КопированиеТабличнойЧастиКлиент.ОбработкаОповещения(Элементы, "Запасы");
		КопированиеТабличнойЧастиКлиент.ОбработкаОповещения(Элементы, "Расходы");
	КонецЕсли;
	
	// Обсуждения
	ОбсужденияУНФКлиент.ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтотОбъект, Объект.Ссылка);
	// Конец Обсуждения
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	// СовместноеИспользование
	ОписаниеКонтекста = СовместноеИспользованиеКлиентСервер.КонтекстОбработкиСобытия(ЭтотОбъект, Объект);
	СовместноеИспользование.ОбновитьИнформационнуюПанель(ОписаниеКонтекста);
	// Конец СовместноеИспользование
	
	ДоступенОрдерныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьОрдерныйСклад");
	
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
	
	СтруктураВыбораНоменклатуры = Новый Структура("Характеристика, Партия");
	
	УстановитьВидимостьКолонкиДокументаПоступления(ЭтотОбъект);
	
	ДокументыУНФ.ПолучитьНастройкиБыстрыхФорм(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОценкаПроизводительностиКлиент.ЗамерВремени("Проведение"
			+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ЭтотОбъект.ИмяФормы));
	КонецЕсли;
	// СтандартныеПодсистемы.ОценкаПроизводительности
	
	КэшЗначений.МодифицированностьФормы = Модифицированность;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		НоменклатураВДокументахКлиент.ПроверитьТабличнуюЧастьНаЗапретДробныхЗначений(Объект,, Отказ);
	Иначе
		НоменклатураВДокументахКлиент.ПроверитьТабличнуюЧастьНаЗапретДробныхЗначений(Объект);
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		НоменклатураВДокументахКлиент.ПроверитьТабличнуюЧастьНаЗапретДробныхЗначений(Объект, "Расходы", Отказ);
	Иначе
		НоменклатураВДокументахКлиент.ПроверитьТабличнуюЧастьНаЗапретДробныхЗначений(Объект, "Расходы");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Обсуждения
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Модифицированность",Модифицированность);
	// Конец Обсуждения
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если Объект.Оплаты.Количество() > 0 Тогда
			
			ТекстСообщения = "";
			Справочники.ДоговорыКонтрагентов.ПроверитьСоответствиеДоговораУсловиямДокумента(
				ТекстСообщения,
				,
				Объект.Ссылка,
				Объект.Организация,
				Объект.Оплаты[0].Контрагент,
				Отказ,
				,
				Объект.Оплаты);
			
			Если ТекстСообщения <> "" Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Если Отказ Тогда
					Сообщение.Текст = СтрШаблон(НСтр("ru = 'Документ не проведен. %1'"), ТекстСообщения);
				Иначе
					Сообщение.Текст = ТекстСообщения;
				КонецЕсли;
				Сообщение.Сообщить();
				
				Если Отказ Тогда
					Возврат;
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
		
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Заполнение дополнительных реквизитов табличной части.
	УстановитьВидимостьРеквизитовРасчетов();
	
	ТекущийОбъект.ДополнительныеСвойства.Свойство("ВерсияПодчиненногоСчетФактуры", КэшЗначений.ВерсияПодчиненногоСчетФактуры);
	
	// ГрупповоеИзменениеСтрок
	Если Элементы.ГруппаЗапасыИзменениеСтрок.Видимость Тогда
		УстановитьПометку("Запасы", Истина);
	КонецЕсли;
	Если Элементы.ГруппаРасходыИзменениеСтрок.Видимость Тогда
		УстановитьПометку("Расходы", Истина);
	КонецЕсли;
	// Конец ГрупповоеИзменениеСтрок
	
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
	
	//Обсуждения
	ОбсужденияУНФ.ПослеЗаписиНаСервере(ТекущийОбъект);	
	// Конец Обсуждения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СовместноеИспользование
	ОписаниеКонтекста = СовместноеИспользованиеКлиентСервер.КонтекстОбработкиСобытия(ЭтотОбъект, Объект);
	СовместноеИспользование.ПослеЗаписиНаСервере(ОписаниеКонтекста);
	// Конец СовместноеИспользование
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	// Оповещение об оплате.
	ОповеститьОбОплатеСчета = Ложь;
	ОповеститьОбОплатеЗаказа = Ложь;
	
	Для каждого ТекСтрока Из Объект.Оплаты Цикл
		ОповеститьОбОплатеСчета = ?(
			ОповеститьОбОплатеСчета,
			ОповеститьОбОплатеСчета,
			ЗначениеЗаполнено(ТекСтрока.СчетНаОплату));
		ОповеститьОбОплатеЗаказа = ?(
			ОповеститьОбОплатеЗаказа,
			ОповеститьОбОплатеЗаказа,
			ЗначениеЗаполнено(ТекСтрока.Заказ));
	КонецЦикла;
	
	Если ОповеститьОбОплатеСчета Тогда
		ОповеститьОбИзменении(Тип("ДокументСсылка.СчетНаОплатуПоставщика"));
	КонецЕсли;
	
	Если ОповеститьОбОплатеЗаказа Тогда
		Оповестить("ОповещениеОбОплатеЗаказа");
	КонецЕсли;
	
	Если КэшЗначений.МодифицированностьФормы = Истина
		И КэшЗначений.ВерсияПодчиненногоСчетФактуры = "1.6.11" Тогда
		
		ТекстВопроса = НСтр("ru = 'В накладную были внесены изменения.
			|Требуется самостоятельно поправить подчиненный документ счет-фактура'");
		
		ПоказатьПредупреждение(, ТекстВопроса, 0, НСтр("ru ='Счет-фактура'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДанныеДляИзмененияДаты = ДокументыУНФКлиент.ДанныеДляИзмененияДаты(ЭтотОбъект, Объект);
	Если ДанныеДляИзмененияДаты.ДатаНеМенялась Тогда
		Возврат;
	КонецЕсли;
	
	ДатаПриИзмененииНаСервере(ДанныеДляИзмененияДаты);
		
	Если ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		ПересчитатьКурсКратностьВалютыДокумента(ДанныеДляИзмененияДаты);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьВалютуДокумента(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьИзмененияПоКнопкеРедактироватьВалюту();
	Модифицированность = Истина;
	
КонецПроцедуры // РедактироватьВалютуДокумента()

&НаКлиенте
Процедура ДекорацияРеквизитыПечатиНажатие(Элемент)
	
	ОткрытьФормуРеквизитыПечати();
	
КонецПроцедуры

// Процедура устанавливает видимость реквизитов расчетов в зависимости от установленных контрагенту параметров.
//
&НаСервере
Процедура УстановитьВидимостьРеквизитовРасчетов(Знач ВестиРасчетыПоДоговорам = Ложь,
	Знач ВестиРасчетыПоДокументам = Ложь, Знач ВестиРасчетыПоЗаказам = Ложь, Знач ВестиУчетОплатыПоСчетам = Ложь)
	
	ЗаполнитьСлужебныеРеквизитыПоКонтрагентуВКоллекции(Объект.Оплаты);
	
	Для каждого ТекСтрока Из Объект.Оплаты Цикл
		Если ТекСтрока.ВестиРасчетыПоДоговорам Тогда
			ВестиРасчетыПоДоговорам = Истина;
		КонецЕсли;
		Если ТекСтрока.ВестиРасчетыПоДокументам Тогда
			ВестиРасчетыПоДокументам = Истина;
		КонецЕсли;
		Если ТекСтрока.ВестиРасчетыПоЗаказам Тогда
			ВестиРасчетыПоЗаказам = Истина;
		КонецЕсли;
		Если ТекСтрока.ВестиУчетОплатыПоСчетам Тогда
			ВестиУчетОплатыПоСчетам = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ОплатыДоговор.Видимость = ВестиРасчетыПоДоговорам;
	Элементы.ОплатыДокумент.Видимость = ВестиРасчетыПоДокументам;
	Элементы.ОплатыЗаказ.Видимость = ВестиРасчетыПоЗаказам;
	Элементы.ОплатыСчетНаОплату.Видимость = ВестиУчетОплатыПоСчетам;
	
КонецПроцедуры // УстановитьВидимостьРеквизитовРасчетов()

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
		
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "удалить" Тогда
		Объект.ДокументОснование = Неопределено;
		Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Неопределено);
		Модифицированность = Истина;
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "заполнить" Тогда
		ЗаполнитьПоОснованиюНачало();
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "выбрать" Тогда
		// Выбрать основание
		СписокОснований = Новый СписокЗначений;
		СписокОснований.Добавить("Документ.РасходСоСчета.ФормаВыбора", НСтр("ru = 'Расход со счета'"));
		СписокОснований.Добавить("Документ.РасходИзКассы.ФормаВыбора", НСтр("ru = 'Расход из кассы'"));
		Если УправлениеНебольшойФирмойВызовСервера.ПолучитьФункциональнуюОпциюСервер("ИспользоватьОрдерныйСклад") Тогда
			СписокОснований.Добавить("Документ.ПриходныйОрдер.ФормаВыбора", НСтр("ru = 'Приходный ордер'"));
		КонецЕсли;
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборТипаОснованияЗавершение", ЭтотОбъект);
		ПоказатьВыборИзМеню(ОписаниеОповещения, СписокОснований, Элементы.ДокументОснованиеНадпись);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "открыть" Тогда
		
		РаботаСФормойДокументаКлиент.ОткрытьФормуДокументаПоСсылке(Объект.ДокументОснование);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетФактураНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	СчетФактураСсылка = ПолучитьПодчиненныйСчетФактуру();
	
	Если Не ЗначениеЗаполнено(СчетФактураСсылка) Тогда
		
	РеквизитыЗаполнены = Истина;	
		
		Если Не ЗначениеЗаполнено(СчетФактураНомер) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Не заполнен номер счет-фактуры.'");
			Сообщение.Поле = "СчетФактураНомер";
			Сообщение.Сообщить();
			
			РеквизитыЗаполнены = Ложь;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.СчетФактураДатаВыставления) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Не заполнена дата счет-фактуры.'");
			Сообщение.Поле = "Объект.СчетФактураДатаВыставления";
			Сообщение.Сообщить();
			
			РеквизитыЗаполнены = Ложь;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.СчетФактураКонтрагент) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Не заполнен контрагент.'");
			Сообщение.Поле = "Объект.СчетФактураКонтрагент";
			Сообщение.Сообщить();
			
			РеквизитыЗаполнены = Ложь;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.СчетФактураДоговорКонтрагента) И Элементы.СчетФактураДоговорКонтрагента.Видимость Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Не заполнен договор контрагента.'");
			Сообщение.Поле = "Объект.СчетФактураДоговорКонтрагента";
			Сообщение.Сообщить();
			
			РеквизитыЗаполнены = Ложь;
			
		КонецЕсли;
		
		Если Не РеквизитыЗаполнены Тогда
			Возврат
		КонецЕсли;
		
	КонецЕсли;
	
	СчетаФактурыУНФКлиент.ОткрытьСчетФактуру(ЭтотОбъект, Истина);;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборТипаОснованияЗавершение(ВыбранноеИмяФормы, Параметры) Экспорт

	Если ВыбранноеИмяФормы <> Неопределено Тогда
		ПараметрыОтбора = Новый Структура("Отбор", Новый Структура("Контрагент, Договор", Контрагент, Договор));
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыбратьОснованиеЗавершение", ЭтотОбъект);
		ОткрытьФорму(ВыбранноеИмяФормы.Значение, ПараметрыОтбора, ЭтотОбъект, , , , ОповещениеОЗакрытии);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОснованиеЗавершение(ВыбранноеЗначение, Параметры) Экспорт

	Если ВыбранноеЗначение <> Неопределено Тогда
		Объект.ДокументОснование = ВыбранноеЗначение;
		Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(
			ВыбранноеЗначение);
		Модифицированность = Истина;

		ЗаполнитьПоОснованиюНачало();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованиюНачало() Экспорт

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоОснованиюЗавершение", ЭтотОбъект);
	ПоказатьВопрос(
		ОписаниеОповещения, НСтр("ru = 'Заполнить документ по выбранному основанию?'"), РежимДиалогаВопрос.ДаНет, 0);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтавкуНоменклатуры(Номенклатура, ДатаДокумента)
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Справочники.СтавкиНДС.ПустаяСсылка();
	КонецЕсли;

	Возврат Справочники.СтавкиНДС.СтавкаНДС(Номенклатура.ВидСтавкиНДС, ?(ЗначениеЗаполнено(ДатаДокумента),
		ДатаДокумента, ТекущаяДатаСеанса()));

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПроектПоДоговору(Договор)
	
	Если ПолучитьФункциональнуюОпцию("УчетПоПроектам") Тогда
		Проект = Справочники.Проекты.ПолучитьПроектПоДоговору(Договор);
	Иначе
		Проект = Справочники.Проекты.ПустаяСсылка();
	КонецЕсли; 
	
	Возврат Проект;
	
КонецФункции

&НаКлиенте
Процедура СчетФактураКонтрагентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если НЕ ИспользоватьБыструюФормуКонтрагентовВДокументах Тогда
		Возврат
	КонецЕсли;
	
	ПараметрыПолученияДанных.Вставить("ВидОперации", "АвансовыйОтчет");
	БыстрыеФормыУНФКлиент.КонтрагентАвтоПодбор(
		Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
		
КонецПроцедуры

&НаКлиенте
Процедура СчетФактураКонтрагентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если НЕ ИспользоватьБыструюФормуКонтрагентовВДокументах Тогда
		Возврат
	КонецЕсли;
	
	ПараметрыПолученияДанных.Вставить("ВидОперации", "АвансовыйОтчет");
	БыстрыеФормыУНФКлиент.КонтрагентОкончаниеВводаТекста(
		Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка);
		
КонецПроцедуры

&НаКлиенте
Процедура СчетФактураКонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если НЕ ИспользоватьБыструюФормуКонтрагентовВДокументах Тогда
		Возврат
	КонецЕсли;
	
	ПараметрыОбъекта = Новый Структура("ВидОперации", "АвансовыйОтчет");
	БыстрыеФормыУНФКлиент.ОткрытьБыструюФормуКонтрагента(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ПараметрыОбъекта);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетФактураДоговорКонтрагентаПриИзменении(Элемент)
	
	ПроцедураПриИзменениеДоговора();
	
КонецПроцедуры  

&НаКлиенте
Процедура ПроцедураПриИзменениеДоговора()
	
	ПриИзменениеДоговораНаСервере();
	
КонецПроцедуры 

&НаСервере
Процедура ПриИзменениеДоговораНаСервере()
	
	Если ЗначениеЗаполнено(Объект.СчетФактураДоговорКонтрагента) И НЕ ЗначениеЗаполнено(Объект.Проект) Тогда
		Объект.Проект = ПолучитьПроектПоДоговору(Объект.СчетФактураДоговорКонтрагента);
	КонецЕсли;  
	
	ЗаполнитьПризнакРегистрацииЦенПоставщика(); 
	
	ВидЦенКонтрагентаДоговора = ПолучитьВидЦенКонтрагентаПоДоговору(Объект.СчетФактураДоговорКонтрагента); 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПризнакРегистрацииЦенПоставщика() 
	
	АвтоРегистрацияЦенПоставщика = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетФактураДоговорКонтрагента, 
		"АвтоматическиРегистрироватьЦены"); 
	 
	Объект.РегистрироватьЦеныПоставщика = АвтоРегистрацияЦенПоставщика;

КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьВидЦенКонтрагентаПоДоговору(ДоговорСсылка)
	
	ВидЦенКонтрагента = Справочники.ВидыЦенКонтрагентов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ВидЦенКонтрагента КАК ВидЦенКонтрагента
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДоговорСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ВидЦенКонтрагента = ВыборкаДетальныеЗаписи.ВидЦенКонтрагента; 
		КонецЕсли;  
		
	Конецесли;
	
	Возврат ВидЦенКонтрагента;
	
КонецФункции

&НаКлиенте
Процедура СчетФактураВТабличнойЧастиДокументаПриИзменении(Элемент)
	
	СчетФактураСсылка = ПолучитьПодчиненныйСчетФактуру();
	Если Не СчетФактураСсылка = Неопределено Тогда
		СтрокаСообщения = НСтр("ru = 'Для документа введена(ы) счет-фактура(ы). Изменение положения невозможно.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
		Объект.СчетФактураВТабличнойЧастиДокумента = Не Объект.СчетФактураВТабличнойЧастиДокумента;
		Возврат;
	КонецЕсли;
	
	Если Не Объект.СчетФактураВТабличнойЧастиДокумента Тогда
		
		ЕстьСчетФактурыВСтроках = Ложь;
		Для Каждого СтрокаЗапасы Из Объект.Запасы Цикл
			
			Если ЗначениеЗаполнено(СтрокаЗапасы.СчетФактура) Тогда
				ЕстьСчетФактурыВСтроках = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ЕстьСчетФактурыВСтроках Тогда
			
			Для Каждого СтрокаРасходы Из Объект.Расходы Цикл
				
				Если ЗначениеЗаполнено(СтрокаРасходы.СчетФактура) Тогда
					ЕстьСчетФактурыВСтроках = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ЕстьСчетФактурыВСтроках Тогда
			СтрокаСообщения = НСтр("ru = 'В строках табличных частей введены счет фактуры. Изменение положения невозможно.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
			Объект.СчетФактураВТабличнойЧастиДокумента = Истина;
			Возврат;
		КонецЕсли;
		
		Для Каждого СтрокаЗапасы Из Объект.Запасы Цикл
			СтрокаЗапасы.ДатаСФ = Неопределено;
			СтрокаЗапасы.НомерСФ = "";
			СтрокаЗапасы.Поставщик = Неопределено;
			СтрокаЗапасы.ПредъявленСФ = Ложь;
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.СчетФактураНадпись.Видимость = НЕ Объект.СчетФактураВТабличнойЧастиДокумента;
	Элементы.ГруппаДанныеКонтрагента.Видимость = НЕ Объект.СчетФактураВТабличнойЧастиДокумента;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСчетФактураНомерДата", "Видимость"
	, НЕ Объект.СчетФактураВТабличнойЧастиДокумента И Элементы.СчетФактураНадпись.Видимость И Не ЗначениеЗаполнено(КэшЗначений.СчетФактураСсылка));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыПредъявленСФ", "Видимость", Объект.СчетФактураВТабличнойЧастиДокумента);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыГруппаСчетФактура", "Видимость", Объект.СчетФактураВТабличнойЧастиДокумента);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасходыПредъявленСФ", "Видимость", Объект.СчетФактураВТабличнойЧастиДокумента);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасходыГруппаСчетФактура", "Видимость", Объект.СчетФактураВТабличнойЧастиДокумента);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВыданныеАвансы

 // Процедура - обработчик события НачалоВыбора поля ввода Документ.
//
&НаКлиенте
Процедура ВыданныеАвансыДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		ТекстСообщения = НСтр("ru = 'Укажите вначале сотрудника!'");
		ПоказатьПредупреждение(Неопределено,ТекстСообщения);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ВыданныеАвансыДокументНачалоВыбора()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапасы

&НаКлиенте
Процедура ЗапасыПриИзменении(Элемент)
	УстановитьВидимостьКолонкиДокументаПоступленияЗапасыПриИзменении(Элемент);
КонецПроцедуры

// Процедура - обработчик события ПриНачалеРедактирования строки списка Запасы.
//
&НаКлиенте
Процедура ЗапасыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;

	// ГрупповоеИзменениеСтрок
	Элемент.ТекущиеДанные.Пометка = Истина;
	// Конец ГрупповоеИзменениеСтрок

	Если НоваяСтрока И НЕ Копирование Тогда
		СтрокаТабличнойЧасти.Количество = НовоеКоличествоПриИзмененииНоменклатуры;
	КонецЕсли;
		
КонецПроцедуры // ЗапасыПриНачалеРедактирования()

// Процедура - обработчик события ПриОкончанииРедактирования строки списка Запасы.
//
&НаКлиенте
Процедура ЗапасыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
	
КонецПроцедуры // ЗапасыПриОкончанииРедактирования()

&НаКлиенте
Процедура ЗапасыСодержаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Запасы.ТекущиеДанные;
	СтруктураРеквизита = Новый Структура;
	СтруктураРеквизита.Вставить("Объект", "Объект");
	СтруктураРеквизита.Вставить("ТабЧасть", "Запасы");
	СтруктураРеквизита.Вставить("НомерСтроки", ТекущаяСтрока.НомерСтроки - 1);
	СтруктураРеквизита.Вставить("ИмяРеквизита", "Содержание");
	ЗаголовокФормыРедактирования = СтрШаблон(НСтр("ru='%1: содержание'"), Строка(ТекущаяСтрока.Номенклатура));
	ОбщегоНазначенияУНФКлиент.ПоказатьФормуРедактированияРеквизита(Элемент.ТекстРедактирования, ЭтотОбъект,
		СтруктураРеквизита, ЗаголовокФормыРедактирования);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Номенклатура.
//
&НаКлиенте
Процедура ЗапасыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗапрашиватьСбросКоличества И СбрасыватьКоличество
		И СтрокаТабличнойЧасти.Количество <> НовоеКоличествоПриИзмененииНоменклатуры Тогда
		
		ДопПараметр = Новый Структура();
		ДопПараметр.Вставить("Элемент", Элемент);
		ДопПараметр.Вставить("Количество", СтрокаТабличнойЧасти.Количество);
		Оповещение = Новый ОписаниеОповещения("ЗапасыПодтверждениеСбросаКоличестваЗавершение", ЭтотОбъект, ДопПараметр);
		ОткрытьФорму("ОбщаяФорма.ПодтверждениеСбросаКоличества", , , , , , Оповещение);
		
	Иначе
		
		Если СбрасыватьКоличество Тогда
			НовоеКоличество = НовоеКоличествоПриИзмененииНоменклатуры;
		Иначе
			НовоеКоличество = СтрокаТабличнойЧасти.Количество;
		КонецЕсли;
		ЗапасыНоменклатураПриИзмененииПродолжить(Элемент, НовоеКоличество);
		
	КонецЕсли;
	
КонецПроцедуры // ЗапасыНоменклатураПриИзменении()

&НаКлиенте
Процедура ЗапасыПодтверждениеСбросаКоличестваЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.Свойство("ЭтоПодбор") И ДополнительныеПараметры.ЭтоПодбор Тогда
		
		Если Результат = Неопределено Тогда
			Возврат
		КонецЕсли;
		
		ТекущаяСтраницыЗапасы	= (Элементы.Страницы.ТекущаяСтраница = Элементы.Товары);
		ИмяТабличнойЧасти		= ?(ТекущаяСтраницыЗапасы, "Запасы", "Расходы");
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);
		МассивНомеровИдентичныхСтрок = Новый Массив;
		ПолучитьЗапасыИзХранилища(ДополнительныеПараметры.АдресЗапасовВХранилище, ИмяТабличнойЧасти, Истина, Истина, МассивНомеровИдентичныхСтрок);
		
		Для Каждого НомерСтроки Из МассивНомеровИдентичныхСтрок Цикл
			
			СтрокаТабличнойЧасти = Объект[ИмяТабличнойЧасти][НомерСтроки];
			РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
			
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ЭтоПоискПоШтрихКоду") И ДополнительныеПараметры.ЭтоПоискПоШтрихКоду Тогда
		
		Если Результат = Неопределено Тогда
			Возврат
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);
		ДополнительныеПараметры.Вставить("ОбработкаПослеУточненияОбъединенияКоличества", Истина);
		ЗаполнитьПоДаннымШтрихкодовЗавершение(Неопределено, ДополнительныеПараметры);
		
		Возврат;
		
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ЗапрашиватьСбросКоличества = Результат.ЗапрашиватьСбросКоличества;
		Если НЕ ЗапрашиватьСбросКоличества Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);
		КонецЕсли;
		Если Результат.СбрасыватьКоличество Тогда
			НовоеКоличество = Результат.НовоеКоличествоПриИзмененииНоменклатуры;
		Иначе
			НовоеКоличество = ДополнительныеПараметры.Количество;
		КонецЕсли;
	Иначе
		НовоеКоличество = ДополнительныеПараметры.Количество;
	КонецЕсли;
	
	ЗапасыНоменклатураПриИзмененииПродолжить(ДополнительныеПараметры.Элемент, НовоеКоличество);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНоменклатураПриИзмененииПродолжить(Элемент, НовоеКоличество)

	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
	СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
	СтруктураДанные.Вставить("Партия", СтрокаТабличнойЧасти.Партия);
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.Количество = НовоеКоличество;	
	СтрокаТабличнойЧасти.СтавкаНДС = СтруктураДанные.СтавкаНДС;
	СтрокаТабличнойЧасти.Содержание = "";
	
	СтрокаТабличнойЧасти.ИспользоватьХарактеристики = СтруктураДанные.ИспользоватьХарактеристики;
	СтрокаТабличнойЧасти.ПроверятьЗаполнениеХарактеристики = СтруктураДанные.ПроверятьЗаполнениеХарактеристики;
	СтрокаТабличнойЧасти.ЗаполнениеХарактеристикиПроверено = Истина;
	
	Если СтруктураДанные.ИспользоватьХарактеристики Тогда
		Если ПодборНоменклатурыИзСписка И ТипЗнч(СтруктураВыбораНоменклатуры) = Тип("Структура") Тогда
			СтрокаТабличнойЧасти.Характеристика = СтруктураВыбораНоменклатуры.Характеристика;
			СтруктураВыбораНоменклатуры.Характеристика = Неопределено;
		Иначе
			СтрокаТабличнойЧасти.Характеристика = СтруктураДанные.Характеристика;
		КонецЕсли;
	КонецЕсли;
	
	//Партии
	СтрокаТабличнойЧасти.ИспользоватьПартии = СтруктураДанные.ИспользоватьПартии;
	СтрокаТабличнойЧасти.ПроверятьЗаполнениеПартий = СтруктураДанные.ПроверятьЗаполнениеПартий;
	
	Если СтруктураДанные.ИспользоватьПартии Тогда
		Если ПодборНоменклатурыИзСписка И ТипЗнч(СтруктураВыбораНоменклатуры) = Тип("Структура") Тогда
			СтрокаТабличнойЧасти.Партия = СтруктураВыбораНоменклатуры.Партия;
			СтруктураВыбораНоменклатуры.Партия = Неопределено;
		Иначе
			СтрокаТабличнойЧасти.Партия = СтруктураДанные.Партия;
		КонецЕсли;
	КонецЕсли;
	// Конец Партии
	
	СтрокаТабличнойЧасти.ЗапретитьВводДробногоКоличества = СтруктураДанные.ЗапретитьВводДробногоКоличества;
	
	Если ПодборНоменклатурыИзСписка Тогда
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтруктурнаяЕдиница) Тогда
			СтрокаТабличнойЧасти.СтруктурнаяЕдиница = СтруктураДанные.СтруктурнаяЕдиница;
		КонецЕсли;
	Иначе
		СтрокаТабличнойЧасти.СтруктурнаяЕдиница = СтруктураДанные.СтруктурнаяЕдиница;
	КонецЕсли;
	
	ПодборНоменклатурыИзСписка = Ложь;
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);

КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		СтандартнаяОбработка = Ложь;
		Возврат
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		Если ВыбранноеЗначение.Свойство("БыстроеСоздание") Тогда
			БыстрыеФормыУНФКлиент.ОткрытьБыструюФормуНоменклатуры(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
			Возврат
		КонецЕсли;

		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
		
		ПодборНоменклатурыИзСписка = ВыбранноеЗначение.Свойство("Ячейка");
		
		Если НЕ ТипЗнч(СтруктураВыбораНоменклатуры) = Тип("Структура") Тогда
			СтруктураВыбораНоменклатуры = Новый Структура("Характеристика, Партия");
		КонецЕсли;
		
		СтруктураВыбораНоменклатуры.Характеристика = ВыбранноеЗначение.Характеристика;
		СтруктураВыбораНоменклатуры.Партия = ВыбранноеЗначение.Партия;
		
		Если ВыбранноеЗначение.Свойство("СтруктураНастроек") Тогда
			НоменклатураВДокументахКлиентСервер.ЗаполнитьТаблицуНастроекФормыВыбораНоменклатуры(ЭтотОбъект, "АвансовыйОтчет",
				НастройкиФормыВыбораНоменклатуры, Истина, "Запасы", ВыбранноеЗначение.СтруктураНастроек);
			НоменклатураВДокументахКлиентСервер.ОбновитьПараметрыОткрытияФормыВыбора(ЭтотОбъект, "Запасы");
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ВыбранноеЗначение);
		
		Если СтрокаТабличнойЧасти.Свойство("СтруктурнаяЕдиница") Тогда
			СтрокаТабличнойЧасти.СтруктурнаяЕдиница = ВыбранноеЗначение.Склад;
		КонецЕсли;
		
		ВыбранноеЗначение = ВыбранноеЗначение.Номенклатура;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если НЕ ИспользоватьБыструюФормуНоменклатурыВДокументах Тогда
		Возврат
	КонецЕсли;
	
	БыстрыеФормыУНФКлиент.НоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНоменклатураОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если НЕ ИспользоватьБыструюФормуНоменклатурыВДокументах Тогда
		Возврат
	КонецЕсли;
	
	БыстрыеФормыУНФКлиент.НоменклатураОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыДокументПоступленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Организация", Объект.Организация);
	СтруктураОткрытия.Вставить("ТолькоПоДокументам", Ложь);
	СтруктураОткрытия.Вставить("СтруктурнаяЕдиница", ТекущиеДанные.СтруктурнаяЕдиница);
	СтруктураОткрытия.Вставить("ТолькоПоОрдерам", Истина);
	СтруктураОткрытия.Вставить("КПоступлению", Истина);
	СтруктураОткрытия.Вставить("Номенклатура", ТекущиеДанные.Номенклатура);
	СтруктураОткрытия.Вставить("Характеристика", ТекущиеДанные.Характеристика);
	СтруктураОткрытия.Вставить("Партия", ТекущиеДанные.Партия);
	
	ОткрытьФорму("ОбщаяФорма.ПодборПоОстаткамТоваровКПоступлениюРеализации", СтруктураОткрытия, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСтруктурнаяЕдиницаПриИзменении(Элемент)

	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	Если ДоступенОрдерныйУчет Тогда
		СтрокаТабличнойЧасти.ДокументПоступления = Неопределено;
		ЗапасыСтруктурнаяЕдиницаПриИзмененииСерверДоступенОрдерныйУчет();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗапасыСтруктурнаяЕдиницаПриИзмененииСерверДоступенОрдерныйУчет()
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
КонецПроцедуры

// Процедура - обработчик события АвтоПодбор поля ввода Содержание.
//
&НаКлиенте
Процедура ЗапасыСодержаниеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание = 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
		ШаблонСодержания = ТекстСодержания(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.Характеристика);
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(ШаблонСодержания);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Количество.
//
&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	
КонецПроцедуры // ЗапасыКоличествоПриИзменении()

// Процедура - обработчик события ОбработкаВыбора поля ввода ЕдиницаИзмерения.
//
&НаКлиенте
Процедура ЗапасыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти.ЕдиницаИзмерения = ВыбранноеЗначение 
	 ИЛИ СтрокаТабличнойЧасти.Цена = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийКоэффициент = 0;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		ТекущийКоэффициент = 1;
	КонецЕсли;
	
	Коэффициент = 0;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		Коэффициент = 1;
	КонецЕсли;
	
	Если ТекущийКоэффициент = 0 И Коэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(СтрокаТабличнойЧасти.ЕдиницаИзмерения, ВыбранноеЗначение);
	ИначеЕсли ТекущийКоэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	ИначеЕсли Коэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(,ВыбранноеЗначение);
	ИначеЕсли ТекущийКоэффициент = 1 И Коэффициент = 1 Тогда
		СтруктураДанные = Новый Структура("ТекущийКоэффициент, Коэффициент", 1, 1);
	КонецЕсли;
	
	// Цена.
	Если СтруктураДанные.ТекущийКоэффициент <> 0 Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Цена * СтруктураДанные.Коэффициент / СтруктураДанные.ТекущийКоэффициент;
	КонецЕсли;
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	
КонецПроцедуры // ЗапасыЕдиницаИзмеренияОбработкаВыбора()

// Процедура - обработчик события ПриИзменении поля ввода Цена.
//
&НаКлиенте
Процедура ЗапасыЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	
КонецПроцедуры // ЗапасыЦенаПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода Сумма.
//
&НаКлиенте
Процедура ЗапасыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти.Количество <> 0 Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	
	ПараметрыРасчета = Новый Структура("СуммаВключаетНДС, РассчитатьЦену", Объект.СуммаВключаетНДС, Истина);
	ТабличныеЧастиУНФКлиент.РассчитатьСуммыВСтрокеТЧ(СтрокаТабличнойЧасти, ПараметрыРасчета);
	
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
	
КонецПроцедуры // ЗапасыСуммаПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода СтавкаНДС.
//
&НаКлиенте
Процедура ЗапасыСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	ПараметрыРасчета = Новый Структура("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	ТабличныеЧастиУНФКлиент.РассчитатьСуммыВСтрокеТЧ(СтрокаТабличнойЧасти, ПараметрыРасчета);
	
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
	
КонецПроцедуры  // ЗапасыСтавкаНДСПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода СтавкаНДС.
//
&НаКлиенте
Процедура ЗапасыСуммаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
	
КонецПроцедуры // ЗапасыСуммаНДСПриИзменении()

// Процедура - обработчик события ПослеУдаления строки списка Запасы.
//
&НаКлиенте
Процедура ЗапасыПослеУдаления(Элемент)
	
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
	
КонецПроцедуры // ЗапасыПослеУдаления()

&НаКлиенте
Процедура ЗапасыСчетФактураПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СчетФактура) Тогда
		ЗаполнитьПараметрыСтрокиПоСчетФактуре(ТекущиеДанные.НомерСтроки, ТекущиеДанные.СчетФактура);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПредъявленСФПриИзменении(Элемент) 
	
	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ТекущиеДанные.ДатаСФ = Неопределено;
	ТекущиеДанные.НомерСФ = "";
	ТекущиеДанные.СчетФактура = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПоставщикПриИзменении(Элемент) 
	
	ЗаполнитьСчетФактуруВСтрокеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыДатаСФПриИзменении(Элемент)
	ЗаполнитьСчетФактуруВСтрокеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНомерСФПриИзменении(Элемент)
	ЗаполнитьСчетФактуруВСтрокеНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасходы

// Процедура - обработчик события ПриНачалеРедактирования строки списка Расходы.
//
&НаКлиенте
Процедура РасходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;

	Если НоваяСтрока Тогда
		СтрокаТабличнойЧасти.СтруктурнаяЕдиница = ОсновноеПодразделение;
	КонецЕсли;
	
	// ГрупповоеИзменениеСтрок
	Элемент.ТекущиеДанные.Пометка = Истина;
	// Конец ГрупповоеИзменениеСтрок 
	
	Если НоваяСтрока И НЕ Копирование Тогда
		СтрокаТабличнойЧасти.Количество = НовоеКоличествоПриИзмененииНоменклатуры;
	КонецЕсли;
	
КонецПроцедуры // РасходыПриНачалеРедактирования()

// Процедура - обработчик события ПриОкончанииРедактирования строки списка Расходы.
//
&НаКлиенте
Процедура РасходыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
	
КонецПроцедуры // РасходыПриОкончанииРедактирования()

// Процедура - обработчик события ПриИзменении поля ввода Номенклатура.
//
&НаКлиенте
Процедура РасходыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗапрашиватьСбросКоличества И СбрасыватьКоличество
		И СтрокаТабличнойЧасти.Количество <> НовоеКоличествоПриИзмененииНоменклатуры Тогда
		
		ДопПараметр = Новый Структура();
		ДопПараметр.Вставить("Элемент", Элемент);
		ДопПараметр.Вставить("Количество", СтрокаТабличнойЧасти.Количество);
		Оповещение = Новый ОписаниеОповещения("РасходыПодтверждениеСбросаКоличестваЗавершение", ЭтотОбъект, ДопПараметр);
		ОткрытьФорму("ОбщаяФорма.ПодтверждениеСбросаКоличества", , , , , , Оповещение);
		
	Иначе
		
		Если СбрасыватьКоличество Тогда
			НовоеКоличество = НовоеКоличествоПриИзмененииНоменклатуры;
		Иначе
			НовоеКоличество = СтрокаТабличнойЧасти.Количество;
		КонецЕсли;
		РасходыНоменклатураПриИзмененииПродолжить(Элемент, НовоеКоличество);
		
	КонецЕсли;

	
КонецПроцедуры // РасходыНоменклатураПриИзменении()

&НаКлиенте
Процедура РасходыПодтверждениеСбросаКоличестваЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ЗапрашиватьСбросКоличества = Результат.ЗапрашиватьСбросКоличества;
		Если НЕ ЗапрашиватьСбросКоличества Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);
		КонецЕсли;
		Если Результат.СбрасыватьКоличество Тогда
			НовоеКоличество = Результат.НовоеКоличествоПриИзмененииНоменклатуры;
		Иначе
			НовоеКоличество = ДополнительныеПараметры.Количество;
		КонецЕсли;
	Иначе
		НовоеКоличество = ДополнительныеПараметры.Количество;
	КонецЕсли;
	
	РасходыНоменклатураПриИзмененииПродолжить(ДополнительныеПараметры.Элемент, НовоеКоличество);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыНоменклатураПриИзмененииПродолжить(Элемент, НовоеКоличество)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.Количество = НовоеКоличество;
	СтрокаТабличнойЧасти.СтавкаНДС = СтруктураДанные.СтавкаНДС;
	СтрокаТабличнойЧасти.Содержание = "";
	
	Если СтруктураДанные.ОчиститьЗаказИПодразделение Тогда
		СтрокаТабличнойЧасти.СтруктурнаяЕдиница = Неопределено;
		СтрокаТабличнойЧасти.ЗаказПокупателя = Неопределено;
	ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтруктурнаяЕдиница) Тогда
		СтрокаТабличнойЧасти.СтруктурнаяЕдиница = ОсновноеПодразделение;
	КонецЕсли;
	
	Если СтруктураДанные.ОчиститьНаправлениеДеятельности Тогда
		СтрокаТабличнойЧасти.НаправлениеДеятельности = Неопределено;
	КонецЕсли;
	
	СтрокаТабличнойЧасти.ЗапретитьВводДробногоКоличества = СтруктураДанные.ЗапретитьВводДробногоКоличества;
	
	ПодборНоменклатурыИзСписка = Ложь;
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	
КонецПроцедуры // РасходыНоменклатураПриИзменении()

&НаКлиенте
Процедура РасходыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
		
		Если ВыбранноеЗначение.Свойство("СтруктураНастроек") Тогда
			НоменклатураВДокументахКлиентСервер.ЗаполнитьТаблицуНастроекФормыВыбораНоменклатуры(ЭтотОбъект, "АвансовыйОтчет",
				НастройкиФормыВыбораНоменклатуры, Истина, "Расходы", ВыбранноеЗначение.СтруктураНастроек);
			НоменклатураВДокументахКлиентСервер.ОбновитьПараметрыОткрытияФормыВыбора(ЭтотОбъект, "Расходы");
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ВыбранноеЗначение);
		
		ВыбранноеЗначение = СтрокаТабличнойЧасти.Номенклатура;
		
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик события АвтоПодбор поля ввода Содержание.
//
&НаКлиенте
Процедура РасходыСодержаниеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание = 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
		ШаблонСодержания = ТекстСодержания(СтрокаТабличнойЧасти.Номенклатура, Неопределено);
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(ШаблонСодержания);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Количество.
//
&НаКлиенте
Процедура РасходыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	
КонецПроцедуры // РасходыКоличествоПриИзменении()

// Процедура - обработчик события ОбработкаВыбора поля ввода ЕдиницаИзмерения.
//
&НаКлиенте
Процедура РасходыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти.ЕдиницаИзмерения = ВыбранноеЗначение 
		ИЛИ СтрокаТабличнойЧасти.Цена = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийКоэффициент = 0;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		ТекущийКоэффициент = 1;
	КонецЕсли;
	
	Коэффициент = 0;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		Коэффициент = 1;
	КонецЕсли;
	
	Если ТекущийКоэффициент = 0 И Коэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(СтрокаТабличнойЧасти.ЕдиницаИзмерения, ВыбранноеЗначение);
	ИначеЕсли ТекущийКоэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	ИначеЕсли Коэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(,ВыбранноеЗначение);
	ИначеЕсли ТекущийКоэффициент = 1 И Коэффициент = 1 Тогда
		СтруктураДанные = Новый Структура("ТекущийКоэффициент, Коэффициент", 1, 1);
	КонецЕсли;
	
	// Цена.
	Если СтруктураДанные.ТекущийКоэффициент <> 0 Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Цена * СтруктураДанные.Коэффициент / СтруктураДанные.ТекущийКоэффициент;
	КонецЕсли;
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	
КонецПроцедуры // РасходыЕдиницаИзмеренияОбработкаВыбора()

// Процедура - обработчик события ПриИзменении поля ввода Цена.
//
&НаКлиенте
Процедура РасходыЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	
КонецПроцедуры // РасходыЦенаПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода Сумма.
//
&НаКлиенте
Процедура РасходыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	// Цена.
	Если СтрокаТабличнойЧасти.Количество <> 0 Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	
	ПараметрыРасчета = Новый Структура("СуммаВключаетНДС, РассчитатьЦену", Объект.СуммаВключаетНДС, Истина);
	ТабличныеЧастиУНФКлиент.РассчитатьСуммыВСтрокеТЧ(СтрокаТабличнойЧасти, ПараметрыРасчета);
	
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
	
КонецПроцедуры // РасходыСуммаПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода СтавкаНДС.
//
&НаКлиенте
Процедура РасходыСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	ПараметрыРасчета = Новый Структура("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	ТабличныеЧастиУНФКлиент.РассчитатьСуммыВСтрокеТЧ(СтрокаТабличнойЧасти, ПараметрыРасчета);
	
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
	
КонецПроцедуры  // РасходыСтавкаНДСПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода СтавкаНДС.
//
&НаКлиенте
Процедура РасходыСуммаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
	
КонецПроцедуры // РасходыСуммаНДСПриИзменении()

// Процедура - обработчик события НачалоВыбора поля ввода РасходыНаправлениеДеятельности.
//
&НаКлиенте
Процедура РасходыНаправлениеДеятельностиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	СтруктураДанные = ПолучитьДанныеНаправлениеДеятельностиНачалоВыбора(СтрокаТабличнойЧасти.Номенклатура);
	
	Если НЕ СтруктураДанные.ВозможностьУказанияНаправленияДеятельности Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для данного расхода направление деятельности не указывается!'"));
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры // РасходыНаправлениеДеятельностиНачалоВыбора()

&НаКлиенте
// Процедура - обработчик события НачалоВыбора поля ввода СтруктурнаяЕдиница.
//
Процедура РасходыСтруктурнаяЕдиницаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	СтруктураДанные = ПолучитьДанныеСтруктурнаяЕдиницаНачалоВыбора(СтрокаТабличнойЧасти.Номенклатура);
	
	Если НЕ СтруктураДанные.ВозможностьУказанияПодразделения Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для этого расхода подразделение не указывается!'"));
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры // РасходыСтруктурнаяЕдиницаНачалоВыбора()

&НаКлиенте
// Процедура - обработчик события НачалоВыбора поля ввода Заказ.
//
Процедура РасходыЗаказНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	СтруктураДанные = ПолучитьДанныеЗаказНачалоВыбора(СтрокаТабличнойЧасти.Номенклатура);
	
	Если НЕ СтруктураДанные.ВозможностьУказанияЗаказа Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для этого расхода заказ не указывается!'"));
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры // РасходыЗаказНачалоВыбора()

// Процедура - обработчик события ПослеУдаления строки списка Расходы.
//
&НаКлиенте
Процедура РасходыПослеУдаления(Элемент)
	
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
	
КонецПроцедуры // РасходыПослеУдаления()

&НаКлиенте
Процедура ЗапасыПриАктивизацииЯчейки(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда 
		Возврат 
	КонецЕсли;
	
	УстанавливатьФорматРедактированияЗапретаДробногоКоличества = Истина;
	Если Не СбрасыватьКоличество Тогда
		УстанавливатьФорматРедактированияЗапретаДробногоКоличества = СтрокаТабличнойЧасти.Количество = Цел(СтрокаТабличнойЧасти.Количество);
	КонецЕсли;
	
	Если Не Элемент.ТекущийЭлемент = Неопределено И Элемент.ТекущийЭлемент.Имя = "ЗапасыКоличество" Тогда
		Элементы.ЗапасыКоличество.ФорматРедактирования = ?(СтрокаТабличнойЧасти.ЗапретитьВводДробногоКоличества И УстанавливатьФорматРедактированияЗапретаДробногоКоличества, "ЧДЦ=0", "");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыПриАктивизацииЯчейки(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда 
		Возврат 
	КонецЕсли;
	
	УстанавливатьФорматРедактированияЗапретаДробногоКоличества = Истина;
	Если Не СбрасыватьКоличество Тогда
		УстанавливатьФорматРедактированияЗапретаДробногоКоличества = СтрокаТабличнойЧасти.Количество = Цел(СтрокаТабличнойЧасти.Количество);
	КонецЕсли;
	
	Если Не Элемент.ТекущийЭлемент = Неопределено И Элемент.ТекущийЭлемент.Имя = "РасходыКоличество" Тогда
		Элементы.РасходыКоличество.ФорматРедактирования = ?(СтрокаТабличнойЧасти.ЗапретитьВводДробногоКоличества И УстанавливатьФорматРедактированияЗапретаДробногоКоличества, "ЧДЦ=0", "");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыСодержаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Расходы.ТекущиеДанные;
	СтруктураРеквизита = Новый Структура;
	СтруктураРеквизита.Вставить("Объект", "Объект");
	СтруктураРеквизита.Вставить("ТабЧасть", "Расходы");
	СтруктураРеквизита.Вставить("НомерСтроки", ТекущаяСтрока.НомерСтроки - 1);
	СтруктураРеквизита.Вставить("ИмяРеквизита", "Содержание");
	ЗаголовокФормыРедактирования = СтрШаблон(НСтр("ru='%1: содержание'"), Строка(ТекущаяСтрока.Номенклатура));
	ОбщегоНазначенияУНФКлиент.ПоказатьФормуРедактированияРеквизита(Элемент.ТекстРедактирования, ЭтотОбъект,
		СтруктураРеквизита, ЗаголовокФормыРедактирования);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыПредъявленСФПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Расходы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ТекущиеДанные.ДатаСФ = Неопределено;
	ТекущиеДанные.НомерСФ = "";
	ТекущиеДанные.СчетФактура = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыПоставщикПриИзменении(Элемент)
	ЗаполнитьСчетФактуруВСтрокеНаКлиенте("Расходы");
КонецПроцедуры

&НаКлиенте
Процедура РасходыДатаСФПриИзменении(Элемент)
	ЗаполнитьСчетФактуруВСтрокеНаКлиенте("Расходы");
КонецПроцедуры

&НаКлиенте
Процедура РасходыНомерСФПриИзменении(Элемент)
	ЗаполнитьСчетФактуруВСтрокеНаКлиенте("Расходы");
КонецПроцедуры

&НаКлиенте
Процедура РасходыСчетФактураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Расходы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СчетФактура) Тогда
		ЗаполнитьПараметрыСтрокиПоСчетФактуре(ТекущиеДанные.НомерСтроки, ТекущиеДанные.СчетФактура);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыЗаказПриИзменении(Элемент)
	Если Объект.ПоложениеПроекта = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти") Тогда
		Элементы.Расходы.ТекущиеДанные.Проект = ПроектИзЗаказа(Элементы.Расходы.ТекущиеДанные.ЗаказПокупателя);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроектИзЗаказа(ЗаказПокупателя)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказПокупателя, "Проект");

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОплаты

// Процедура - обработчик события ПриИзменении поля ввода ОплатыКонтрагент.
// Устанавливает курс и кратность валюты договора.
//
&НаКлиенте
Процедура ОплатыКонтрагентПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Оплаты.ТекущиеДанные;
	
	СтруктураДанные = ПолучитьДанныеКонтрагентПриИзменении(Объект.Дата, СтрокаТабличнойЧасти.Контрагент, Объект.Организация);
	
	СтрокаТабличнойЧасти.Договор = СтруктураДанные.Договор;
	
	СтрокаТабличнойЧасти.ВестиРасчетыПоДоговорам = СтруктураДанные.ВестиРасчетыПоДоговорам;
	СтрокаТабличнойЧасти.ВестиРасчетыПоДокументам = СтруктураДанные.ВестиРасчетыПоДокументам;
	СтрокаТабличнойЧасти.ВестиРасчетыПоЗаказам = СтруктураДанные.ВестиРасчетыПоЗаказам;
	СтрокаТабличнойЧасти.ВестиУчетОплатыПоСчетам = СтруктураДанные.ВестиУчетОплатыПоСчетам;
	
	СтрокаТабличнойЧасти.Курс = ?(
			СтрокаТабличнойЧасти.Курс = 0,
			1,
			СтрокаТабличнойЧасти.Курс);
		СтрокаТабличнойЧасти.Кратность = ?(
			СтрокаТабличнойЧасти.Кратность = 0,
			1,
			СтрокаТабличнойЧасти.Кратность);
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Договор) Тогда
		СтрокаТабличнойЧасти.Курс = ?(
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс = 0,
			1,
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс);
		СтрокаТабличнойЧасти.Кратность = ?(
			СтруктураДанные.ДоговорВалютаКурсКратность.Кратность = 0,
			1,
			СтруктураДанные.ДоговорВалютаКурсКратность.Кратность);
	КонецЕсли;
	
	СтрокаТабличнойЧасти.СуммаРасчетов = ВалютыУНФКлиентСервер.Пересчитать(СтрокаТабличнойЧасти.СуммаПлатежа,
		Объект.Курс, СтрокаТабличнойЧасти.Курс, Объект.Кратность, СтрокаТабличнойЧасти.Кратность);
	
КонецПроцедуры // ОплатыКонтрагентПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода ОплатыДоговор.
// Устанавливает курс и кратность валюты договора.
//
&НаКлиенте
Процедура ОплатыДоговорПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Оплаты.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Договор) Тогда
		СтруктураДанные = ПолучитьДанныеОплатыДоговорПриИзменении(
			Объект.Дата,
			СтрокаТабличнойЧасти.Договор);
		СтрокаТабличнойЧасти.Курс = ?(
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс = 0,
			1,
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс);
		СтрокаТабличнойЧасти.Кратность = ?(
			СтруктураДанные.ДоговорВалютаКурсКратность.Кратность = 0,
			1,
			СтруктураДанные.ДоговорВалютаКурсКратность.Кратность);
	КонецЕсли;
	
	СтрокаТабличнойЧасти.СуммаРасчетов = ВалютыУНФКлиентСервер.Пересчитать(СтрокаТабличнойЧасти.СуммаПлатежа,
		Объект.Курс, СтрокаТабличнойЧасти.Курс, Объект.Кратность, СтрокаТабличнойЧасти.Кратность);
	
КонецПроцедуры // ОплатыДоговорПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода ОплатыВидРасчетов.
// Очищает реквизит документ если тип расчетов - "Аванс".
//
&НаКлиенте
Процедура ОплатыПризнакАвансаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Оплаты.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти.ПризнакАванса Тогда
		СтрокаТабличнойЧасти.Документ = Неопределено;
	КонецЕсли;
	
КонецПроцедуры // ОплатыПризнакАвансаПриИзменении()

// Процедура - обработчик события НачалоВыбора поля ввода ОплатыДокумент.
// Передает в параметры текущее значение реквизита.
//
&НаКлиенте
Процедура ОплатыДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Оплаты.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти.ПризнакАванса Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для вида расчета с признаком ""Аванс"" документом расчетов будет текущий!'"));
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ОплатыДокументНачалоВыбора()

// Процедура - обработчик события ПриИзменении поля вв ОплатыСуммаРасчетов.
// Рассчитывает сумму платежа.
//
&НаКлиенте
Процедура ОплатыСуммаРасчетовПриИзменении(Элемент)
	
	РассчитатьСуммуПлатежа(Элементы.Оплаты.ТекущиеДанные);
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
	
КонецПроцедуры // ОплатыСуммаРасчетовПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода ОплатыКурс.
// Рассчитывает сумму платежа.
//
&НаКлиенте
Процедура ОплатыКурсПриИзменении(Элемент)
	
	РасчетыРаботаСФормамиКлиент.ПриИзмененииКурсаВСтрокеОплаты(ЭтотОбъект);
	
	РассчитатьСуммуПлатежа(Элементы.Оплаты.ТекущиеДанные);
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
	
КонецПроцедуры // ОплатыКурсПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода ОплатыКратность.
// Рассчитывает сумму платежа.
//
&НаКлиенте
Процедура ОплатыКратностьПриИзменении(Элемент)
	
	РассчитатьСуммуПлатежа(Элементы.Оплаты.ТекущиеДанные);
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
	
КонецПроцедуры // ОплатыКратностьПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода ОплатыСуммаПлатежа.
// Рассчитывает курс и кратность валюты расчетов и сумму НДС.
//
&НаКлиенте
Процедура ОплатыСуммаПлатежаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Оплаты.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
		1,
		СтрокаТабличнойЧасти.Курс);
	СтрокаТабличнойЧасти.Кратность = ?(
		СтрокаТабличнойЧасти.Кратность = 0,
		1,
		СтрокаТабличнойЧасти.Кратность);
	
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.СуммаРасчетов = 0,
		1,
		СтрокаТабличнойЧасти.СуммаПлатежа / СтрокаТабличнойЧасти.СуммаРасчетов * Объект.Курс);
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
	
КонецПроцедуры // ОплатыСуммаПлатежаПриИзменении()

// Процедура - обработчик события ПослеУдаления строки списка Оплаты.
//
&НаКлиенте
Процедура ОплатыПослеУдаления(Элемент)
	
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
	УстановитьВидимостьРеквизитовРасчетов();
	
КонецПроцедуры // ОплатыПослеУдаления()

// Процедура - обработчик события НачалоВыбора строки списка Оплаты.
//
&НаКлиенте
Процедура ОплатыКурсНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РасчетыРаботаСФормамиКлиент.ПредоплатаКурсНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

// Процедура - обработчик события ПриОкончанииРедактирования строки списка Оплаты.
//
&НаКлиенте
Процедура ОплатыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
	
КонецПроцедуры // ОплатыПриОкончанииРедактирования()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьДополнительныйРеквизит(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийНаборСвойств", КэшЗначений.НаборСвойств_Документ_АвансовыйОтчет);
	ПараметрыФормы.Вставить("ЭтоДополнительноеСведение", Ложь);

	ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ФормаОбъекта", ПараметрыФормы, , , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура НастройкаСбросаКоличества(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СтрокаПоиска", НСтр("ru = 'Сбрасывать количество при изменении номенклатуры'"));
	Оповещение = Новый ОписаниеОповещения("НастройкаСбросаКоличестваЗавершение", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.НастройкиПользователей.Форма.ФормаНастройкиПользователя", СтруктураПараметров, , , , ,
		Оповещение);
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, 
		Элементы.ЗапасыКонтекстноеМенюНастройкаСбросаКоличества, "Нажатие");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСбросаКоличестваЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	НастройкиКоличества = ПолучитьНастройкиИзмененияКоличества();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиКоличества);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаФормы(Команда)
		
	ОткрытьФормуНастройки(Истина);
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элементы.ФормаНастройкаФормы, "Нажатие");

КонецПроцедуры

&НаКлиенте
Процедура ШапкаТабличнаяЧасть(Команда)

	ОткрытьФормуНастройки(Ложь);

КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьКолонкиДокументаПоступленияЗапасыПриИзменении(Элемент, ПослеУдаления = Ложь)
	
	Если Элемент = Неопределено ИЛИ (ПослеУдаления Или (Не Элемент.ТекущийЭлемент = Неопределено 
		И (Элемент.ТекущийЭлемент.Имя = "ЗапасыНоменклатура" Или Элемент.ТекущийЭлемент.Имя = "ЗапасыСтруктурнаяЕдиница"))) Тогда
			
			ПараметрыПоиска = Новый Структура("УказыватьДокументПоступления", Истина);
			
			НайденныеСтроки = Объект.Запасы.НайтиСтроки(ПараметрыПоиска);
			Элементы.ЗапасыДокументПоступления.Видимость = НайденныеСтроки.Количество();
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьКолонкиДокументаПоступления(Форма)
	
	Если Не Форма.ДоступенОрдерныйУчет Тогда
		Форма.Элементы.ЗапасыДокументПоступления.Видимость = Ложь;
		Возврат
	КонецЕсли;
	
	
	ПараметрыПоиска = Новый Структура("УказыватьДокументПоступления", Истина);
	
	НайденныеСтроки = Форма.Объект.Запасы.НайтиСтроки(ПараметрыПоиска);
	Форма.Элементы.ЗапасыДокументПоступления.Видимость = НайденныеСтроки.Количество();
	
КонецПроцедуры

&НаСервере 
Функция ПолучитьПодчиненныйСчетФактуру()
	Возврат СчетаФактурыУНФ.ПолучитьПодчиненныйСчетФактуру(Объект.Ссылка, Истина);
КонецФункции

&НаСервере
Процедура ДополнитьУсловноеОформлениеФормы()
	
	//Запасы
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.ПредъявленСФ", Ложь);
	
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ЗапасыПоставщик");
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ЗапасыДатаСФ");
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ЗапасыНомерСФ");
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ЗапасыСчетФактура");

	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ТолькоПросмотр", Истина);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.ПредъявленСФ", Истина);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.СчетФактура", "", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.Поставщик", "", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ЗапасыПоставщик");
	
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Истина);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.ПредъявленСФ", Истина);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.СчетФактура", "", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.ДатаСФ", "", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ЗапасыДатаСФ");
	
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Истина);

	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.ПредъявленСФ", Истина);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.СчетФактура", "", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.НомерСФ", "", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ЗапасыНомерСФ");
	
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Истина);
 
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.ПредъявленСФ", Истина);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.СчетФактура", "", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ЗапасыСчетФактура");
	
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", НСтр("ru='Создается автоматически'"));
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
			
	//Расходы
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Расходы.ПредъявленСФ", Ложь);
	
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "РасходыПоставщик");
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "РасходыДатаСФ");
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "РасходыНомерСФ");
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "РасходыСчетФактура");

	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ТолькоПросмотр", Истина);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Расходы.ПредъявленСФ", Истина);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Расходы.СчетФактура", "", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Расходы.Поставщик", "", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "РасходыПоставщик");
	
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Истина);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Расходы.ПредъявленСФ", Истина);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Расходы.СчетФактура", "", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Расходы.ДатаСФ", "", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "РасходыДатаСФ");
	
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Истина);

	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Расходы.ПредъявленСФ", Истина);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Расходы.СчетФактура", "", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Расходы.НомерСФ", "", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "РасходыНомерСФ");
	
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Истина);
 
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Расходы.ПредъявленСФ", Истина);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Расходы.СчетФактура", "", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "РасходыСчетФактура");
	
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", НСтр("ru='Создается автоматически'"));
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
	СкладскойУчетСервер.УстановитьУсловноеОформлениеДокументовПоступления(УсловноеОформление,,, ТипЗнч(Объект.Ссылка));
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьОтПользовательскихНастроек(Форма)

	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	Если Объект.ПоложениеПроекта = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти") Тогда
		Элементы.РасходыПроект.Видимость = Истина;
		Элементы.Проект.Видимость = Ложь;
	Иначе
		Элементы.РасходыПроект.Видимость = Ложь;
		Элементы.Проект.Видимость = Истина;
	КонецЕсли;
	
	// Видимость колонок, настроенная пользователем
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыСодержание", "Видимость",
		Форма.ПоказыватьКолонкуСодержаниеВАвансовомОтчетеЗапасы);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасходыСодержание", "Видимость",
		Форма.ПоказыватьКолонкуСодержаниеВАвансовомОтчетеРасходы);
		
КонецПроцедуры
	
&НаСервере
Процедура ЗаполнитьПараметрыСтрокиПоСчетФактуре(НомерСтроки, СчетФактура)
	
	СтрокаТаблицы = Объект.Запасы[НомерСтроки - 1];
	СтрокаТаблицы.ДатаСФ = СчетФактура.ДатаВходящегоДокумента;
	СтрокаТаблицы.НомерСФ = СчетФактура.НомерВходящегоДокумента;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСчетФактуруВСтрокеНаКлиенте(ИмяТаблицы = "Запасы")
	
	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Поставщик)
		Или Не ЗначениеЗаполнено(ТекущиеДанные.ДатаСФ)
		Или Не ЗначениеЗаполнено(ТекущиеДанные.НомерСФ)
		Или ЗначениеЗаполнено(ТекущиеДанные.СчетФактура) Тогда
		Возврат
	КонецЕсли;
	
	ЗаполнитьСчетФактуруВСтроке(ТекущиеДанные.НомерСтроки, ИмяТаблицы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСчетФактуруВСтроке(НомерСтроки, ИмяТаблицы)
	
	СтрокаТаблицы = Объект[ИмяТаблицы][НомерСтроки - 1];

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Контрагент",СтрокаТаблицы.Поставщик);
	Запрос.УстановитьПараметр("ДатаСФ",СтрокаТаблицы.ДатаСФ);
	Запрос.УстановитьПараметр("НомерСФ",СтрокаТаблицы.НомерСФ);
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СчетФактураПолученный.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	СчетФактураПолученный.НомерВходящегоДокумента = &НомерСФ
	|	И СчетФактураПолученный.ДатаВходящегоДокумента = &ДатаСФ
	|	И СчетФактураПолученный.Организация = &Организация
	|	И СчетФактураПолученный.Контрагент = &Контрагент
	|	И НЕ СчетФактураПолученный.ПометкаУдаления";
	
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		СтрокаТаблицы.СчетФактура = Результат.Ссылка;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзмененияРеквизитовПечати(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ПечатьДокументовУНФКлиент.ОбновитьЗначенияРеквизитовПечати(ЭтотОбъект, Результат.ИзмененныеРеквизиты);
		
		Если Результат.Свойство("Команда") Тогда
			
			Подключаемый_ВыполнитьКоманду(Результат.Команда);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура вызывает обработку заполнения документа по основанию.
//
&НаСервере
Процедура ЗаполнитьПоДокументу(ДокОснование)

	Документ = РеквизитФормыВЗначение("Объект");
	Документ.Заполнить(ДокОснование);
	ЗначениеВРеквизитФормы(Документ, "Объект");
	Модифицированность = Истина;

	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта",
		Объект.ВалютаДокумента));
	Объект.Курс = ?(
		СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
	Объект.Кратность = ?(
		СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Кратность);

	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);

	Компания = Константы.УчетПоКомпании.Компания(Объект.Организация);

КонецПроцедуры

// Функция помещает табличную часть ВыданныеАвансы во временное хранилище
// и возвращает адрес.
//
&НаСервере
Функция ПоместитьВыданныеАвансыВХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(
		Объект.ВыданныеАвансы.Выгрузить(,
			"Документ,
			|Сумма"),
		УникальныйИдентификатор);
	
КонецФункции // ПоместитьВыданныеАвансыВХранилище()

&НаСервереБезКонтекста
Процедура ПолучитьДанныеПоШтрихКодам(СтруктураДанные)
	
	// Преобразование весовых штрихкодов.
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		
		РегистрыСведений.ШтрихкодыНоменклатуры.ПреобразоватьВесовойШтрихкод(ТекШтрихкод);
		
	КонецЦикла;
	
	ДанныеПоШтрихКодам = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьДанныеПоШтрихкодамВМассиве(
		СтруктураДанные.МассивШтрихкодов);
	
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		
		МассивДанныхШтрихкода = ДанныеПоШтрихкодам[ТекШтрихкод.Штрихкод];
		
		Если МассивДанныхШтрихкода <> Неопределено
			И МассивДанныхШтрихкода.Количество() <> 0 Тогда
			
			Для Каждого ДанныеШтрихкода Из МассивДанныхШтрихкода Цикл
				
				Если ДанныеШтрихкода <> Неопределено
					И ДанныеШтрихкода.Количество() <> 0 Тогда
					
					СтруктураДанныеНоменклатуры = Новый Структура();
					СтруктураДанныеНоменклатуры.Вставить("Организация", СтруктураДанные.Организация);
					СтруктураДанныеНоменклатуры.Вставить("Номенклатура", ДанныеШтрихкода.Номенклатура);
					СтруктураДанныеНоменклатуры.Вставить("ТипНоменклатуры", ДанныеШтрихкода.Номенклатура.ТипНоменклатуры);
					СтруктураДанныеНоменклатуры.Вставить("Характеристика", ДанныеШтрихкода.Характеристика);
					СтруктураДанныеНоменклатуры.Вставить("НалогообложениеНДС", СтруктураДанные.НалогообложениеНДС);
					СтруктураДанныеНоменклатуры.Вставить("ДатаОбработки", СтруктураДанные.Дата);
					ДанныеШтрихкода.Вставить("СтруктураДанныеНоменклатуры", ПолучитьДанныеНоменклатураПриИзменении(
						СтруктураДанныеНоменклатуры));
					
					Если НЕ ЗначениеЗаполнено(ДанныеШтрихкода.ЕдиницаИзмерения) Тогда
						ДанныеШтрихкода.ЕдиницаИзмерения  = ДанныеШтрихкода.Номенклатура.ЕдиницаИзмерения;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДанные.Вставить("ДанныеПоШтрихКодам", ДанныеПоШтрихКодам);
	
	Для Каждого парам Из Метаданные.Документы.АвансовыйОтчет.ТабличныеЧасти.Запасы.Реквизиты.Номенклатура.ПараметрыВыбора Цикл
		Если парам.Имя = "Отбор.ТипНоменклатуры" Тогда
			Если ТипЗнч(парам.Значение) = Тип("ФиксированныйМассив") Тогда
				СтруктураДанные.Вставить("ОтборТипНоменклатуры", парам.Значение);
			Иначе
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(парам.Значение);
				СтруктураДанные.Вставить("ОтборТипНоменклатуры", МассивТипов);
			КонецЕсли;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПолучитьДанныеПоШтрихКодам()

// Процедура обрабатывает полученные штрихкоды.
//
&НаКлиенте
Функция ЗаполнитьПоДаннымШтрихкодов(ДанныеШтрихкодов)
	
	НеизвестныеШтрихкоды = Новый Массив;
	ШтрихкодыНекорректногоТипа = Новый Массив;
	
	Если ТипЗнч(ДанныеШтрихкодов) = Тип("Массив") Тогда
		МассивШтрихкодов = ДанныеШтрихкодов;
	Иначе
		МассивШтрихкодов = Новый Массив;
		МассивШтрихкодов.Добавить(ДанныеШтрихкодов);
	КонецЕсли;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("МассивШтрихкодов", МассивШтрихкодов);
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Дата", Объект.Дата);
	СтруктураДанные.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	СтруктураДанные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	ПолучитьДанныеПоШтрихКодам(СтруктураДанные);
	
	Для Каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		ДанныеШтрихкода = СтруктураДанные.ДанныеПоШтрихкодам[ТекШтрихкод.Штрихкод];

		Если ДанныеШтрихкода.Количество() > 1 Тогда

			ПараметрыОткрытия = Новый Структура("МассивНоменклатуры, ТекШтрихкод", ДанныеШтрихкода, ТекШтрихкод);
			ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗаполнитьПоДаннымШтрихкодовЗавершение", ЭтотОбъект,
				Новый Структура("СтруктураДанные", СтруктураДанные));

			ОткрытьФорму("РегистрСведений.ШтрихкодыНоменклатуры.Форма.ДублиНоменклатурыПоШтрихКодам",
				ПараметрыОткрытия, ЭтотОбъект, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

			Продолжить;
		КонецЕсли;

		Если ДанныеШтрихкода <> Неопределено И ДанныеШтрихкода.Количество() = 0 Тогда
			
			НеизвестныеШтрихкоды.Добавить(ТекШтрихкод);
			
		ИначеЕсли СтруктураДанные.ОтборТипНоменклатуры.Найти(
			ДанныеШтрихкода[0].СтруктураДанныеНоменклатуры.ТипНоменклатуры) = Неопределено
			Или ДанныеШтрихкода[0].СтруктураДанныеНоменклатуры.ЭтоНабор Тогда
			
			ОписаниеШтрихкода = Новый Структура;
			ОписаниеШтрихкода.Вставить("Штрихкод", ТекШтрихкод.Штрихкод);
			ОписаниеШтрихкода.Вставить("Номенклатура", ДанныеШтрихкода[0].Номенклатура);
			ОписаниеШтрихкода.Вставить("ТипНоменклатуры", ДанныеШтрихкода[0].СтруктураДанныеНоменклатуры.ТипНоменклатуры);
			ОписаниеШтрихкода.Вставить("ЭтоНабор", ДанныеШтрихкода[0].СтруктураДанныеНоменклатуры.ЭтоНабор);
			
			ШтрихкодыНекорректногоТипа.Добавить(ОписаниеШтрихкода);
			
		Иначе
			
			ДанныеШтрихкода = ДанныеШтрихкода[0];
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Номенклатура", ДанныеШтрихкода.Номенклатура);
			ПараметрыОтбора.Вставить("Характеристика", ДанныеШтрихкода.Характеристика);
			ПараметрыОтбора.Вставить("Партия", ДанныеШтрихкода.Партия);
			ПараметрыОтбора.Вставить("ЕдиницаИзмерения", ДанныеШтрихкода.ЕдиницаИзмерения);
			МассивСтрокТЧ = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);
			
			Если ЗапрашиватьОбъединениеСтрок И МассивСтрокТЧ.Количество() Тогда
				ДопПараметр = Новый Структура("ЭтоПоискПоШтрихКоду, ДанныеШтрихкода, ТекШтрихкод, СтруктураДанные", Истина, ДанныеШтрихкода, ТекШтрихкод, СтруктураДанные);
				Оповещение = Новый ОписаниеОповещения("ЗапасыПодтверждениеСбросаКоличестваЗавершение", ЭтотОбъект, ДопПараметр);
				ОткрытьФорму("ОбщаяФорма.ПодтверждениеОбъединенияСтрокПриДобавленииВТабличнуюЧасть", , , , , , Оповещение);
				Возврат Новый Структура("НеизвестныеШтрихкоды, ШтрихкодыНекорректногоТипа",НеизвестныеШтрихкоды, ШтрихкодыНекорректногоТипа);
			КонецЕсли;
			
			Если МассивСтрокТЧ.Количество() = 0 Или НЕ ОбъединятьСтрокиПриДобавлении Тогда
				НоваяСтрока = Объект.Запасы.Добавить();
				НоваяСтрока.Номенклатура = ДанныеШтрихкода.Номенклатура;
				НоваяСтрока.СтавкаНДС = ПолучитьСтавкуНоменклатуры(НоваяСтрока.Номенклатура, Объект.Дата);
				НоваяСтрока.Характеристика = ДанныеШтрихкода.Характеристика;
				НоваяСтрока.Партия = ДанныеШтрихкода.Партия;
				НоваяСтрока.Количество = ТекШтрихкод.Количество;
				НоваяСтрока.ЕдиницаИзмерения = ?(ЗначениеЗаполнено(ДанныеШтрихкода.ЕдиницаИзмерения),
					ДанныеШтрихкода.ЕдиницаИзмерения, ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ЕдиницаИзмерения);
				РассчитатьСуммуВСтрокеТабличнойЧасти(НоваяСтрока);
				Элементы.Запасы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
			Иначе
				НайденнаяСтрока = МассивСтрокТЧ[0];
				НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + ТекШтрихкод.Количество;
				РассчитатьСуммуВСтрокеТабличнойЧасти(НайденнаяСтрока);
				Элементы.Запасы.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат Новый Структура("НеизвестныеШтрихкоды, ШтрихкодыНекорректногоТипа", НеизвестныеШтрихкоды,
		ШтрихкодыНекорректногоТипа);
	
КонецФункции // ЗаполнитьПоДаннымШтрихкодов()

&НаКлиенте
Процедура ЗаполнитьПоДаннымШтрихкодовЗавершение(СтруктураНоменклатуры, Параметры) Экспорт
	
	ОбработкаПослеУточненияОбъединенияКоличества = Параметры.Свойство("ОбработкаПослеУточненияОбъединенияКоличества")
		И Параметры.ОбработкаПослеУточненияОбъединенияКоличества;
	
	Если ОбработкаПослеУточненияОбъединенияКоличества Тогда
		ДанныеШтрихкода = Параметры.ДанныеШтрихкода;
		ТекШтрихкод = Параметры.ТекШтрихкод;
		СтруктураДанные = Параметры.СтруктураДанные;
	Иначе
		
		Если СтруктураНоменклатуры = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ДанныеШтрихкода = СтруктураНоменклатуры.МассивНоменклатуры[0];
		ТекШтрихкод = СтруктураНоменклатуры.ТекШтрихкод;
		СтруктураДанные = Параметры.СтруктураДанные;
		
	КонецЕсли;
	
	ШтрихкодыНекорректногоТипа = Новый Массив;
	
	Если СтруктураДанные.ОтборТипНоменклатуры.Найти(ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ТипНоменклатуры) = Неопределено 
		ИЛИ ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ЭтоНабор Тогда
		ОписаниеШтрихкода = Новый Структура;
		ОписаниеШтрихкода.Вставить("Штрихкод", ТекШтрихкод.Штрихкод);
		ОписаниеШтрихкода.Вставить("Номенклатура", ДанныеШтрихкода.Номенклатура);
		ОписаниеШтрихкода.Вставить("ТипНоменклатуры", ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ТипНоменклатуры);
		ОписаниеШтрихкода.Вставить("ЭтоНабор", ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ЭтоНабор);
		ШтрихкодыНекорректногоТипа.Добавить(ОписаниеШтрихкода);
	Иначе
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номенклатура", ДанныеШтрихкода.Номенклатура);
		ПараметрыОтбора.Вставить("Характеристика", ДанныеШтрихкода.Характеристика);
		ПараметрыОтбора.Вставить("Партия", ДанныеШтрихкода.Партия);
		ПараметрыОтбора.Вставить("ЕдиницаИзмерения", ДанныеШтрихкода.ЕдиницаИзмерения);
		МассивСтрокТЧ = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);
		
		Если МассивСтрокТЧ.Количество() И ЗапрашиватьОбъединениеСтрок И Не ОбработкаПослеУточненияОбъединенияКоличества Тогда
			ДопПараметр = Новый Структура("ЭтоПоискПоШтрихКоду, ДанныеШтрихкода, ТекШтрихкод, СтруктураДанные", Истина, ДанныеШтрихкода, ТекШтрихкод, СтруктураДанные);
			Оповещение = Новый ОписаниеОповещения("ЗапасыПодтверждениеСбросаКоличестваЗавершение", ЭтотОбъект, ДопПараметр);
			ОткрытьФорму("ОбщаяФорма.ПодтверждениеОбъединенияСтрокПриДобавленииВТабличнуюЧасть", , , , , , Оповещение);
			Возврат;
		КонецЕсли;
		
		Если МассивСтрокТЧ.Количество() = 0 Или НЕ ОбъединятьСтрокиПриДобавлении Тогда
			НоваяСтрока = Объект.Запасы.Добавить();
			НоваяСтрока.Номенклатура = ДанныеШтрихкода.Номенклатура;
			НоваяСтрока.СтавкаНДС = ПолучитьСтавкуНоменклатуры(НоваяСтрока.Номенклатура, Объект.Дата);
			НоваяСтрока.Характеристика = ДанныеШтрихкода.Характеристика;
			НоваяСтрока.Партия = ДанныеШтрихкода.Партия;
			НоваяСтрока.Количество = ТекШтрихкод.Количество;
			НоваяСтрока.ЕдиницаИзмерения = ?(ЗначениеЗаполнено(ДанныеШтрихкода.ЕдиницаИзмерения), ДанныеШтрихкода.ЕдиницаИзмерения, ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ЕдиницаИзмерения);
			РассчитатьСуммуВСтрокеТабличнойЧасти(НоваяСтрока);
			Элементы.Запасы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		Иначе
			НайденнаяСтрока = МассивСтрокТЧ[0];
			НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + ТекШтрихкод.Количество;
			РассчитатьСуммуВСтрокеТабличнойЧасти(НайденнаяСтрока);
			Элементы.Запасы.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
		
	ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	ЗаполнитьПризнакиИспользованияХарактеристик();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкоды(ДанныеШтрихкодов) Экспорт
	
	Модифицированность = Истина;
	
	Если ТипЗнч(ДанныеШтрихкодов) = Тип("Массив") Тогда
		МассивШтрихкодов = ДанныеШтрихкодов;
	Иначе
		МассивШтрихкодов = Новый Массив;
		МассивШтрихкодов.Добавить(ДанныеШтрихкодов);
	КонецЕсли; 
	Для Каждого ТекШтрихкод Из МассивШтрихкодов Цикл
		ДополнительныеДанныеПоШтрихкоду = ШтрихкодированиеУНФКлиент.ДополнительныеДанныеПоШтрихкоду(ТекШтрихкод.Штрихкод, ТипЗнч(Объект.Ссылка));
		Если ДополнительныеДанныеПоШтрихкоду.ЭтоКодМаркировки Тогда 
			ОбщегоНазначенияКлиент.СообщитьПользователю(ДополнительныеДанныеПоШтрихкоду.ТекстСообщения);
			Возврат;
		КонецЕсли; 
		Если ДополнительныеДанныеПоШтрихкоду.ЕстьРазделительGS1 Тогда 
			ТекШтрихкод.Штрихкод = ДополнительныеДанныеПоШтрихкоду.ПредставлениеШтрихкода;		
		КонецЕсли;
	КонецЦикла;
	
	НеДобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихкодов(ДанныеШтрихкодов);
	НеизвестныеШтрихкоды		= НеДобавленныеШтрихкоды.НеизвестныеШтрихкоды;
	ШтрихкодыНекорректногоТипа	= НеДобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
	
	ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	
	Если НеизвестныеШтрихкоды.Количество() > 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПолученыШтрихкодыЗавершение", ЭтотОбъект, НеизвестныеШтрихкоды);
		
		ОткрытьФорму(
			"РегистрСведений.ШтрихкодыНоменклатуры.Форма.РегистрацияШтрихкодовНоменклатуры",
			Новый Структура("НеизвестныеШтрихкоды", НеизвестныеШтрихкоды), ЭтотОбъект,,,,Оповещение);
		
		Возврат;
		
	КонецЕсли;
	
	ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	
КонецПроцедуры // ПолученыШтрихкоды()

&НаКлиенте
Процедура ПолученыШтрихкодыЗавершение(ВозвращаемыеПараметры, Параметры) Экспорт
	
	НеизвестныеШтрихкоды = Параметры;
	
	Если ВозвращаемыеПараметры <> Неопределено Тогда
		
		МассивШтрихкодов = Новый Массив;
		
		Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ЗарегистрированныеШтрихкоды Цикл
			МассивШтрихкодов.Добавить(ЭлементМассива);
		КонецЦикла;
		
		Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ПолученыНовыеШтрихкоды Цикл
			МассивШтрихкодов.Добавить(ЭлементМассива);
		КонецЦикла;
		
		НеДобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихкодов(МассивШтрихкодов);
		НеизвестныеШтрихкоды		= НеДобавленныеШтрихкоды.НеизвестныеШтрихкоды;
		ШтрихкодыНекорректногоТипа	= НеДобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
		ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	КонецЕсли;
	
	ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды) Экспорт
	
	Для каждого ТекНеизвестныйШтрихкод Из НеизвестныеШтрихкоды Цикл
		
		СтрокаСообщения = НСтр("ru = 'Данные по штрихкоду не найдены: %1%; количество: %2%'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНеизвестныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНеизвестныйШтрихкод.Количество);
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
		
	КонецЦикла;
	
	ЗаполнитьПризнакиИспользованияХарактеристик();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПризнакиИспользованияХарактеристик()
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа) Экспорт
	
	Для каждого ТекНекорректныйШтрихкод Из ШтрихкодыНекорректногоТипа Цикл
		
		СтрокаСообщения = НСтр("ru = 'Найденная по штрихкоду %1% номенклатура -%2%- имеет тип %3%, который не подходит для этой табличной части'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНекорректныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНекорректныйШтрихкод.Номенклатура);
		Если ТекНекорректныйШтрихкод.Свойство("ЭтоНабор") И ТекНекорректныйШтрихкод.ЭтоНабор Тогда
			// Наборы
			СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%3%", НСтр("ru = 'Набор'"));
		Иначе
			СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%3%", ТекНекорректныйШтрихкод.ТипНоменклатуры);
		КонецЕсли; 
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
		
	КонецЦикла;
	
КонецПроцедуры

// Функция получает табличную часть ВыданныеАвансы из временного хранилища.
//
&НаСервере
Процедура ПолучитВыданныеАвансыИзХранилища(АдресВыданныеАвансыВХранилище)
	
	ТаблицаВыданныеАвансы = ПолучитьИзВременногоХранилища(АдресВыданныеАвансыВХранилище);
	Объект.ВыданныеАвансы.Очистить();
	Для каждого СтрокаВыданныеАвансы Из ТаблицаВыданныеАвансы Цикл
		Строка = Объект.ВыданныеАвансы.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, СтрокаВыданныеАвансы);
	КонецЦикла;
	
КонецПроцедуры // ПолучитВыданныеАвансыИзХранилища()

// Процедура пересчитывает курс и кратность валюты документа при изменении
// даты документа.
//
&НаКлиенте
Процедура ПересчитатьКурсКратностьВалютыДокумента(СтруктураДанные)

	КурсНовый = ?(СтруктураДанные.ВалютаКурсКратность.Курс = 0, 1, СтруктураДанные.ВалютаКурсКратность.Курс);
	КратностьНовый = ?(СтруктураДанные.ВалютаКурсКратность.Кратность = 0, 1,
		СтруктураДанные.ВалютаКурсКратность.Кратность);

	Если Объект.Курс <> КурсНовый Или Объект.Кратность <> КратностьНовый Тогда

		КурсВалютыСтрокой = СтрШаблон("%1 %2 = %3 %4", Объект.Кратность, СокрЛП(Объект.ВалютаДокумента), Объект.Курс,
			СокрЛП(НациональнаяВалюта));
			
		КурсНовыйВалютыСтрокой = СтрШаблон("%1 %2 = %3 %4", КратностьНовый, СокрЛП(Объект.ВалютаДокумента), КурсНовый,
			СокрЛП(НациональнаяВалюта));

		ТекстСообщения = СтрШаблон(
		НСтр("ru = 'На дату документа у валюты документа (%1) был задан курс.
			|Установить курс документа (%2) в соответствии с курсом валюты?'"), КурсВалютыСтрокой, КурсНовыйВалютыСтрокой);

		Режим = РежимДиалогаВопрос.ДаНет;

		ПоказатьВопрос(Новый ОписаниеОповещения("ПересчитатьКурсКратностьВалютыДокументаЗавершение", ЭтотОбъект,
			Новый Структура("КратностьНовый, КурсНовый", КратностьНовый, КурсНовый)), ТекстСообщения, Режим, 0);
		Возврат;

	КонецЕсли;
	
	// Сформируем надпись цены и валюты.
	ПересчитатьКурсКратностьВалютыДокументаФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьКурсКратностьВалютыДокументаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	КратностьНовый = ДополнительныеПараметры.КратностьНовый;
	КурсНовый = ДополнительныеПараметры.КурсНовый;
	
	
	Ответ = Результат;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Объект.Курс = КурсНовый;
		Объект.Кратность = КратностьНовый;
		
	КонецЕсли;
	
	
	ПересчитатьКурсКратностьВалютыДокументаФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьКурсКратностьВалютыДокументаФрагмент()
	
	ПоляНадписи = Новый Структура;
	ПоляНадписи.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	ПоляНадписи.Вставить("Курс", Объект.Курс);
	ПоляНадписи.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	ПоляНадписи.Вставить("УчетВалютныхОпераций", УчетВалютныхОпераций);
	ПоляНадписи.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	ВалютаДокумента = СформироватьНадписьЦеныИВалюта(ПоляНадписи);

КонецПроцедуры // ПересчитатьКурсКратностьВалютыДокумента()

// Процедура выполняет пересчет в табличной части документа после изменений 
// в форме "Цены и валюта". Выполняется пересчет колонок: цена, скидка, сумма,
// сумма НДС, всего.
//
&НаКлиенте
Процедура ОбработатьИзмененияПоКнопкеРедактироватьВалюту()

	ПараметрыРедактированияВалюты = Новый Структура;

	ПараметрыРедактированияВалюты.Вставить("ДатаДокумента"				, Объект.Дата);
	ПараметрыРедактированияВалюты.Вставить("ВалютаДокумента"			, Объект.ВалютаДокумента);
	ПараметрыРедактированияВалюты.Вставить("НалогообложениеНДС"			, Объект.НалогообложениеНДС);
	ПараметрыРедактированияВалюты.Вставить("СуммаВключаетНДС"			, Объект.СуммаВключаетНДС);
	ПараметрыРедактированияВалюты.Вставить("НДСВключатьВСтоимость"		, Объект.НДСВключатьВСтоимость);
	ПараметрыРедактированияВалюты.Вставить("ПересчитатьЦеныПоВалюте"	, Ложь);
	ПараметрыРедактированияВалюты.Вставить("Курс"						, Объект.Курс);
	ПараметрыРедактированияВалюты.Вставить("Кратность"					, Объект.Кратность);  
	
    ПараметрыРедактированияВалюты.Вставить("РегистрироватьЦеныПоставщика", Объект.РегистрироватьЦеныПоставщика);
	ПараметрыРедактированияВалюты.Вставить("ВидЦенКонтрагента"			 , ВидЦенКонтрагентаДоговора);

	ОткрытьФорму("ОбщаяФорма.ФормаВалюта", ПараметрыРедактированияВалюты, , , , ,
		Новый ОписаниеОповещения("ОбработатьИзмененияПоКнопкеРедактироватьВалютуЗавершение", ЭтотОбъект,
		Новый Структура("ПараметрыРедактированияВалюты", ПараметрыРедактированияВалюты)));

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзмененияПоКнопкеРедактироватьВалютуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПараметрыРедактированияВалюты = ДополнительныеПараметры.ПараметрыРедактированияВалюты;
	
	СтруктураВозврата = Результат;
	
	Если НЕ ЗначениеЗаполнено(СтруктураВозврата)
		ИЛИ НЕ СтруктураВозврата.БылиВнесеныИзменения
		ИЛИ СтруктураВозврата.КодВозвратаДиалога = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект, СтруктураВозврата);
	
	// Очистка табличной части выданные авансы.
	Если ПараметрыРедактированияВалюты.ВалютаДокумента <> СтруктураВозврата.ВалютаДокумента Тогда
		Объект.ВыданныеАвансы.Очистить();
	КонецЕсли;
	
	// Пересчитываем цены по валюте.
	Если СтруктураВозврата.ПересчитатьЦеныПоВалюте Тогда
		ЦенообразованиеКлиент.ПересчитатьЦеныТабличнойЧастиПоВалюте(ЭтотОбъект, ПараметрыРедактированияВалюты.ВалютаДокумента, "Запасы", СтруктураВозврата.КурсПересчетаЦен);
		ЦенообразованиеКлиент.ПересчитатьЦеныТабличнойЧастиПоВалюте(ЭтотОбъект, ПараметрыРедактированияВалюты.ВалютаДокумента, "Расходы", СтруктураВозврата.КурсПересчетаЦен);
	КонецЕсли;
	
	// Пересчитываем сумму если изменился признак Налогообложение НДС.
	Если НЕ СтруктураВозврата.НалогообложениеНДС = СтруктураВозврата.ПредНалогообложениеНДС Тогда
		ЗаполнитьСтавкуНДСПоНалогообложениеНДС();
	КонецЕсли;
	
	// Пересчитываем сумму если изменился признак "Сумма включает НДС".
	Если НЕ Объект.СуммаВключаетНДС = ПараметрыРедактированияВалюты.СуммаВключаетНДС Тогда
		ЦенообразованиеКлиент.ПересчитаемСуммуТабличнойЧастиПоФлагуСуммаВключаетНДС(ЭтотОбъект, "Запасы");
		ЦенообразованиеКлиент.ПересчитаемСуммуТабличнойЧастиПоФлагуСуммаВключаетНДС(ЭтотОбъект, "Расходы");
	КонецЕсли;
	
	Для каждого СтрокаОплата Из Объект.Оплаты Цикл
		РассчитатьСуммуПлатежа(СтрокаОплата);
	КонецЦикла;
	
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
	
	// Сформируем надпись цены и валюты.
	ПоляНадписи = Новый Структура;
	ПоляНадписи.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	ПоляНадписи.Вставить("Курс", Объект.Курс);
	ПоляНадписи.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	ПоляНадписи.Вставить("УчетВалютныхОпераций", УчетВалютныхОпераций);
	ПоляНадписи.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	ВалютаДокумента = СформироватьНадписьЦеныИВалюта(ПоляНадписи);

КонецПроцедуры // ОбработатьИзмененияПоКнопкеРедактироватьВалюту()

// Выполняем пересчет суммы платежа в переданной строке табличной части.
//
&НаКлиенте
Процедура РассчитатьСуммуПлатежа(СтрокаТабличнойЧасти)
	
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
		1,
		СтрокаТабличнойЧасти.Курс);
	СтрокаТабличнойЧасти.Кратность = ?(
		СтрокаТабличнойЧасти.Кратность = 0,
		1,
		СтрокаТабличнойЧасти.Кратность);
	
	СтрокаТабличнойЧасти.СуммаПлатежа = ВалютыУНФКлиентСервер.Пересчитать(СтрокаТабличнойЧасти.СуммаРасчетов,
		СтрокаТабличнойЧасти.Курс, Объект.Курс, СтрокаТабличнойЧасти.Кратность, Объект.Кратность);
	
КонецПроцедуры // РассчитатьСуммуПлатежа()

// Процедура рассчитывает сумму в строке табличной части.
//
&НаКлиенте
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти = Неопределено)
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	КонецЕсли;
	
	ПараметрыРасчета = Новый Структура("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	ТабличныеЧастиУНФКлиент.РассчитатьСуммыВСтрокеТЧ(СтрокаТабличнойЧасти, ПараметрыРасчета);

	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
	
КонецПроцедуры // РассчитатьСуммуВСтрокеТабличнойЧасти()

&НаСервере
Процедура ДатаПриИзмененииНаСервере(ДанныеДляИзмененияДаты)
	
	ДокументыУНФ.ДатаПриИзменении(ДанныеДляИзмененияДаты, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ДокументыУНФ.ОрганизацияПриИзменении(ЭтотОбъект, Объект);
	ОпределитьВидимостьНастроекУчетаВНалогообложении();
	
КонецПроцедуры

// Процедура заполняет Ставку НДС в табличной части по системе налогообложения.
//
&НаСервере
Процедура ЗаполнитьСтавкуНДСПоНалогообложениеНДС()
	
	НоменклатураВДокументахСервер.ОбновитьСтавкуНДСТабличнойЧасти(Объект, "Запасы", Ложь);
	НоменклатураВДокументахСервер.ОбновитьСтавкуНДСТабличнойЧасти(Объект, "Расходы", Ложь);
	
	УстановитьВидимостьПоНалогообложению();
	
КонецПроцедуры // ЗаполнитьСтавкуНДСПоНалогообложениеНДС()

// Получает набор данных с сервера для процедуры НоменклатураПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные)
	
	СтруктураДанные.Вставить("СтруктурнаяЕдиница", СтруктураДанные.Номенклатура.Склад);
	СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдиницаИзмерения);
	// Наборы
	СтруктураДанные.Вставить("ЭтоНабор", СтруктураДанные.Номенклатура.ЭтоНабор);
	
	ДанныеНДС = НоменклатураВДокументахСервер.ДанныеНДССтрокиНоменклатуры(СтруктураДанные);
	СтруктураДанные.Вставить("СтавкаНДС", ДанныеНДС.СтавкаНДС);
	
	СтруктураДанные.Вставить("ОчиститьЗаказИПодразделение", Ложь);
	СтруктураДанные.Вставить("ОчиститьНаправлениеДеятельности", Ложь);
	
	Если СтруктураДанные.Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Расходы
	   И СтруктураДанные.Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Доходы
	   И СтруктураДанные.Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.НезавершенноеПроизводство
	   И СтруктураДанные.Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда
		СтруктураДанные.ОчиститьЗаказИПодразделение = Истина;
	КонецЕсли;
	
	Если СтруктураДанные.Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Расходы
	   И СтруктураДанные.Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.СебестоимостьПродаж
	   И СтруктураДанные.Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Доходы Тогда
		СтруктураДанные.ОчиститьНаправлениеДеятельности = Истина;
	КонецЕсли;
	
	// Характеристики
	СтруктураДанные.Вставить("ИспользоватьХарактеристики",Ложь);
	СтруктураДанные.Вставить("ПроверятьЗаполнениеХарактеристики",Ложь);
	
	Если ЗначениеЗаполнено(СтруктураДанные.Номенклатура) И СтруктураДанные.Номенклатура.ИспользоватьХарактеристики
		Тогда
		ЗначенияПоУмолчанию = НоменклатураВДокументахСервер.ЗначенияНоменклатурыПоУмолчанию(СтруктураДанные.Номенклатура);
		
		Если Не ЗначенияПоУмолчанию = Неопределено
			Тогда
			ХарактеристикаПоУмолчанию = ЗначенияПоУмолчанию;
		КонецЕсли;
		
		Если НЕ СтруктураДанные.Свойство("Характеристика") Тогда
			СтруктураДанные.Вставить("Характеристика",ХарактеристикаПоУмолчанию);
		Иначе
			СтруктураДанные.Характеристика = ?(ЗначениеЗаполнено(СтруктураДанные.Характеристика), СтруктураДанные.Характеристика, ХарактеристикаПоУмолчанию);
		КонецЕсли;
		
		СтруктураДанные.Вставить("ИспользоватьХарактеристики",Истина);
		СтруктураДанные.Вставить("ПроверятьЗаполнениеХарактеристики",СтруктураДанные.Номенклатура.ПроверятьЗаполнениеХарактеристики);
	КонецЕсли; 
	// Конец Характеристики
	
	//Партии
	СтруктураДанные.Вставить("ИспользоватьПартии",Ложь);
	СтруктураДанные.Вставить("ПроверятьЗаполнениеПартий",Ложь);
	
	Если НЕ СтруктураДанные.Свойство("Партия") Тогда
		СтруктураДанные.Вставить("Партия", Неопределено);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДанные.Номенклатура) И СтруктураДанные.Номенклатура.ИспользоватьПартии
		Тогда
		
		Если Не СтруктураДанные.Свойство("ВидОперации")
			Тогда
			ВидОперации = Неопределено
		Иначе
			ВидОперации = СтруктураДанные.ВидОперации
		КонецЕсли;
		
		СтатусПартии = НоменклатураВДокументахСервер.СоответствиеВидаОперацииИлиХозОперацииСтатусуПартии(, ВидОперации);
		ЗначенияПартииПоУмолчанию = НоменклатураВДокументахСервер.ЗначенияПартийНоменклатурыПоУмолчанию(СтруктураДанные.Номенклатура,СтатусПартии);
		
		ПартияПоУмолчанию = Справочники.ПартииНоменклатуры.ПустаяСсылка();
		
		Если Не ЗначенияПартииПоУмолчанию = Неопределено
			Тогда
			ПартияПоУмолчанию = ЗначенияПартииПоУмолчанию;
		КонецЕсли;
		
		СтруктураДанные.Партия = ?(ЗначениеЗаполнено(СтруктураДанные.Партия), СтруктураДанные.Партия, ПартияПоУмолчанию);
		
		СтруктураДанные.ПроверятьЗаполнениеПартий = СтруктураДанные.Номенклатура.ПроверятьЗаполнениеПартий;
		СтруктураДанные.ИспользоватьПартии = Истина;
		
	КонецЕсли;
	// Конец Партии
	
	СтруктураДанные.Вставить("ЗапретитьВводДробногоКоличества", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураДанные.Номенклатура, "ЗапретитьВводДробногоКоличества"));
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()

// Получает набор данных с сервера для процедуры ЕдиницаИзмеренияПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеЕдиницаИзмеренияПриИзменении(ТекущаяЕдиницаИзмерения = Неопределено, ЕдиницаИзмерения = Неопределено)
	
	СтруктураДанные = Новый Структура();
	
	Если ТекущаяЕдиницаИзмерения = Неопределено Тогда
		СтруктураДанные.Вставить("ТекущийКоэффициент", 1);
	Иначе
		СтруктураДанные.Вставить("ТекущийКоэффициент", ТекущаяЕдиницаИзмерения.Коэффициент);
	КонецЕсли;
	
	Если ЕдиницаИзмерения = Неопределено Тогда
		СтруктураДанные.Вставить("Коэффициент", 1);
	Иначе	
		СтруктураДанные.Вставить("Коэффициент", ЕдиницаИзмерения.Коэффициент);
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеЕдиницаИзмеренияПриИзменении()

// Получает набор данных с сервера для процедуры ДоговорПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеОплатыДоговорПриИзменении(Дата, Договор)
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить(
		"ДоговорВалютаКурсКратность",
		РегистрыСведений.КурсыВалют.ПолучитьПоследнее(
			Дата,
			Новый Структура("Валюта", Договор.ВалютаРасчетов)));
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеОплатыДоговорПриИзменении()

// Получает набор данных с сервера для процедуры КонтрагентПриИзменении.
//
&НаСервере
Функция ПолучитьДанныеКонтрагентПриИзменении(Дата, Контрагент, Организация)
	
	СтруктураДанные = Новый Структура;
	
	Договор = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(Контрагент);
	СтруктураДанные.Вставить("Договор", Договор);
	
	СтруктураДанные.Вставить("ВестиРасчетыПоДоговорам", Контрагент.ВестиРасчетыПоДоговорам);
	СтруктураДанные.Вставить("ВестиРасчетыПоДокументам", Контрагент.ВестиРасчетыПоДокументам);
	СтруктураДанные.Вставить("ВестиРасчетыПоЗаказам", Контрагент.ВестиРасчетыПоЗаказам);
	СтруктураДанные.Вставить("ВестиУчетОплатыПоСчетам", Контрагент.ВестиУчетОплатыПоСчетам);
	
	СтруктураДанные.Вставить(
		"ДоговорВалютаКурсКратность",
		РегистрыСведений.КурсыВалют.ПолучитьПоследнее(
			Дата,
			Новый Структура("Валюта", Договор.ВалютаРасчетов)));
	
	УстановитьВидимостьРеквизитовРасчетов(
		Контрагент.ВестиРасчетыПоДоговорам,
		Контрагент.ВестиРасчетыПоДокументам,
		Контрагент.ВестиРасчетыПоЗаказам,
		Контрагент.ВестиУчетОплатыПоСчетам);
	
	Возврат СтруктураДанные;
	
КонецФункции

// Получает набор данных с сервера для процедуры ЕдиницаИзмеренияПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеНаправлениеДеятельностиНачалоВыбора(Номенклатура)
	
	СтруктураДанные = Новый Структура;
	
	ВозможностьУказанияНаправленияДеятельности = Истина;
	
	Если Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Расходы
	   И Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.СебестоимостьПродаж
	   И Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Доходы Тогда
		ВозможностьУказанияНаправленияДеятельности = Ложь;
	КонецЕсли;
	
	СтруктураДанные.Вставить("ВозможностьУказанияНаправленияДеятельности", ВозможностьУказанияНаправленияДеятельности);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНаправлениеДеятельностиНачалоВыбора()

// Получает набор данных с сервера для процедуры ЕдиницаИзмеренияПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеСтруктурнаяЕдиницаНачалоВыбора(Номенклатура)
	
	СтруктураДанные = Новый Структура;
	
	ВозможностьУказанияПодразделения = Истина;
	
	Если Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Расходы
		И Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Доходы
		И Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.НезавершенноеПроизводство
		И Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда
		ВозможностьУказанияПодразделения = Ложь;
	КонецЕсли;
	
	СтруктураДанные.Вставить("ВозможностьУказанияПодразделения", ВозможностьУказанияПодразделения);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеСтруктурнаяЕдиницаНачалоВыбора()

// Получает набор данных с сервера для процедуры ЕдиницаИзмеренияПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеЗаказНачалоВыбора(Номенклатура)
	
	СтруктураДанные = Новый Структура;
	
	ВозможностьУказанияЗаказа = Истина;
	
	Если Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Расходы
		И Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Доходы
		И Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.НезавершенноеПроизводство
		И Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда
		ВозможностьУказанияЗаказа = Ложь;
	КонецЕсли;
	
	СтруктураДанные.Вставить("ВозможностьУказанияЗаказа", ВозможностьУказанияЗаказа);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеСтруктурнаяЕдиницаНачалоВыбора()

// Функция возвращает текст надписи "Цены и валюта".
//
&НаКлиентеНаСервереБезКонтекста
Функция СформироватьНадписьЦеныИВалюта(ПоляНадписи)
	
	ТекстНадписи = "";
	
	// Валюта.
	Если ПоляНадписи.УчетВалютныхОпераций Тогда
		Если ЗначениеЗаполнено(ПоляНадписи.ВалютаДокумента) Тогда
			ТекстНадписи = НСтр("ru = '%Валюта%'");
			Если ПоляНадписи.ВалютаДокумента <> УправлениеНебольшойФирмойПовтИсп.ПолучитьНациональнуюВалюту() Тогда
				ТекстНадписи = ТекстНадписи + НСтр("ru = ' %Курс%'");
				ТекстНадписи = СтрЗаменить(ТекстНадписи, "%Валюта%", СокрЛП(
					УправлениеНебольшойФирмойПовтИсп.ПолучитьСимвольноеПредставлениеВалюты(
					ПоляНадписи.ВалютаДокумента)));
				ТекстНадписи = СтрЗаменить(ТекстНадписи, "%Курс%", СокрЛП(Строка(ПоляНадписи.Курс)));
			Иначе
				ТекстНадписи = СтрЗаменить(ТекстНадписи, "%Валюта%", СокрЛП(Строка(ПоляНадписи.ВалютаДокумента)));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Налогообложение НДС.
	Если ЗначениеЗаполнено(ПоляНадписи.НалогообложениеНДС) Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ru = '%НалогообложениеНДС%'");
		Иначе
			ТекстНадписи = ТекстНадписи + НСтр("ru = ' • %НалогообложениеНДС%'");
		КонецЕсли;
		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%НалогообложениеНДС%",
			РаботаСФормойДокументаКлиентСервер.КраткоеПредставлениеТипаНалогообложенияНДС(
			ПоляНадписи.НалогообложениеНДС));
	КонецЕсли;
	
	// Флаг сумма включает НДС.
	Если ПустаяСтрока(ТекстНадписи) Тогда
		Если ПоляНадписи.СуммаВключаетНДС Тогда
			ТекстНадписи = НСтр("ru = 'Сумма включает НДС'");
		Иначе
			ТекстНадписи = НСтр("ru = 'Сумма не включает НДС'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекстНадписи;
	
КонецФункции // СформироватьНадписьЦеныИВалюта()

// Процедура заполняет служебные реквизиты.
//
&НаСервереБезКонтекста
Процедура ЗаполнитьСлужебныеРеквизитыПоКонтрагентуВКоллекции(КоллекцияДанных)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Таблица.НомерСтроки КАК ЧИСЛО) КАК НомерСтроки,
	|	Таблица.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ТаблицаКонтрагента
	|ИЗ
	|	&КоллекцияДанных КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаКонтрагента.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
	|	ТаблицаКонтрагента.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ТаблицаКонтрагента.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
	|	ТаблицаКонтрагента.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам
	|ИЗ
	|	ТаблицаКонтрагента КАК ТаблицаКонтрагента";
	
	Запрос.УстановитьПараметр("КоллекцияДанных", КоллекцияДанных.Выгрузить( ,"НомерСтроки, Контрагент"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Для Сч = 0 По КоллекцияДанных.Количество() - 1 Цикл
		Выборка.Следующий(); // Количество строк в выборке по запросу всегда равно количеству строк в коллекции
		ЗаполнитьЗначенияСвойств(КоллекцияДанных[Сч], Выборка, "ВестиРасчетыПоДоговорам, ВестиРасчетыПоДокументам, ВестиРасчетыПоЗаказам, ВестиУчетОплатыПоСчетам");
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьСлужебныеРеквизитыПоКонтрагентуВКоллекции()

&НаСервере
Процедура ОпределитьВидимостьНастроекУчетаВНалогообложении()
	
	Если РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Объект.Организация) Тогда
		Элементы.ГруппаУчетВНУ.Видимость = Ложь;
		
		Возврат;
	Иначе
		Элементы.ГруппаУчетВНУ.Видимость = Истина;
	КонецЕсли;
	
	СистемаНалогообложенияСтруктура = РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(Объект.Организация, Объект.Дата);
	
	Если Не СистемаНалогообложенияСтруктура.ПлательщикУСН Тогда
		Элементы.ГруппаУчетВНУ.Видимость = Ложь;
	Иначе
		Элементы.ГруппаУчетВНУ.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ЗапасыТоварыНеДляПродажи.Видимость = Элементы.ГруппаУчетВНУ.Видимость;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстСодержания(Знач Номенклатура, Знач Характеристика)
	Возврат ТабличныеЧастиУНФ.ТекстСодержания(Номенклатура, Характеристика);
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуРеквизитыПечати()

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзмененияРеквизитовПечати", ЭтотОбъект);
	ОткрытьФорму("Обработка.РеквизитыПечати.Форма.РеквизитыПечатиАвансовыйОтчет", Новый Структура("КонтекстПечати",
		Объект), ЭтотОбъект, , , , ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройки(ПередаватьВидДокумента)

	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ВидДокумента", НСтр("ru = 'авансовый отчет'"));
	
	СтруктураПараметров.Вставить("ПоказыватьКолонкуСодержаниеВАвансовомОтчетеЗапасы",
		ПоказыватьКолонкуСодержаниеВАвансовомОтчетеЗапасы);
	СтруктураПараметров.Вставить("ПоказыватьКолонкуСодержаниеВАвансовомОтчетеРасходы", 
		ПоказыватьКолонкуСодержаниеВАвансовомОтчетеРасходы);
	
	СтруктураПараметров.Вставить("БылиВнесеныИзменения", Ложь);
	СтруктураПараметров.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	
	ПоложениеСчетФактурыНаФорме = ?(Объект.СчетФактураВТабличнойЧастиДокумента, ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти")
									, ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВШапке"));
									
	СтруктураПараметров.Вставить("ПоложениеСчетФактурыНаФорме", ПоложениеСчетФактурыНаФорме);
	
	ВидимостьПоложенияСчетфактуры = Новый Структура("ПоложениеДокументаПоступления", Не Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС"));
	СтруктураПараметров.Вставить("Видимость", ВидимостьПоложенияСчетфактуры);
	
	Если ИспользоватьПроекты Тогда
		СтруктураПараметров.Вставить("ПоложениеПроекта", Объект.ПоложениеПроекта);
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ШапкаТабличнаяЧасть", СтруктураПараметров, , , , , 
		Новый ОписаниеОповещения("ШапкаТабличнаяЧастьЗавершение", ЭтотОбъект));
		
КонецПроцедуры

&НаКлиенте
Процедура ШапкаТабличнаяЧастьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.БылиВнесеныИзменения Тогда
		
		ПоказыватьКолонкуСодержаниеВАвансовомОтчетеЗапасы = Результат.ПоказыватьКолонкуСодержаниеВАвансовомОтчетеЗапасы;
		ПоказыватьКолонкуСодержаниеВАвансовомОтчетеРасходы = Результат.ПоказыватьКолонкуСодержаниеВАвансовомОтчетеРасходы;
		Если Результат.Свойство("ПоложениеПроекта") Тогда
			Если Объект.ПоложениеПроекта <> Результат.ПоложениеПроекта Тогда
				Объект.ПоложениеПроекта = Результат.ПоложениеПроекта;
				ЗаполнениеОбъектовУНФКлиент.ОбработатьИзменениеПоложения(Объект, "Расходы", "Проект", "ПоложениеПроекта");
			КонецЕсли;
		КонецЕсли;
		
		Если Результат.Свойство("ПоложениеСчетФактурыНаФорме") Тогда
			
			СчетФактураВТабличнойЧасти = Результат.ПоложениеСчетФактурыНаФорме = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти");
			
			Если НЕ Объект.СчетФактураВТабличнойЧастиДокумента = СчетФактураВТабличнойЧасти Тогда
				
				Объект.СчетФактураВТабличнойЧастиДокумента = СчетФактураВТабличнойЧасти;
				СчетФактураВТабличнойЧастиДокументаПриИзменении(Неопределено);
				УстановитьВидимостьПолейСозданияСчетФактуры();
				
				ЭтаФорма.Модифицированность = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьВидимостьОтПользовательскихНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПолейСозданияСчетФактуры()
	
	Если Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС") Тогда	

		Элементы.СчетФактураНадпись.Видимость = НЕ Объект.СчетФактураВТабличнойЧастиДокумента;
		Элементы.ГруппаДанныеКонтрагента.Видимость = НЕ Объект.СчетФактураВТабличнойЧастиДокумента;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСчетФактураНомерДата", "Видимость"
		, НЕ Объект.СчетФактураВТабличнойЧастиДокумента И Элементы.СчетФактураНадпись.Видимость И Не ЗначениеЗаполнено(КэшЗначений.СчетФактураСсылка));
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыПредъявленСФ", "Видимость", Объект.СчетФактураВТабличнойЧастиДокумента);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыГруппаСчетФактура", "Видимость", Объект.СчетФактураВТабличнойЧастиДокумента);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасходыПредъявленСФ", "Видимость", Объект.СчетФактураВТабличнойЧастиДокумента);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасходыГруппаСчетФактура", "Видимость", Объект.СчетФактураВТабличнойЧастиДокумента);
		
	Иначе

		Если Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.НаЭкспорт") Тогда
			Элементы.СчетФактураНадпись.Видимость = Истина;
		Иначе
			Элементы.СчетФактураНадпись.Видимость = Ложь;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСчетФактураНомерДата", "Видимость"
		, НЕ Объект.СчетФактураВТабличнойЧастиДокумента И Элементы.СчетФактураНадпись.Видимость И Не ЗначениеЗаполнено(КэшЗначений.СчетФактураСсылка));
		Элементы.ГруппаДанныеКонтрагента.Видимость = Истина;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыПредъявленСФ", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыГруппаСчетФактура", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасходыПредъявленСФ", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасходыГруппаСчетФактура", "Видимость", Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьВидимостьПоНалогообложению()
	
	Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда	
		Элементы.ЗапасыСтавкаНДС.Видимость = Истина;
		Элементы.ЗапасыСуммаНДС.Видимость = Истина;
		Элементы.ЗапасыВсего.Видимость = Истина;
		Элементы.РасходыСтавкаНДС.Видимость = Истина;
		Элементы.РасходыСуммаНДС.Видимость = Истина;
		Элементы.РасходыВсего.Видимость = Истина;
		Элементы.СчетФактураНадпись.Видимость = НЕ Объект.СчетФактураВТабличнойЧастиДокумента;
		Элементы.ГруппаДанныеКонтрагента.Видимость = НЕ Объект.СчетФактураВТабличнойЧастиДокумента;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыПредъявленСФ", "Видимость", Объект.СчетФактураВТабличнойЧастиДокумента);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыГруппаСчетФактура", "Видимость", Объект.СчетФактураВТабличнойЧастиДокумента);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасходыПредъявленСФ", "Видимость", Объект.СчетФактураВТабличнойЧастиДокумента);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасходыГруппаСчетФактура", "Видимость", Объект.СчетФактураВТабличнойЧастиДокумента);
		
	Иначе
		Элементы.ЗапасыСтавкаНДС.Видимость = Ложь;
		Элементы.ЗапасыСуммаНДС.Видимость = Ложь;
		Элементы.ЗапасыВсего.Видимость = Ложь;
		Элементы.РасходыСтавкаНДС.Видимость = Ложь;
		Элементы.РасходыСуммаНДС.Видимость = Ложь;
		Элементы.РасходыВсего.Видимость = Ложь;
		Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НаЭкспорт Тогда
			Элементы.СчетФактураНадпись.Видимость = Истина;
		Иначе
			Элементы.СчетФактураНадпись.Видимость = Ложь;
		КонецЕсли;
		
		Элементы.ГруппаДанныеКонтрагента.Видимость = Истина;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыПредъявленСФ", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыГруппаСчетФактура", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасходыПредъявленСФ", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасходыГруппаСчетФактура", "Видимость", Ложь);
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСчетФактураНомерДата", "Видимость"
	, НЕ Объект.СчетФактураВТабличнойЧастиДокумента И Элементы.СчетФактураНадпись.Видимость И Не ЗначениеЗаполнено(КэшЗначений.СчетФактураСсылка));
	
КонецПроцедуры

#КонецОбласти

#Область Подбор

&НаКлиенте
Процедура ЗапасыПодбор(Команда)
	
	ИмяТабличнойЧасти = "Запасы";
	ПодборНоменклатурыВДокументахКлиент.ОткрытьФормуПодбораНоменклатуры(ЭтотОбъект, ИмяТабличнойЧасти);
	
КонецПроцедуры // ЗапасыПодбор()

&НаКлиенте
Процедура РасходыПодбор(Команда)
	
	ИмяТабличнойЧасти = "Расходы";
	ПодборНоменклатурыВДокументахКлиент.ОткрытьФормуПодбораНоменклатуры(ЭтотОбъект, ИмяТабличнойЧасти);
	
КонецПроцедуры // РасходыПодбор()

&НаКлиенте
Процедура АвансыПодбор(Команда)
	
	АдресВыданныеАвансыВХранилище = ПоместитьВыданныеАвансыВХранилище();
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("АдресВыданныеАвансыВХранилище", АдресВыданныеАвансыВХранилище);
	ПараметрыПодбора.Вставить("Компания", Компания);
	ПараметрыПодбора.Вставить("Период", Объект.Дата);
	ПараметрыПодбора.Вставить("Сотрудник", Объект.Сотрудник);
	ПараметрыПодбора.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	ПараметрыПодбора.Вставить("Ссылка", Объект.Ссылка);
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораАвансовПодотчетнику", ПараметрыПодбора, , , , ,
		Новый ОписаниеОповещения("АвансыПодборЗавершение", ЭтотОбъект, Новый Структура("АдресВыданныеАвансыВХранилище",
		АдресВыданныеАвансыВХранилище)));
	
КонецПроцедуры

&НаКлиенте
Процедура АвансыПодборЗавершение(Результат1, ДополнительныеПараметры) Экспорт
	
	АдресВыданныеАвансыВХранилище = ДополнительныеПараметры.АдресВыданныеАвансыВХранилище;
	
	
	Результат = Результат1;
	Если Результат = КодВозвратаДиалога.OK Тогда
		ПолучитВыданныеАвансыИзХранилища(АдресВыданныеАвансыВХранилище);
		
	КонецЕсли;

КонецПроцедуры // АвансыПодбор()

// Функция получает список товаров из временного хранилища
//
&НаСервере
Процедура ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, ИмяТабличнойЧасти, ЕстьХарактеристики, ЕстьПартии, МассивНомеровИдентичныхСтрок = Неопределено)
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресЗапасовВХранилище);
	
	ЕстьСтруктурнаяЕдинцаВПодборе = НЕ ТаблицаДляЗагрузки.Колонки.Найти("СтруктурнаяЕдиница") = Неопределено;
	
	ЕстьЦенаВТабличнойЧасти = ДокументыУНФ.ЕстьЦенаВТабличнойЧасти(Объект, ИмяТабличнойЧасти);
	
	СтруктурыПоискаИдентичныхСтрок = ДокументыУНФ.СтруктурыПоискаИдентичныхСтрок(Объект, ТаблицаДляЗагрузки, ИмяТабличнойЧасти);
	СтруктураПоискаСЦеной = СтруктурыПоискаИдентичныхСтрок.СтруктураПоискаСЦеной;
	СтруктураПоискаБезЦены = СтруктурыПоискаИдентичныхСтрок.СтруктураПоискаБезЦены;
	
	ОбъединятьСтроки = ОбъединятьСтрокиПриДобавлении И Не МассивНомеровИдентичныхСтрок = Неопределено;
	
	Для Каждого СтрокаЗагрузки Из ТаблицаДляЗагрузки Цикл
		
		Если ОбъединятьСтроки Тогда
			
			Если НЕ ЗначениеЗаполнено(СтрокаЗагрузки.Цена) 
				Или Не ЕстьЦенаВТабличнойЧасти Тогда
				СтруктураПоиска = СтруктураПоискаБезЦены;
			Иначе
				СтруктураПоиска = СтруктураПоискаСЦеной;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаЗагрузки);
			НайденныеСтроки = Объект[ИмяТабличнойЧасти].НайтиСтроки(СтруктураПоиска);
			
			Если НайденныеСтроки.Количество() Тогда
				НайденныеСтроки[0].Количество = НайденныеСтроки[0].Количество + СтрокаЗагрузки.Количество;
				МассивНомеровИдентичныхСтрок.Добавить(НайденныеСтроки[0].НомерСтроки - 1);
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		НоваяСтрока = Объект[ИмяТабличнойЧасти].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗагрузки);
		Если НоваяСтрока.Свойство("Пометка") Тогда
			НоваяСтрока.Пометка = Истина;
		КонецЕсли;
		
		Если ИмяТабличнойЧасти = "Запасы" Тогда
			
			Если ЕстьСтруктурнаяЕдинцаВПодборе И ЗначениеЗаполнено(СтрокаЗагрузки.СтруктурнаяЕдиница) Тогда
				НоваяСтрока.СтруктурнаяЕдиница = СтрокаЗагрузки.СтруктурнаяЕдиница;
			Иначе
				НоваяСтрока.СтруктурнаяЕдиница = ОсновнойСклад;
			КонецЕсли;
			
			ЗначенияПоУмолчанию = НоменклатураВДокументахСервер.ЗначенияНоменклатурыПоУмолчанию(СтрокаЗагрузки.Номенклатура);
			
			НоваяСтрока.Характеристика = ?(ЗначениеЗаполнено(СтрокаЗагрузки.Характеристика), СтрокаЗагрузки.Характеристика, ЗначенияПоУмолчанию);
			
			НоваяСтрока.ПроверятьЗаполнениеХарактеристики = СтрокаЗагрузки.Номенклатура.ПроверятьЗаполнениеХарактеристики;
			НоваяСтрока.ИспользоватьХарактеристики = СтрокаЗагрузки.Номенклатура.ИспользоватьХарактеристики;
			НоваяСтрока.ЗаполнениеХарактеристикиПроверено = Истина;
			
			//Партии
			НоваяСтрока.ИспользоватьПартии = СтрокаЗагрузки.Номенклатура.ИспользоватьПартии;
			НоваяСтрока.ПроверятьЗаполнениеПартий = СтрокаЗагрузки.Номенклатура.ПроверятьЗаполнениеПартий;
			
			ЗначенияПартииПоУмолчанию = НоменклатураВДокументахСервер.ЗначенияПартийНоменклатурыПоУмолчанию(СтрокаЗагрузки.Номенклатура,ПредопределенноеЗначение("Перечисление.СтатусыПартий.СобственныеЗапасы"));
			
			НоваяСтрока.Партия = ?(ЗначениеЗаполнено(СтрокаЗагрузки.Партия), СтрокаЗагрузки.Партия, ЗначенияПартииПоУмолчанию);;
			// Конец Партии
			
		КонецЕсли;
		
		Если ИмяТабличнойЧасти = "Расходы" Тогда
			
			НоваяСтрока.СтруктурнаяЕдиница = ОсновноеПодразделение;
			
		КонецЕсли;
		
		НоваяСтрока.ЗапретитьВводДробногоКоличества = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.Номенклатура, "ЗапретитьВводДробногоКоличества");
		
	КонецЦикла;
	
КонецПроцедуры // ПолучитьЗапасыИзХранилища()

&НаСервере
Функция НомераИдентичныхСтрокВТабличнойЧасти(АдресЗапасовВХранилище, ИмяТабличнойЧасти = "Запасы")
	
	Возврат ДокументыУнф.НомераИдентичныхСтрокВТабличнойЧасти(Объект, АдресЗапасовВХранилище, ИмяТабличнойЧасти);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоОснованиюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоДокументу(Объект.ДокументОснование);
	
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
	
	ПоляНадписи = Новый Структура;
	ПоляНадписи.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	ПоляНадписи.Вставить("Курс", Объект.Курс);
	ПоляНадписи.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	ПоляНадписи.Вставить("УчетВалютныхОпераций", УчетВалютныхОпераций);
	ПоляНадписи.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	ВалютаДокумента = СформироватьНадписьЦеныИВалюта(ПоляНадписи);
	
КонецПроцедуры

// ПодключаемоеОборудование
// Процедура - обработчик команды командной панели табличной части.
//
&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	ТекШтрихкод = "";
	
	ОбработкаЗавершения = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект,
		Новый Структура("ТекШтрихкод", ТекШтрихкод));

	#Если МобильныйКлиент Тогда
	ОткрытьФорму("ОбщаяФорма.ФормаПоискаПоШтрихкоду", , , , , , ОбработкаЗавершения);
	#Иначе
	ПоказатьВводЗначения(ОбработкаЗавершения, ТекШтрихкод, НСтр("ru = 'Введите штрихкод'"));
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекШтрихкод = ?(Результат = Неопределено, СокрЛП(ДополнительныеПараметры.ТекШтрихкод), СокрЛП(Результат));
	
	
	Если НЕ ПустаяСтрока(ТекШтрихкод) Тогда
		ПолученыШтрихкоды(Новый Структура("Штрихкод, Количество", ТекШтрихкод, 1));
	КонецЕсли;
	
КонецПроцедуры // ПоискПоШтрихкоду()

&НаКлиенте
Процедура ПолучитьВес(Команда)
	
	ПодключаемоеОборудованиеУНФКлиент.ПолучениеВесаСЭлектронныхВесовДляТабличнойЧасти(ЭтотОбъект, "Запасы");
	
КонецПроцедуры // ПолучитьВес()

&НаКлиенте
Процедура ПолучитьВесЗавершение(Параметры) Экспорт
	
	СтрокаТабличнойЧасти = Параметры;
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	
КонецПроцедуры

// Процедура - обработчик команды ЗагрузитьДанныеИзТСД.
//
&НаКлиенте
Процедура ЗагрузитьДанныеИзТСД(Команда)
	
	ПодключаемоеОборудованиеУНФКлиент.ПолучитьДанныеИзТСД(ЭтотОбъект);
	
КонецПроцедуры // ЗагрузитьДанныеИзТСД()

&НаКлиенте
Процедура ВыгрузитьДанныеВТСД(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяТаблицыВыборки", "Запасы");
	
	ПодключаемоеОборудованиеУНФКлиент.ВыгрузитьДокументВТСД(ЭтотОбъект, Истина, ДополнительныеПараметры);
	
КонецПроцедуры
// Конец ПодключаемоеОборудование

&НаСервереБезКонтекста
Функция ПолучитьНастройкиИзмененияКоличества()
	
	НастройкиКоличества = ДокументыУНФКлиентСервер.ПараметрыСбросаКоличества();
	ДокументыУНФ.ЗаполнитьНастройкиКоличества(НастройкиКоличества);
	Возврат НастройкиКоличества;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеОбъектов

&НаКлиенте
Процедура СохранитьДокументКакШаблон(Параметр) Экспорт
	
	ЗаполнениеОбъектовУНФКлиент.СохранитьДокументКакШаблон(Объект, ОтображаемыеРеквизиты(), Параметр);
	
КонецПроцедуры

&НаСервере
Функция ОтображаемыеРеквизиты()
	
	Результат = Новый Массив;
	
	Для Каждого ТекЭлемент Из Элементы Цикл
		
		Если ТипЗнч(ТекЭлемент) <> Тип("ПолеФормы") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не СтрНачинаетсяС(ТекЭлемент.ПутьКДанным, "Объект.") Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(СтрЗаменить(ТекЭлемент.ПутьКДанным, "Объект.", ""));
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ГрупповоеИзменениеСтрок

// Процедура - обработчик нажатия кнопки Снять флажки в ТЧ Запасы.
//
&НаКлиенте
Процедура ЗапасыСнятьФлажки(Команда)
	УстановитьПометку("Запасы", Ложь);
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Установить флажки в ТЧ Запасы.
//
&НаКлиенте
Процедура ЗапасыУстановитьФлажки(Команда)
	УстановитьПометку("Запасы", Истина);
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Изменить в ТЧ Запасы.
// Показывает/скрывает панель редактирования таблицы.
//
&НаКлиенте
Процедура ЗапасыИзменитьСтроки(Команда)
	
	ПоказатьСкрытьПанельРедактирования("Запасы", Истина);
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Выполнить в панели редактирования ТЧ Запасы.
// Производит выбранные преобразования с таблицей.
//
&НаКлиенте
Процедура ЗапасыВыполнитьДействие(Команда)
	
	ОбработатьТаблицу("Запасы");
	НастроитьОформлениеПанелиРедактирования("Запасы", 4);
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Отменить в панели редактирования ТЧ Запасы.
// Скрывает панель редактирования и восстанавливает данные таблицы до внесения изменений.
//
&НаКлиенте
Процедура ЗапасыОтменитьИзменения(Команда)
	
	ПоказатьСкрытьПанельРедактирования("Запасы");
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Снять флажки в ТЧ Расходы.
//
&НаКлиенте
Процедура РасходыСнятьФлажки(Команда)
	УстановитьПометку("Расходы", Ложь);
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Установить флажки в ТЧ Расходы.
//
&НаКлиенте
Процедура РасходыУстановитьФлажки(Команда)
	УстановитьПометку("Расходы", Истина);
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Изменить в ТЧ Расходы.
// Показывает/скрывает панель редактирования таблицы.
//
&НаКлиенте
Процедура РасходыИзменитьСтроки(Команда)
	
	ПоказатьСкрытьПанельРедактирования("Расходы", Истина);
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Выполнить в панели редактирования ТЧ Расходы.
// Производит выбранные преобразования с таблицей.
//
&НаКлиенте
Процедура РасходыВыполнитьДействие(Команда)
	
	ОбработатьТаблицу("Расходы");
	НастроитьОформлениеПанелиРедактирования("Расходы", 4);
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Отменить в панели редактирования ТЧ Расходы.
// Скрывает панель редактирования и восстанавливает данные таблицы до внесения изменений.
//
&НаКлиенте
Процедура РасходыОтменитьИзменения(Команда)
	
	ПоказатьСкрытьПанельРедактирования("Расходы");
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода ЗапасыИзменениеСтрокДействие.
//
&НаКлиенте
Процедура ЗапасыИзменениеСтрокДействиеПриИзменении(Элемент)
	
	ОпределитьОбъектИзменений("Запасы");
	НастроитьОформлениеПанелиРедактирования("Запасы", 2);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода ЗапасыИзменениеСтрокЗначение.
//
&НаКлиенте
Процедура ЗапасыИзменениеСтрокЗначениеПриИзменении(Элемент)
	
	НастроитьОформлениеПанелиРедактирования("Запасы", 3);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода РасходыИзменениеСтрокДействие.
//
&НаКлиенте
Процедура РасходыИзменениеСтрокДействиеПриИзменении(Элемент)
	
	ОпределитьОбъектИзменений("Расходы");
	НастроитьОформлениеПанелиРедактирования("Расходы", 2);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода РасходыИзменениеСтрокЗначение.
//
&НаКлиенте
Процедура РасходыИзменениеСтрокЗначениеПриИзменении(Элемент)
	
	НастроитьОформлениеПанелиРедактирования("Расходы", 3);
	
КонецПроцедуры

// Устанавливает/снимает пометку для всех строк таблицы.
//
&НаСервере
Процедура УстановитьПометку(ИмяТЧ, Пометка)
	
	НаборЭлементов = НаборЭлементовГрупповогоИзмененияСтрокСервер(ИмяТЧ);
	НаборЭлементов.КнопкаСнятьФлажки.Видимость = НЕ НаборЭлементов.КнопкаСнятьФлажки.Видимость;
	НаборЭлементов.КнопкаУстановитьФлажки.Видимость = НЕ НаборЭлементов.КнопкаУстановитьФлажки.Видимость;
	
	Для каждого Строка Из Объект[НаборЭлементов.ИмяТЧ] Цикл
		Строка.Пометка = Пометка;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Открывает/закрывает панель редактирования ТЧ.
//
Процедура ПоказатьСкрытьПанельРедактирования(ИмяТЧ, ИзменяетДанные = Неопределено)
	
	Перем СостояниеПерехода;
	ГрупповоеИзменениеСтрокСервер.ПоказатьСкрытьПанельРедактирования(
		ЭтотОбъект,
		НаборЭлементовГрупповогоИзмененияСтрокСервер(ИмяТЧ),
		СостояниеПерехода,
		ИзменяетДанные);
	
	УправлениеРезервнымиКопиямиТаблицы(ИмяТЧ, СостояниеПерехода, ИзменяетДанные);
	
КонецПроцедуры

&НаСервере
// Управляет сохранением/отменой изменений в ТЧ.
//
Процедура УправлениеРезервнымиКопиямиТаблицы(ИмяТЧ, СостояниеПерехода, ИзменяетДанные)
	
	Если ИмяТЧ = "Запасы" Тогда
		РеквизитРезервнаяКопияТаблицыАдрес = "ЗапасыРезервнаяКопияТаблицыАдрес";
	ИначеЕсли ИмяТЧ = "Расходы" Тогда
		РеквизитРезервнаяКопияТаблицыАдрес = "РасходыРезервнаяКопияТаблицыАдрес";
	КонецЕсли;
	
	ГрупповоеИзменениеСтрокСервер.УправлениеРезервнымиКопиями(
		ЭтотОбъект,
		Объект[ИмяТЧ],
		ЭтотОбъект[РеквизитРезервнаяКопияТаблицыАдрес],
		СостояниеПерехода,
		ИзменяетДанные);
	
КонецПроцедуры

// Управляет оформлением панели редактирования таблицы.
//
&НаКлиенте
Процедура НастроитьОформлениеПанелиРедактирования(ИмяТЧ, Состояние, СохранитьИзменения = Неопределено)
	
	Если ИмяТЧ = "Запасы" Тогда
		РеквизитЗначение = "ЗапасыИзменениеСтрокЗначение";
	ИначеЕсли ИмяТЧ = "Расходы" Тогда
		РеквизитЗначение = "РасходыИзменениеСтрокЗначение";
	КонецЕсли;
	
	ГрупповоеИзменениеСтрокКлиент.НастроитьОформлениеПанелиРедактирования(
		ЭтотОбъект,
		НаборЭлементовГрупповогоИзмененияСтрокКлиент(ИмяТЧ),
		Состояние,
		ЭтотОбъект[РеквизитЗначение]);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьТекущееДействиеИзмененияСтрок()
	
	СохраняемыеНастройки = "";
	
	Если ЗапасыИзменениеСтрокДействие <> ЗапасыИзменениеСтрокДействиеПриОткрытии Тогда
		СохраняемыеНастройки = "Запасы";
	КонецЕсли;
	
	Если РасходыИзменениеСтрокДействие <> РасходыИзменениеСтрокДействиеПриОткрытии Тогда
		Если ЗначениеЗаполнено(СохраняемыеНастройки) Тогда
			СохраняемыеНастройки = СохраняемыеНастройки + ",";
		КонецЕсли;
		СохраняемыеНастройки = СохраняемыеНастройки + "Расходы";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СохраняемыеНастройки) Тогда
		Возврат
	КонецЕсли;
	
	СохранитьТекущееДействиеИзмененияСтрокСервер(СохраняемыеНастройки);
	
КонецПроцедуры

// Записывает в пользовательские настройки последнее выбранное действие для изменения таблицы.
//
&НаСервере
Процедура СохранитьТекущееДействиеИзмененияСтрокСервер(СохраняемыеНастройки)
	
	ИменаТЧ = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СохраняемыеНастройки);
	Для каждого ИмяТЧ Из ИменаТЧ Цикл
		ГрупповоеИзменениеСтрокСервер.СохранитьНастройки(НаборЭлементовГрупповогоИзмененияСтрокСервер(ИмяТЧ));
	КонецЦикла;
	
КонецПроцедуры

// Производит пересчет связанных реквизитов в строках таблицы после из группового изменения.
//
&НаКлиенте
Процедура ОбработатьТаблицу(ИмяТЧ)
	
	ОбработатьТаблицуНаСервере(ИмяТЧ);
	
	Если ИмяТЧ = "Запасы" Тогда
		ВыполненноеДействие = ЗапасыИзменениеСтрокДействие;
	ИначеЕсли ИмяТЧ = "Расходы" Тогда
		ВыполненноеДействие = РасходыИзменениеСтрокДействие;
	КонецЕсли;
	
	ИзменяемыеСтроки = Объект[ИмяТЧ].НайтиСтроки(Новый Структура("Пометка", Истина));
	Для каждого Строка Из ИзменяемыеСтроки Цикл
		
		Если ВыполненноеДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент")
			ИЛИ ВыполненноеДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ОкруглитьЦены")
			ИЛИ ВыполненноеДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
			
			РассчитатьСуммуВСтрокеТабличнойЧасти(Строка);
			
		ИначеЕсли ВыполненноеДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСтавкуНДС") Тогда
			
			ПараметрыРасчета = Новый Структура("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
			ТабличныеЧастиУНФКлиент.РассчитатьСуммыВСтрокеТЧ(Строка, ПараметрыРасчета);
			
		ИначеЕсли ВыполненноеДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству")
			ИЛИ ВыполненноеДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам") Тогда
			
			Если Строка.Количество <> 0 Тогда
				Строка.Цена = Строка.Сумма / Строка.Количество;
			КонецЕсли;
			
			ПараметрыРасчета = Новый Структура("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
			ТабличныеЧастиУНФКлиент.РассчитатьСуммыВСтрокеТЧ(Строка, ПараметрыРасчета);
			ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Производит пересчет связанных реквизитов в строках таблицы после из группового изменения.
//
&НаСервере
Процедура ОбработатьТаблицуНаСервере(ИмяТЧ)
	
	Если ИмяТЧ = "Запасы" Тогда
		
		ГрупповоеИзменениеСтрокСервер.ОбработатьТаблицу(
			ЭтотОбъект,
			Объект.Запасы,
			ЗапасыИзменениеСтрокДействие,
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит,
			ЗапасыИзменениеСтрокЗначение,
			"ЗапасыНоменклатура");
		
		Если ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
			
			ИзменяемыеСтроки = Объект.Запасы.НайтиСтроки(Новый Структура("Пометка", Истина));
			Для каждого Строка Из ИзменяемыеСтроки Цикл
				
				СтруктураДанные = Новый Структура;
				СтруктураДанные.Вставить("Организация", Объект.Организация);
				СтруктураДанные.Вставить("Номенклатура", Строка.Номенклатура);
				СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
				СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
				
				СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
				
				Строка.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
				Если НЕ ЗначениеЗаполнено(Строка.Количество) Тогда
					Если СбрасыватьКоличество Тогда 
						Строка.Количество = НовоеКоличествоПриИзмененииНоменклатуры;
					КонецЕсли;
				КонецЕсли;
				Строка.СтавкаНДС = СтруктураДанные.СтавкаНДС;
				Строка.Содержание = "";
				
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ИмяТЧ = "Расходы" Тогда
		
		ГрупповоеИзменениеСтрокСервер.ОбработатьТаблицу(
			ЭтотОбъект,
			Объект.Расходы,
			РасходыИзменениеСтрокДействие,
			РасходыИзменениеСтрокОбъектИзмененийРеквизит,
			РасходыИзменениеСтрокЗначение,
			"РасходыНоменклатура");
		
		Если РасходыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
			
			ИзменяемыеСтроки = Объект.Расходы.НайтиСтроки(Новый Структура("Пометка", Истина));
			Для каждого Строка Из ИзменяемыеСтроки Цикл
				
				СтруктураДанные = Новый Структура;
				СтруктураДанные.Вставить("Организация", Объект.Организация);
				СтруктураДанные.Вставить("Номенклатура", Строка.Номенклатура);
				СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
				СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
				
				СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
				
				Строка.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
				Если НЕ ЗначениеЗаполнено(Строка.Количество) Тогда
					Если СбрасыватьКоличество Тогда 
						Строка.Количество = НовоеКоличествоПриИзмененииНоменклатуры;
					КонецЕсли;
				КонецЕсли;
				Строка.СтавкаНДС = СтруктураДанные.СтавкаНДС;
				Строка.Содержание = "";
				
				Если СтруктураДанные.ОчиститьЗаказИПодразделение Тогда
					Строка.СтруктурнаяЕдиница = Неопределено;
					Строка.ЗаказПокупателя = Неопределено;
				КонецЕсли;
				
				Если СтруктураДанные.ОчиститьНаправлениеДеятельности Тогда
					Строка.НаправлениеДеятельности = Неопределено;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
	
КонецПроцедуры

// Определяет в зависимости от выбранного действия изменяемый реквизит и связанный с ним элемент на форме.
//
&НаКлиенте
Процедура ОпределитьОбъектИзменений(ИмяТЧ)
	
	Если ИмяТЧ = "Запасы" Тогда
		
		Если ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Цена";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыЦена";
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ОкруглитьЦены") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Цена";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыЦена";
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Сумма";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыСумма";
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Сумма";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыСумма";
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСтавкуНДС") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "СтавкаНДС";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыСтавкаНДС";
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "";
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УдалитьСтроки") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "";
			
		КонецЕсли;
		
	ИначеЕсли ИмяТЧ = "Расходы" Тогда
		
		Если РасходыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент") Тогда
			
			РасходыИзменениеСтрокОбъектИзмененийРеквизит = "Цена";
			РасходыИзменениеСтрокОбъектИзмененийЭлемент = "РасходыЦена";
			
		ИначеЕсли РасходыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ОкруглитьЦены") Тогда
			
			РасходыИзменениеСтрокОбъектИзмененийРеквизит = "Цена";
			РасходыИзменениеСтрокОбъектИзмененийЭлемент = "РасходыЦена";
			
		ИначеЕсли РасходыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству") Тогда
			
			РасходыИзменениеСтрокОбъектИзмененийРеквизит = "Сумма";
			РасходыИзменениеСтрокОбъектИзмененийЭлемент = "РасходыСумма";
			
		ИначеЕсли РасходыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам") Тогда
			
			РасходыИзменениеСтрокОбъектИзмененийРеквизит = "Сумма";
			РасходыИзменениеСтрокОбъектИзмененийЭлемент = "РасходыСумма";
			
		ИначеЕсли РасходыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСтавкуНДС") Тогда
			
			РасходыИзменениеСтрокОбъектИзмененийРеквизит = "СтавкаНДС";
			РасходыИзменениеСтрокОбъектИзмененийЭлемент = "РасходыСтавкаНДС";
			
		ИначеЕсли РасходыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
			
			РасходыИзменениеСтрокОбъектИзмененийРеквизит = "";
			РасходыИзменениеСтрокОбъектИзмененийЭлемент = "";
			
		ИначеЕсли РасходыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УдалитьСтроки") Тогда
			
			РасходыИзменениеСтрокОбъектИзмененийРеквизит = "";
			РасходыИзменениеСтрокОбъектИзмененийЭлемент = "";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Создает набор необходимых реквизитов и элементов формы для управления оформлением панели редактирования.
//
&НаКлиенте
Функция НаборЭлементовГрупповогоИзмененияСтрокКлиент(ИмяТЧ)
	
	НаборЭлементов = Новый Структура();
	
	Если ИмяТЧ = "Запасы" Тогда
		
		НаборЭлементов = Новый Структура();
		НаборЭлементов.Вставить("ИмяТЧ", "Запасы");
		НаборЭлементов.Вставить("ДокументСсылка",          Объект.Ссылка);
		НаборЭлементов.Вставить("ПанельРедактирования",    Элементы.ГруппаЗапасыИзменениеСтрок);
		НаборЭлементов.Вставить("КнопкаУстановитьФлажки",  Элементы.ЗапасыУстановитьФлажки);
		НаборЭлементов.Вставить("КнопкаСнятьФлажки",       Элементы.ЗапасыСнятьФлажки);
		НаборЭлементов.Вставить("КнопкаВыполнитьДействие", Элементы.ЗапасыВыполнитьДействие);
		НаборЭлементов.Вставить("КолонкаПометка",          Элементы.ЗапасыПометка);
		НаборЭлементов.Вставить("КолонкаНомерСтроки",      Элементы.ЗапасыНомерСтроки);
		НаборЭлементов.Вставить("Действие",                ЭтотОбъект.ЗапасыИзменениеСтрокДействие);
		НаборЭлементов.Вставить("ДействиеЭлемент",         Элементы.ЗапасыИзменениеСтрокДействие);
		НаборЭлементов.Вставить("Значение",                ЭтотОбъект.ЗапасыИзменениеСтрокЗначение);
		НаборЭлементов.Вставить("ЗначениеЭлемент",         Элементы.ЗапасыИзменениеСтрокЗначение);
		НаборЭлементов.Вставить("ОбъектИзменений",         ЗапасыИзменениеСтрокОбъектИзмененийЭлемент);
		НаборЭлементов.Вставить("КолонкаОбъектИзменений",  ?(ЗначениеЗаполнено(ЗапасыИзменениеСтрокОбъектИзмененийЭлемент), 
		                                                     Элементы[ЗапасыИзменениеСтрокОбъектИзмененийЭлемент], Неопределено));
	ИначеЕсли ИмяТЧ = "Расходы" Тогда
		
		НаборЭлементов = Новый Структура();
		НаборЭлементов.Вставить("ИмяТЧ", "Расходы");
		НаборЭлементов.Вставить("ДокументСсылка",          Объект.Ссылка);
		НаборЭлементов.Вставить("ПанельРедактирования",    Элементы.ГруппаРасходыИзменениеСтрок);
		НаборЭлементов.Вставить("КнопкаУстановитьФлажки",  Элементы.РасходыУстановитьФлажки);
		НаборЭлементов.Вставить("КнопкаСнятьФлажки",       Элементы.РасходыСнятьФлажки);
		НаборЭлементов.Вставить("КнопкаВыполнитьДействие", Элементы.РасходыВыполнитьДействие);
		НаборЭлементов.Вставить("КолонкаПометка",          Элементы.РасходыПометка);
		НаборЭлементов.Вставить("КолонкаНомерСтроки",      Элементы.РасходыНомерСтроки);
		НаборЭлементов.Вставить("Действие",                ЭтотОбъект.РасходыИзменениеСтрокДействие);
		НаборЭлементов.Вставить("ДействиеЭлемент",         Элементы.РасходыИзменениеСтрокДействие);
		НаборЭлементов.Вставить("Значение",                ЭтотОбъект.РасходыИзменениеСтрокЗначение);
		НаборЭлементов.Вставить("ЗначениеЭлемент",         Элементы.РасходыИзменениеСтрокЗначение);
		НаборЭлементов.Вставить("ОбъектИзменений",         РасходыИзменениеСтрокОбъектИзмененийЭлемент);
		НаборЭлементов.Вставить("КолонкаОбъектИзменений",  ?(ЗначениеЗаполнено(РасходыИзменениеСтрокОбъектИзмененийЭлемент), 
		                                                     Элементы[РасходыИзменениеСтрокОбъектИзмененийЭлемент], Неопределено));
	КонецЕсли;
	
	Возврат НаборЭлементов;
	
КонецФункции

// Создает набор необходимых реквизитов и элементов формы для управления оформлением панели редактирования.
//
&НаСервере
Функция НаборЭлементовГрупповогоИзмененияСтрокСервер(ИмяТЧ)
	
	Если ИмяТЧ = "Запасы" Тогда
		
		НаборЭлементов = Новый Структура();
		НаборЭлементов.Вставить("ИмяТЧ", "Запасы");
		НаборЭлементов.Вставить("ДокументСсылка",          Объект.Ссылка);
		НаборЭлементов.Вставить("ПанельРедактирования",    Элементы.ГруппаЗапасыИзменениеСтрок);
		НаборЭлементов.Вставить("КнопкаИзменитьСтроки"  ,  Элементы.ЗапасыИзменитьСтроки);
		НаборЭлементов.Вставить("КнопкаУстановитьФлажки",  Элементы.ЗапасыУстановитьФлажки);
		НаборЭлементов.Вставить("КнопкаСнятьФлажки",       Элементы.ЗапасыСнятьФлажки);
		НаборЭлементов.Вставить("КнопкаВыполнитьДействие", Элементы.ЗапасыВыполнитьДействие);
		НаборЭлементов.Вставить("КолонкаПометка",          Элементы.ЗапасыПометка);
		НаборЭлементов.Вставить("КолонкаНомерСтроки",      Элементы.ЗапасыНомерСтроки);
		НаборЭлементов.Вставить("Действие",                ЭтотОбъект.ЗапасыИзменениеСтрокДействие);
		НаборЭлементов.Вставить("ДействиеЭлемент",         Элементы.ЗапасыИзменениеСтрокДействие);
		НаборЭлементов.Вставить("Значение",                ЭтотОбъект.ЗапасыИзменениеСтрокЗначение);
		НаборЭлементов.Вставить("ЗначениеЭлемент",         Элементы.ЗапасыИзменениеСтрокЗначение);
		НаборЭлементов.Вставить("ОбъектИзменений",         ЗапасыИзменениеСтрокОбъектИзмененийЭлемент);
		НаборЭлементов.Вставить("КолонкаОбъектИзменений",  ?(ЗначениеЗаполнено(ЗапасыИзменениеСтрокОбъектИзмененийЭлемент), 
		                                                     Элементы[ЗапасыИзменениеСтрокОбъектИзмененийЭлемент], Неопределено));
	ИначеЕсли ИмяТЧ = "Расходы" Тогда
		
		НаборЭлементов = Новый Структура();
		НаборЭлементов.Вставить("ИмяТЧ", "Расходы");
		НаборЭлементов.Вставить("ДокументСсылка",          Объект.Ссылка);
		НаборЭлементов.Вставить("ПанельРедактирования",    Элементы.ГруппаРасходыИзменениеСтрок);
		НаборЭлементов.Вставить("КнопкаИзменитьСтроки"  ,  Элементы.РасходыИзменитьСтроки);
		НаборЭлементов.Вставить("КнопкаУстановитьФлажки",  Элементы.РасходыУстановитьФлажки);
		НаборЭлементов.Вставить("КнопкаСнятьФлажки",       Элементы.РасходыСнятьФлажки);
		НаборЭлементов.Вставить("КнопкаВыполнитьДействие", Элементы.РасходыВыполнитьДействие);
		НаборЭлементов.Вставить("КолонкаПометка",          Элементы.РасходыПометка);
		НаборЭлементов.Вставить("КолонкаНомерСтроки",      Элементы.РасходыНомерСтроки);
		НаборЭлементов.Вставить("Действие",                ЭтотОбъект.РасходыИзменениеСтрокДействие);
		НаборЭлементов.Вставить("ДействиеЭлемент",         Элементы.РасходыИзменениеСтрокДействие);
		НаборЭлементов.Вставить("Значение",                ЭтотОбъект.РасходыИзменениеСтрокЗначение);
		НаборЭлементов.Вставить("ЗначениеЭлемент",         Элементы.РасходыИзменениеСтрокЗначение);
		НаборЭлементов.Вставить("ОбъектИзменений",         РасходыИзменениеСтрокОбъектИзмененийЭлемент);
		НаборЭлементов.Вставить("КолонкаОбъектИзменений",  ?(ЗначениеЗаполнено(РасходыИзменениеСтрокОбъектИзмененийЭлемент), 
		                                                     Элементы[РасходыИзменениеСтрокОбъектИзмененийЭлемент], Неопределено));
	КонецЕсли;
	
	Возврат НаборЭлементов;
КонецФункции

// Заполняет список выбора реквизита Действие в панели редактирования ТЧ
//
&НаСервере
Процедура ЗаполнитьСписокДействий(ИмяТЧ)
	
	РазрешеноРедактированиеЦенДокументов = УправлениеДоступомУНФ.РазрешеноРедактированиеЦенДокументов();
	
	Если ИмяТЧ = "Запасы" Тогда
		
		Действия = Новый Массив;
		Если РазрешеноРедактированиеЦенДокументов Тогда
			Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент);
		КонецЕсли;
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ОкруглитьЦены);
		Если РазрешеноРедактированиеЦенДокументов Тогда
			Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству);
			Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам);
		КонецЕсли;
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.УстановитьСтавкуНДС);
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента);
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.УдалитьСтроки);
		
		Элементы.ЗапасыИзменениеСтрокДействие.СписокВыбора.Очистить();
		Для каждого Действие Из Действия Цикл
			ДействиеОписание = ГрупповоеИзменениеСтрокСервер.ПредставлениеДействия(Действие);
			Элементы.ЗапасыИзменениеСтрокДействие.СписокВыбора.Добавить(Действие, ДействиеОписание);
		КонецЦикла;
		
	ИначеЕсли ИмяТЧ = "Расходы" Тогда
		
		Действия = Новый Массив;
		Если РазрешеноРедактированиеЦенДокументов Тогда
			Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент);
		КонецЕсли;
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ОкруглитьЦены);
		Если РазрешеноРедактированиеЦенДокументов Тогда
			Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству);
			Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам);
		КонецЕсли;
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.УстановитьСтавкуНДС);
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента);
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.УдалитьСтроки);
		
		Элементы.РасходыИзменениеСтрокДействие.СписокВыбора.Очистить();
		Для каждого Действие Из Действия Цикл
			ДействиеОписание = ГрупповоеИзменениеСтрокСервер.ПредставлениеДействия(Действие);
			Элементы.РасходыИзменениеСтрокДействие.СписокВыбора.Добавить(Действие, ДействиеОписание);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПометкаПриИзменении(Элемент)
	ГрупповоеИзменениеСтрокКлиент.СтрокаПометкаПриИзменении(Объект.Запасы, Элементы.ЗапасыУстановитьФлажки, Элементы.ЗапасыСнятьФлажки);
КонецПроцедуры

&НаКлиенте
Процедура РасходыПометкаПриИзменении(Элемент)
	ГрупповоеИзменениеСтрокКлиент.СтрокаПометкаПриИзменении(Объект.Расходы, Элементы.РасходыУстановитьФлажки, Элементы.РасходыСнятьФлажки);
КонецПроцедуры

#КонецОбласти

#Область КопированиеСтрокТабличныхЧастей

// Процедура - обработчик нажатия кнопки Копировать строки в ТЧ Запасы.
//
&НаКлиенте
Процедура ЗапасыКопироватьСтроки(Команда)
	
	КопироватьСтроки("Запасы");
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Вставить строки в ТЧ Запасы.
//
&НаКлиенте
Процедура ЗапасыВставитьСтроки(Команда)
	
	ВставитьСтроки("Запасы");
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Копировать строки в ТЧ Расходы.
//
&НаКлиенте
Процедура РасходыКопироватьСтроки(Команда)
	
	КопироватьСтроки("Расходы");
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Вставить строки в ТЧ Расходы.
//
&НаКлиенте
Процедура РасходыВставитьСтроки(Команда)
	
	ВставитьСтроки("Расходы");
	
КонецПроцедуры

// Вызывает процедуру копирования строк и оповещает пользователя о количестве скопированных.
//
&НаКлиенте
Процедура КопироватьСтроки(ИмяТЧ)
	
	Если КопированиеТабличнойЧастиКлиент.МожноКопироватьСтроки(Объект[ИмяТЧ], Элементы[ИмяТЧ].ТекущиеДанные) Тогда
		КоличествоСкопированных = 0;
		КопироватьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных);
		КопированиеТабличнойЧастиКлиент.ОповеститьПользователяОКопированииСтрок(КоличествоСкопированных);
	КонецЕсли;
	
КонецПроцедуры

// Вызывает процедуру вставки строк и оповещает пользователя о количестве вставленных.
//
&НаКлиенте
Процедура ВставитьСтроки(ИмяТЧ)
	
	КоличествоСкопированных = 0;
	КоличествоВставленных = 0;
	ВставитьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных, КоличествоВставленных);
	ОбработатьВставленныеСтроки(ИмяТЧ, КоличествоВставленных);
	КопированиеТабличнойЧастиКлиент.ОповеститьПользователяОВставкеСтрок(КоличествоСкопированных, КоличествоВставленных);
	
КонецПроцедуры

// Выполняет копирование выделенных строк в буфер обмена.
//
&НаСервере
Процедура КопироватьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных)
	
	КопированиеТабличнойЧастиСервер.Копировать(Объект[ИмяТЧ], Элементы[ИмяТЧ].ВыделенныеСтроки, КоличествоСкопированных);
	
КонецПроцедуры

// Вставляет скопированные строки из буфера обмена в выбранную табличную часть.
//
&НаСервере
Процедура ВставитьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных, КоличествоВставленных)
	
	КопированиеТабличнойЧастиСервер.Вставить(Объект, ИмяТЧ, Элементы, КоличествоСкопированных, КоличествоВставленных);
	ОбработатьВставленныеСтрокиНаСервере(ИмяТЧ, КоличествоВставленных);
	
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
	
КонецПроцедуры

// Обрабатывает вставленные строки.
//
&НаКлиенте
Процедура ОбработатьВставленныеСтроки(ИмяТЧ, КоличествоВставленных)
	
	Количество = Объект[ИмяТЧ].Количество();
	Для Итератор = 1 По КоличествоВставленных Цикл
		
		Строка = Объект[ИмяТЧ][Количество - Итератор];
		РассчитатьСуммуВСтрокеТабличнойЧасти(Строка);
		
		Если ИмяТЧ = "Запасы" И Не РезервированиеЗапасов Тогда
			Строка.ЗаказПокупателя = Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
	
КонецПроцедуры

// Обрабатывает вставленные строки.
//
&НаСервере
Процедура ОбработатьВставленныеСтрокиНаСервере(ИмяТЧ, КоличествоВставленных)
	
	Количество = Объект[ИмяТЧ].Количество();
	
	Для Итератор = 1 По КоличествоВставленных Цикл
		
		Строка = Объект[ИмяТЧ][Количество - Итератор];
		
		СтруктураДанные = Новый Структура;
		СтруктураДанные.Вставить("Организация",        Объект.Организация);
		СтруктураДанные.Вставить("Номенклатура",       Строка.Номенклатура);
		СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
		СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
		
		СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
		
		Если ИмяТЧ = "Запасы" Тогда
			
			Строка.СтавкаНДС = СтруктураДанные.СтавкаНДС;
			Строка.СтруктурнаяЕдиница = ОсновнойСклад;
			Если НЕ ЗначениеЗаполнено(Строка.ЕдиницаИзмерения) Тогда
				Строка.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
			КонецЕсли;
			
		ИначеЕсли ИмяТЧ = "Расходы" Тогда
			
			Если НЕ ЗначениеЗаполнено(Строка.ЕдиницаИзмерения) Тогда
				Строка.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
			КонецЕсли;
			
			Если СтруктураДанные.ОчиститьЗаказИПодразделение Тогда
				Строка.СтруктурнаяЕдиница = Неопределено;
				Строка.ЗаказПокупателя = Неопределено;
			КонецЕсли;
			
			Если СтруктураДанные.ОчиститьНаправлениеДеятельности Тогда
				Строка.НаправлениеДеятельности = Неопределено;
			КонецЕсли;
			
			Строка.СтруктурнаяЕдиница = ОсновноеПодразделение;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено,
	СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти


#Область СовместноеИспользование
&НаКлиенте
Процедура Подключаемый_ИнформационнаяПанельСовместногоИспользованияОбработкаНавигационнойСсылки(Источник, НавигационнаяСсылка, СтандартнаяОбработка)
	
	ОписаниеКонтекста = СовместноеИспользованиеКлиентСервер.КонтекстОбработкиСобытия(ЭтотОбъект, Объект);
	СовместноеИспользованиеКлиент.ОбработкаНавигационнойСсылкиИнформационнойПанели(ОписаниеКонтекста, Источник, НавигационнаяСсылка, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ИнформационнаяПанельСовместногоИспользованияЗавершениеДействия(Результат, ДополнительныеПараметры) Экспорт
	
	Подключаемый_ИнформационнаяПанельСовместногоИспользованияЗавершениеДействияНаСервере(Результат, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ИнформационнаяПанельСовместногоИспользованияЗавершениеДействияНаСервере(Результат, ДополнительныеПараметры)
	
	ОписаниеКонтекста = СовместноеИспользованиеКлиентСервер.КонтекстОбработкиСобытия(ЭтотОбъект, Объект);
	СовместноеИспользование.ОбновитьИнформационнуюПанель(ОписаниеКонтекста);
	
КонецПроцедуры
#КонецОбласти     

