
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СовместноеИспользование
	ОписаниеКонтекста = СовместноеИспользованиеКлиентСервер.КонтекстОбработкиСобытия(ЭтотОбъект, Объект);
	СовместноеИспользование.ПриСозданииНаСервере(ОписаниеКонтекста, Элементы.ИнформационнаяПанельСовместногоИспользования);
	// Конец СовместноеИспользование
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если Не ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() И Объект.ДокументыОснования.Количество() = 0 Тогда
		Если Параметры.Свойство("НаВозврат") И Параметры.НаВозврат = Истина Тогда
			Объект.ЭтоВозврат = Перечисления.ДаНет.Да;
		КонецЕсли;
	КонецЕсли;
	
	КэшЗначений = Новый Структура;
	КэшЗначений.Вставить("Компания", Константы.УчетПоКомпании.Компания(Объект.Организация));
	КэшЗначений.Вставить("КонтрагентТекущий", Объект.Контрагент);
	КэшЗначений.Вставить("ДоговорТекущий", Объект.Договор);
	КэшЗначений.Вставить("НациональнаяВалюта", Константы.НациональнаяВалюта.Получить());
	КэшЗначений.Вставить("УчетВалютныхОпераций", ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций"));
	
	НациональнаяВалютаКурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(КэшЗначений.НациональнаяВалюта,
		ДатаДокумента);
	КэшЗначений.Вставить("КурсНациональнаяВалюта", НациональнаяВалютаКурсКратность.Курс);
	КэшЗначений.Вставить("КратностьНациональнаяВалюта", НациональнаяВалютаКурсКратность.Кратность);
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьКорректировкиРеализаций") Тогда
		ЭлементКУдалению = Элементы.ВидОперации.СписокВыбора.НайтиПоЗначению(Перечисления.ВидыОперацийСчетФактура.Корректировка);
		Если ЭлементКУдалению <> Неопределено Тогда
			Элементы.ВидОперации.СписокВыбора.Удалить(ЭлементКУдалению);
		КонецЕсли;
	КонецЕсли;
	
	УстановитьСвойстваРеквизитовФормы();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаВыставления", "Доступность", Объект.ВыставленСтатус = 2);
	
	// ЭДО
	УправлениеНебольшойФирмойЭлектронныеДокументыСервер.КомандыЭДО_ФормаДокумента(ЭтотОбъект);
	// Конец ЭДО
	
	АвтоподборКонтактов.ПодключитьОбработчикиСобытияАвтоподбор(ЭтотОбъект);
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечать);
	ПечатьДокументовУНФ.ДобавитьИнформациюПоНовомуФаксимиле(ЭтотОбъект);
		
	ДатаНомерДокументовОплатыПриСоздании.Загрузить(Объект.ДатаНомерДокументовОплаты.Выгрузить());
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументовУНФ.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
	// ПодключаемоеОборудование
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	Если ИспользоватьПодключаемоеОборудование Тогда
		ТипыОборудования = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
		ТипыОборудования.СканерШтрихкода = Истина;
		МенеджерОборудования.ПриСозданииНаСервере(ЭтотОбъект, ТипыОборудования);
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
	// ЭДО
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец ЭДО
	
	ЗаглавиеДокументовОснований();
	УстановитьНадписьДокументыОплаты();
	ОбновитьПодвалФормы();
	ОбновитьНомерНаПечать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьДокументИБПослеЗаполнения" Тогда
		
		ЭтотОбъект.Прочитать();
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПослеЗаписиКонтрагента"
		И ЗначениеЗаполнено(Параметр)
		И Объект.Контрагент = Параметр Тогда
		
		УстановитьСвойстваРеквизитовФормы();
		
	КонецЕсли;
	
	// Обсуждения
	ОбсужденияУНФКлиент.ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтотОбъект, Объект.Ссылка);
	// Конец Обсуждения
	
	// ЭДО
	ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
	ПараметрыОповещения.Форма = ЭтотОбъект;
	ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
	ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.СостояниеЭДО;
	ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
	// Конец ЭДО
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументовУНФКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СовместноеИспользование
	ОписаниеКонтекста = СовместноеИспользованиеКлиентСервер.КонтекстОбработкиСобытия(ЭтотОбъект, Объект);
	СовместноеИспользование.ОбновитьИнформационнуюПанель(ОписаниеКонтекста);
	// Конец СовместноеИспользование
	
	// ЭДО
	УправлениеНебольшойФирмойЭлектронныеДокументыСервер.КомандыЭДО_ПриЧтенииФормыДокумента(ЭтотОбъект);
	// Конец ЭДО
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОценкаПроизводительностиКлиент.ЗамерВремени("Проведение"
			+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ЭтотОбъект.ИмяФормы));
	КонецЕсли;
	// СтандартныеПодсистемы.ОценкаПроизводительности
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ТекстСообщения = "";
		Справочники.ДоговорыКонтрагентов.ПроверитьСоответствиеДоговораУсловиямДокумента(
			ТекстСообщения,
			Объект.Договор,
			Объект.Ссылка,
			Объект.Организация,
			Объект.Контрагент,
			Отказ,
			Объект.ВидОперации);
		
		Если ТекстСообщения <> "" Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Если Отказ Тогда
				Сообщение.Текст = СтрШаблон(НСтр("ru = 'Документ не проведен. %1'"), ТекстСообщения);
			Иначе
				Сообщение.Текст = ТекстСообщения;
			КонецЕсли;
			
			Если Отказ Тогда
				Сообщение.ПутьКДанным = "Объект";
				Сообщение.Поле = "Договор";
			КонецЕсли;
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Обсуждения
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Модифицированность",Модифицированность);
	// Конец Обсуждения
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// ЭДО
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.СостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец ЭДО
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ПредставлениеСчетФактуры", Неопределено);
	ПараметрыОповещения.Вставить("ДокументыОснования", Объект.ДокументыОснования.Выгрузить().ВыгрузитьКолонку("ДокументОснование"));
	
	ПараметрыЗаписи.Вставить("ПараметрыОповещения", ПараметрыОповещения);
	
	//Обсуждения
	ОбсужденияУНФ.ПослеЗаписиНаСервере(ТекущийОбъект);	
	// Конец Обсуждения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СовместноеИспользование
	ОписаниеКонтекста = СовместноеИспользованиеКлиентСервер.КонтекстОбработкиСобытия(ЭтотОбъект, Объект);
	СовместноеИспользование.ПослеЗаписиНаСервере(ОписаниеКонтекста);
	// Конец СовместноеИспользование
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	Если Объект.ОтредактированНомерСчетаФактуры И ЗначениеЗаполнено(Объект.НомерНаПечать) Тогда
		ПредставлениеДокумента = СчетаФактурыУНФКлиентСервер.ПредставлениеСчетаФактуры(Объект.Дата,
			Объект.НомерНаПечать, Истина);
	Иначе
		ПредставлениеДокумента = СчетаФактурыУНФКлиентСервер.ПредставлениеСчетаФактуры(Объект.Дата,
			Объект.Номер);
	КонецЕсли;
	ПараметрыЗаписи.ПараметрыОповещения.ПредставлениеСчетФактуры = ПредставлениеДокумента;
	
	Оповестить("ОбновлениеТекстаПроСчетФактуру", ПараметрыЗаписи.ПараметрыОповещения, Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДанныеДляИзмененияДаты = ДокументыУНФКлиент.ДанныеДляИзмененияДаты(ЭтотОбъект, Объект);
	Если ДанныеДляИзмененияДаты.ДатаНеМенялась Тогда
		Возврат;
	КонецЕсли;
	
	ДатаПриИзмененииНаСервере(ДанныеДляИзмененияДаты);
	
	Если ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		ПересчитатьКурсКратностьВалютыДокумента(ДанныеДляИзмененияДаты);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаФактурыНаПечатьПриИзменении(Элемент)
	Если ЗначениеЗаполнено(НомерСчетаФактуры) Тогда
		Объект.НомерНаПечать = НомерСчетаФактуры;
		Объект.ОтредактированНомерСчетаФактуры = Истина;
	Иначе
		Объект.НомерНаПечать = "";
		Объект.ОтредактированНомерСчетаФактуры = Ложь;
	КонецЕсли;
	ОбновитьНомерНаПечать();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	ОбработатьИзменениеДоговора();
	
КонецПроцедуры


&НаКлиенте
Процедура НадписьСчетФактураНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение( , Объект.ИсправляемыйСчетФактура);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПередИзменением = КэшЗначений.КонтрагентТекущий;
	КэшЗначений.КонтрагентТекущий = Объект.Контрагент;
	
	Если КонтрагентПередИзменением <> Объект.Контрагент Тогда
		
		ДанныеКонтрагента = ДанныеКонтрагентаДляИзменения(Объект.Контрагент);
		Объект.Договор 	= ДанныеКонтрагента.Договор;
		
		ОбработатьИзменениеДоговора();
		
	Иначе
		
		Объект.Договор = КэшЗначений.ДоговорТекущий; // Восстанавливаем автоматически очищенный договор.
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ОбработатьИзменениеДоговора();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = ПолучитьПараметрыФормыВыбора(Объект.Ссылка, Объект.Организация, Объект.Контрагент, Объект.Договор, Объект.ВидОперации, Объект.ДокументыОснования);
	Если ПараметрыФормы.КонтролироватьВыборДоговора Тогда
		
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОплатыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("АдресДокументыОплатыВХранилище", ПоместитьВХранилищеТабличнуюЧасть("ДатаНомерДокументовОплаты"));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДокументыОплатыНажатиеЗавершение", ЭтотОбъект, ПараметрыПодбора);
	ОткрытьФорму("Документ.СчетФактура.Форма.ФормаРедактированияДокументовОплаты", ПараметрыПодбора , , , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОплатыНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	АдресДокументыОплатыВХранилище = ДополнительныеПараметры.АдресДокументыОплатыВХранилище;
	
	Если Результат = КодВозвратаДиалога.OK Тогда
		
		Модифицированность = Истина;
		ПолучитьДокументыОплатыИзХранилища(АдресДокументыОплатыВХранилище);
		
	КонецЕсли;
	
	УстановитьНадписьДокументыОплаты();
	
КонецПроцедуры // ДокументыОплатыНажатие()

&НаКлиенте
Процедура ВыставленСтатусПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаВыставления", "Доступность", Объект.ВыставленСтатус = 2);
	Объект.ДатаВыставления = ?(Объект.ВыставленСтатус = 2, Объект.Дата, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура КодСпособаВыставленияПриИзменении(Элемент)
	
	Объект.ВыставленСтатус = ?(Объект.КодСпособаВыставления = 2, 1, 2);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаВыставления", "Доступность", Объект.ВыставленСтатус = 2);
	Объект.ДатаВыставления = ?(Объект.ВыставленСтатус = 2, Объект.Дата, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	Если КэшЗначений.Свойство("ПрошлаяВалюта") Тогда
		
		КэшЗначений.ПрошлаяВалюта = Объект.ВалютаДокумента;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДССуммовойРазницыПриИзменении(Элемент)
	
	РассчитатьСуммыДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	
	РассчитатьСуммыДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДекорацияРеквизитыПечатиНажатие(Элемент)
	
	ОткрытьФормуРеквизитыПечати();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокДокументовОснований(Команда)
	
	Если Объект.СводныйКомиссионный
		ИЛИ Объект.СводныйКорректировочный Тогда
		
		ТекстСообщения = НСтр("ru ='Основание сводного счета-фактуры не редактируется.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;
	
	АдресДокументовОснований = ПоместитьВХранилищеТабличнуюЧасть("ДокументыОснования");
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Ссылка",			Объект.Ссылка);
	ПараметрыПодбора.Вставить("ВидОперации",	Объект.ВидОперации);
	ПараметрыПодбора.Вставить("Организация",	Объект.Организация);
	ПараметрыПодбора.Вставить("Контрагент",		Объект.Контрагент);
	ПараметрыПодбора.Вставить("Договор",		Объект.Договор);
	ПараметрыПодбора.Вставить("Валюта",			Объект.ВалютаДокумента);
	ПараметрыПодбора.Вставить("Исправление",	Объект.Исправление);
	ПараметрыПодбора.Вставить("ЭтоВозврат",		Объект.ЭтоВозврат);
	ПараметрыПодбора.Вставить("АдресОснований",	АдресДокументовОснований);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьСписокДокументовОснованийЗавершение", ЭтотОбъект);
	ОткрытьФорму("Документ.СчетФактура.Форма.ФормаДокументыОснования", ПараметрыПодбора, ЭтаФорма, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокДокументовОснованийЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура")
		И РезультатВыбора.ВыполненаКоманда = КодВозвратаДиалога.OK Тогда
		
		ЗаполнитьПоДокументамОснованиямНаКлиенте(РезультатВыбора.АдресОснований);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.ДокументыОснования.Количество() < 1 Тогда
		
		ОткрытьСписокДокументовОснований(Неопределено);
		Возврат;
		
	КонецЕсли;
	
	ПоказатьЗначение(Неопределено, Объект.ДокументыОснования[0].ДокументОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаАвансаНажатие(Элемент)
	
	АдресРасшифровки = ПоместитьВХранилищеТабличнуюЧасть("Авансы");
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Ссылка",			Объект.Ссылка);
	ПараметрыПодбора.Вставить("Дата",			Объект.Дата);
	ПараметрыПодбора.Вставить("ВидОперации",	Объект.ВидОперации);
	ПараметрыПодбора.Вставить("Организация",	Объект.Организация);
	ПараметрыПодбора.Вставить("Контрагент",		Объект.Контрагент);
	ПараметрыПодбора.Вставить("Договор",		Объект.Договор);
	ПараметрыПодбора.Вставить("Валюта",			Объект.ВалютаДокумента);
	ПараметрыПодбора.Вставить("СуммаНДС",		Объект.СуммаНДСДокумента);
	ПараметрыПодбора.Вставить("Сумма",			Объект.СуммаДокумента);
	ПараметрыПодбора.Вставить("АдресРасшифровки",АдресРасшифровки);
	ПараметрыПодбора.Вставить("ДопустимаКорректировка", НЕ Объект.ДокументыОснования.Количество() > 1);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("РасшифровкаАвансаЗавершение", ЭтотОбъект);
	ОткрытьФорму("Документ.СчетФактура.Форма.ФормаРасшифровкаАванса", ПараметрыПодбора, ЭтаФорма, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаАвансаЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		
		Если РезультатВыбора.ВыполненаКоманда = КодВозвратаДиалога.OK Тогда
			
			Модифицированность = Истина;
			ЗаполнитьРасшифровкуАванса(РезультатВыбора.АдресРасшифровки);
			
			ИмяПредопределенного = "Перечисление.ВидыОперацийСчетФактура." + ?(РезультатВыбора.ЭтоКорректировкаАвансаНДС20 = Истина, "КорректировкаАванса", "Аванс");
			НовыйВидОперации = ПредопределенноеЗначение(ИмяПредопределенного);
			Если Объект.ВидОперации <> НовыйВидОперации Тогда
				
				Объект.ВидОперации = НовыйВидОперации;
				ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область УчетОригиналовПервичныхДокументов

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ИзменитьСостояниеОригинала(Команда)
	УчетОригиналовПервичныхДокументовУНФКлиент.ИзменитьСостояниеОригинала(Команда, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДатаПриИзмененииНаСервере(ДанныеДляИзмененияДаты)
	
	ДокументыУНФ.ДатаПриИзменении(ДанныеДляИзмененияДаты, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ДокументыУНФ.ОрганизацияПриИзменении(ЭтотОбъект, Объект);
	
	Объект.Договор = Справочники.ДоговорыКонтрагентов.ПоДокументуКонтрагентуОрганизацииИВидуОперации(Объект.Ссылка,
		Объект.Контрагент, Объект.Организация, Объект.ВидОперации);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеДоговора()
	
	ДоговорПередИзменением = КэшЗначений.ДоговорТекущий;
	КэшЗначений.ДоговорТекущий = Объект.Договор;
	
	Если ДоговорПередИзменением <> Объект.Договор Тогда
		
		ДанныеДоговора = ДанныеДоговораДляИзменения(ДатаДокумента, Объект.Договор, Объект.ВидОперации);
		
		Объект.ВалютаДокумента = ?(ДанныеДоговора.РасчетыВУсловныхЕдиницах, КэшЗначений.НациональнаяВалюта,
			ДанныеДоговора.ВалютаРасчетов);
		
		Если ЗначениеЗаполнено(Объект.Договор) Тогда 
			
			Объект.Курс = ?(ДанныеДоговора.ВалютаРасчетовКурсКратность.Курс = 0, 1,
				ДанныеДоговора.ВалютаРасчетовКурсКратность.Курс);
			Объект.Кратность = ?(ДанныеДоговора.ВалютаРасчетовКурсКратность.Кратность = 0, 1,
				ДанныеДоговора.ВалютаРасчетовКурсКратность.Кратность);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДокументамОснованиямНаКлиенте(АдресДокументыОснованияВХранилище)
	
	ЗаполнитьПоДокументамОснованиям(АдресДокументыОснованияВХранилище);
	ЗаглавиеДокументовОснований();
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаглавиеДокументовОснований()
	
	Если Объект.ДокументыОснования.Количество() = 0 Тогда
		
		Содержание = НСтр("ru ='Выбор'");
		
	Иначе
		
		Содержание = Строка(Объект.ДокументыОснования[0].ДокументОснование);
		Если Объект.ДокументыОснования.Количество() > 1 Тогда
			
			Содержание = Содержание + СтрШаблон(НСтр("ru =' (и еще %1 док.)'"), Объект.ДокументыОснования.Количество() - 1);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ДокументыОснования = Содержание;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодвалФормы()
	
	ИтогВсего = Объект.СуммаДокумента + Объект.СуммаНДСДокумента;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзмененияРеквизитовПечати(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ПечатьДокументовУНФКлиент.ОбновитьЗначенияРеквизитовПечати(ЭтотОбъект, Результат.ИзмененныеРеквизиты);
		
		Если Результат.Свойство("Команда") Тогда
			
			Подключаемый_ВыполнитьКоманду(Результат.Команда);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьКурсКратностьВалютыДокумента(СтруктураДанные)
	
	КурсНовый = ?(СтруктураДанные.ВалютаКурсКратность.Курс = 0, 1, СтруктураДанные.ВалютаКурсКратность.Курс);
	КратностьНовый = ?(СтруктураДанные.ВалютаКурсКратность.Кратность = 0, 1, СтруктураДанные.ВалютаКурсКратность.Кратность);
	
	Если Объект.Курс <> КурсНовый
		ИЛИ Объект.Кратность <> КратностьНовый Тогда
		
		КурсВалютыСтрокой = Строка(Объект.Кратность) + " " + СокрЛП(Объект.ВалютаДокумента) + " = " + Строка(Объект.Курс) + " " + СокрЛП(КэшЗначений.НациональнаяВалюта);
		КурсНовыйВалютыСтрокой = Строка(КратностьНовый) + " " + СокрЛП(Объект.ВалютаДокумента) + " = " + Строка(КурсНовый) + " " + СокрЛП(КэшЗначений.НациональнаяВалюта);
		
		ТекстВопроса = НСтр("ru = 'На дату документа у валюты документа (" + КурсВалютыСтрокой + ") был задан курс.
									|Установить курс документа (" + КурсНовыйВалютыСтрокой + ") в соответствии с курсом валюты?'");
									
		НовыйКурсКратность = Новый Структура;
		НовыйКурсКратность.Вставить("КурсНовый", КурсНовый);
		НовыйКурсКратность.Вставить("КратностьНовый", КратностьНовый);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОпределитьНеобходимостьУстановкиНовогоКурсаИКратности", ЭтотОбъект, НовыйКурсКратность);
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры // ПересчитатьКурсКратностьВалютыДокумента()

&НаСервере
Функция ПоместитьВХранилищеТабличнуюЧасть(ИмяТабличнойЧасти)
	Перем ТабличнаяЧасть;
	
	Если ИмяТабличнойЧасти = "ДокументыОснования" Тогда
		
		ТабличнаяЧасть = Объект.ДокументыОснования.Выгрузить(, "ДокументОснование, НаименованиеДокументаОтгрузки");
		
	ИначеЕсли ИмяТабличнойЧасти = "Авансы" Тогда
		
		ТабличнаяЧасть = Объект.Авансы.Выгрузить();
		
	ИначеЕсли ИмяТабличнойЧасти = "ДатаНомерДокументовОплаты" Тогда
		
		ТабличнаяЧасть = Объект.ДатаНомерДокументовОплаты.Выгрузить();
		
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(ТабличнаяЧасть, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоДокументамОснованиям(АдресДокументыОснованияВХранилище)
	
	Если АдресДокументыОснованияВХранилище = Неопределено Тогда
		
		Если Объект.ДокументыОснования.Количество() < 1 Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ТаблицаДокументыОснования = Объект.ДокументыОснования.Выгрузить();
		
	Иначе
		
		ТаблицаДокументыОснования = ПолучитьИзВременногоХранилища(АдресДокументыОснованияВХранилище);
		
	КонецЕсли;
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийСчетФактура.КорректировкаАванса
		И ТаблицаДокументыОснования.Количество() > 1 Тогда
		
		ВызватьИсключение НСтр("ru ='Корректировка аванса может содержать только один документ-основание.'");
		
	КонецЕсли;
	
	Документ = РеквизитФормыВЗначение("Объект");
	
	Если Документ.ВидОперации = Перечисления.ВидыОперацийСчетФактура.СуммовыеРазницы Тогда
		
		Документ.ДополнительныеСвойства.Вставить("ЭтоСуммоваяРазница", Истина);
		
	КонецЕсли;
	
	Документ.Заполнить(ТаблицаДокументыОснования);
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасшифровкуАванса(АдресРасшифровкиАвансаВХранилище)
	
	ТаблицаРасшифровкаАванса = ПолучитьИзВременногоХранилища(АдресРасшифровкиАвансаВХранилище);
	
	Объект.Авансы.Очистить();
	Объект.Авансы.Загрузить(ТаблицаРасшифровкаАванса);
	
	Объект.СуммаНДСДокумента = Объект.Авансы.Итог("СуммаНДС")  - Объект.Авансы.Итог("СуммаНДСДоКорректировки");;
	Объект.СуммаДокумента = Объект.Авансы.Итог("Сумма") - Объект.Авансы.Итог("СуммаДоКорректировки") - Объект.СуммаНДСДокумента;
	
	ИтогВсего = Объект.СуммаНДСДокумента + Объект.СуммаДокумента;
	
КонецПроцедуры

&НаСервере
Функция ДанныеКонтрагентаДляИзменения(Знач Контрагент)
	
	ДоговорПоУмолчанию = Справочники.ДоговорыКонтрагентов.ПоДокументуКонтрагентуОрганизацииИВидуОперации(Объект.Ссылка,
		Контрагент, Объект.Организация, Объект.ВидОперации);
	
	Результат = Новый Структура;
	Результат.Вставить("Договор", ДоговорПоУмолчанию);
	
	УстановитьСвойстваРеквизитовФормы();
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеДоговораДляИзменения(Знач Дата, Знач Договор, Знач ВидОперации)
		
	Результат = Новый Структура;
	Результат.Вставить("ВалютаРасчетов", Договор.ВалютаРасчетов);
	Результат.Вставить("ВалютаРасчетовКурсКратность", РаботаСКурсамиВалют.ПолучитьКурсВалюты(Договор.ВалютаРасчетов,
		Дата));
	Результат.Вставить("РасчетыВУсловныхЕдиницах", Договор.РасчетыВУсловныхЕдиницах);
	Результат.Вставить("СуммаВключаетНДС", Ложь);
	ДопустимыеВидыОпераций = Новый Массив;
	ДопустимыеВидыОпераций.Добавить(Перечисления.ВидыОперацийСчетФактура.Продажа);
	ДопустимыеВидыОпераций.Добавить(Перечисления.ВидыОперацийСчетФактура.Корректировка);
	Результат.Вставить("ПодходящийВО", (ДопустимыеВидыОпераций.Найти(ВидОперации) <> Неопределено));
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПолучитьДокументыОплатыИзХранилища(АдресДокументыОплатыВХранилище)
	
	// Проверим, были ли изменения.
	// При вводе на основании данные уже должны быть заполнены.
	// Если пользователь меняет их вручную, то считаем, что вариант пользователя более приоритетен.
	// Проверяем не зависимо от того, записан документ или нет.
	// Пользователь мог передумать и поменять все обратно. Значит будем проверять при любых значениях реквизита
	// Объект.ДанныеОбОплатеИзмененыВручную.
	Объект.ДанныеОбОплатеИзмененыВручную = Ложь;
	ТаблицаИзФормыРедактирования = ПолучитьИзВременногоХранилища(АдресДокументыОплатыВХранилище);
	Если ДатаНомерДокументовОплатыПриСоздании.Количество() <> ТаблицаИзФормыРедактирования.Количество() Тогда
		Объект.ДанныеОбОплатеИзмененыВручную = Истина;
	Иначе
		Сч = 0;
		Для каждого ТекущаяСтрока Из ДатаНомерДокументовОплатыПриСоздании Цикл
			Если ТекущаяСтрока.ДатаПлатежноРасчетногоДокумента <> ТаблицаИзФормыРедактирования[Сч].ДатаПлатежноРасчетногоДокумента
				ИЛИ ТекущаяСтрока.НомерПлатежноРасчетногоДокумента <> ТаблицаИзФормыРедактирования[Сч].НомерПлатежноРасчетногоДокумента
				Тогда
				Объект.ДанныеОбОплатеИзмененыВручную = Истина;
				Прервать;
			КонецЕсли;
			Сч = Сч + 1;
		КонецЦикла;
	КонецЕсли;
	
	// Загрузим данные в табличную часть документа
	Объект.ДатаНомерДокументовОплаты.Загрузить(ПолучитьИзВременногоХранилища(АдресДокументыОплатыВХранилище));
	
КонецПроцедуры // ПолучитьДокументыОплатыИзХранилища()

&НаСервере
Процедура УстановитьСвойстваРеквизитовФормы()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Договор", "Видимость", Объект.Контрагент.ВестиРасчетыПоДоговорам);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНомерДата", "Видимость", Не Объект.Исправление);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИсправлениеНомерДата", "Видимость", Объект.Исправление);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьСчетФактура", "Видимость", Объект.ВидОперации = Перечисления.ВидыОперацийСчетФактура.Корректировка ИЛИ Объект.Исправление);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасшифровкаАванса", "Видимость", Объект.ВидОперации = Перечисления.ВидыОперацийСчетФактура.Аванс ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийСчетФактура.КорректировкаАванса);
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийСчетФактура.СуммовыеРазницы Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СуммаДокумента", "ТолькоПросмотр", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СуммаНДСДокумента", "ТолькоПросмотр", Ложь);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтавкаНДССуммовойРазницы", "Видимость", Ложь);
		
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НомерСчетаФактуры", "Видимость",
		НЕ Объект.Исправление
			И (Объект.ВидОперации = Перечисления.ВидыОперацийСчетФактура.Продажа ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийСчетФактура.Корректировка));
	
	ТекстНадписи = "";
	Если ЗначениеЗаполнено(Объект.НомерИсходногоДокумента) Тогда
		
		ТекстНадписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 от %2'"),
			Объект.НомерИсходногоДокумента, Формат(Объект.ДатаИсходногоДокумента,"ДЛФ=Д"));
		
	КонецЕсли;
	
	НадписьСчетФактура = ТекстНадписи;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммыДокумента()
	
	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(Объект.СтавкаНДССуммовойРазницы);
	
	Объект.СуммаНДСДокумента = ОКР(Объект.СуммаДокумента * СтавкаНДС / 100, 2);
	ИтогВсего = Объект.СуммаДокумента + Объект.СуммаНДСДокумента;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыФормыВыбора(Документ, Организация, Контрагент, Договор, ВидОперации, Знач ДокументыОснования)
	
	СписокВидовДоговоров = Справочники.ДоговорыКонтрагентов.ПолучитьСписокВидовДоговораДляДокумента(Документ, ВидОперации);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КонтролироватьВыборДоговора", Контрагент.ВестиРасчетыПоДоговорам);
	ПараметрыФормы.Вставить("Контрагент", Контрагент);
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("ВидыДоговоров", СписокВидовДоговоров);
	ПараметрыФормы.Вставить("ТекущаяСтрока", Договор);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	// Интеркампани
	Интеркампани = Ложь;
	Если ПолучитьФункциональнуюОпцию("ПередачаТоваровМеждуОрганизациями") Тогда
		Для каждого СтрокаОснования Из ДокументыОснования Цикл
			Если ТипЗнч(СтрокаОснования.ДокументОснование) = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") 
				И ЗначениеЗаполнено(СтрокаОснования.ДокументОснование) Тогда
				Интеркампани = Истина;
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли; 
	Если Интеркампани Тогда
		ПараметрыФормы.Вставить("Владелец", Организация);
		ПараметрыФормы.Вставить("Интеркампани", Истина);
		ПараметрыФормы.Вставить("ЭтоПоступление", Истина);
	КонецЕсли;
	// Конец Интеркампани
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуРеквизитыПечати()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзмененияРеквизитовПечати", ЭтотОбъект);
	ОткрытьФорму("Обработка.РеквизитыПечати.Форма.РеквизитыПечатиСчетФактура", Новый Структура("КонтекстПечати", Объект), ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры 

#Область АвтоподборКонтактов

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	АвтоподборКонтактовКлиент.Подключаемый_ОбработкаВыбора(ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_АвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	АвтоподборКонтактовКлиент.Подключаемый_АвтоПодбор(ЭтотОбъект, Элемент, Текст, ДанныеВыбора, Параметры, Ожидание,
		СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиРезультатовИнтерактивныхДействий

&НаКлиенте
Процедура ОпределитьНеобходимостьУстановкиНовогоКурсаИКратности(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = КодВозвратаДиалога.Да Тогда
		
		Объект.Курс = ДополнительныеПараметры.КурсНовый;
		Объект.Кратность = ДополнительныеПараметры.КратностьНовый;
		
	КонецЕсли;
	
КонецПроцедуры // ОпределитьНеобходимостьПересчетаПоНовомуКурсу()

#КонецОбласти

#Область УправлениеВнешнимВидом

&НаКлиенте
Процедура УстановитьНадписьДокументыОплаты()
	
	Если Объект.ДатаНомерДокументовОплаты.Количество() = 0 Тогда
		ДокументыОплаты = НСтр("ru='Редактировать...'");
	КонецЕсли;
	
	ПредставленияДокументовОплаты = Новый Массив;
	
	Для каждого ТекСтрока Из Объект.ДатаНомерДокументовОплаты Цикл
		ПредставленияДокументовОплаты.Добавить(СтрШаблон(НСтр("ru = '№ %1 от %2'"),
			ТекСтрока.НомерПлатежноРасчетногоДокумента, Формат(ТекСтрока.ДатаПлатежноРасчетногоДокумента, "ДЛФ=D;")));
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПредставленияДокументовОплаты) Тогда
		ДокументыОплаты = СтрСоединить(ПредставленияДокументовОплаты, ", ");
	КонецЕсли;
	
	Если Объект.ДатаНомерДокументовОплаты.Количество() = 1 Тогда
		Элементы.ДокументыОплаты.Заголовок = НСтр("ru = 'Документ оплаты'");
	Иначе
		Элементы.ДокументыОплаты.Заголовок = НСтр("ru = 'Документы оплаты'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНомерНаПечать()
	
	Если Объект.ОтредактированНомерСчетаФактуры И ЗначениеЗаполнено(Объект.НомерНаПечать) Тогда
		НомерСчетаФактуры = Объект.НомерНаПечать;
	Иначе
		НомерСчетаФактуры = РаботаСФормойДокументаКлиентСервер.ПолучитьКороткийНомерДокумента(Объект.Номер);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиБиблиотек

// ЭДО
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбработчикОжиданияЭДО()
	
	ОбменСКонтрагентамиКлиент.ОбработчикОжиданияЭДО(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЭДОНажатие(Элемент, СтандартнаяОбработка)
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
КонецПроцедуры
// Конец ЭДО

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие(Элемент)
	УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы.ДекорацияСостояниеОригинала);
КонецПроцедуры

//Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

#КонецОбласти

&НаКлиенте
Процедура Подключаемый_НажатиеДекорацияИнформацияНовоеФаксимилеЗакрыть(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаИнформацияНовоеФаксимиле", "Видимость", Ложь);
	
	ВыключитьИнформированиеНовоеФаксимиле();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыключитьИнформированиеНовоеФаксимиле()
	
	ПечатьДокументовУНФ.ВыключитьИнформированиеНовоеФаксимиле();
	
КонецПроцедуры

#КонецОбласти

#Область СовместноеИспользование
&НаКлиенте
Процедура Подключаемый_ИнформационнаяПанельСовместногоИспользованияОбработкаНавигационнойСсылки(Источник, НавигационнаяСсылка, СтандартнаяОбработка)
	
	ОписаниеКонтекста = СовместноеИспользованиеКлиентСервер.КонтекстОбработкиСобытия(ЭтотОбъект, Объект);
	СовместноеИспользованиеКлиент.ОбработкаНавигационнойСсылкиИнформационнойПанели(ОписаниеКонтекста, Источник, НавигационнаяСсылка, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ИнформационнаяПанельСовместногоИспользованияЗавершениеДействия(Результат, ДополнительныеПараметры) Экспорт
	
	Подключаемый_ИнформационнаяПанельСовместногоИспользованияЗавершениеДействияНаСервере(Результат, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ИнформационнаяПанельСовместногоИспользованияЗавершениеДействияНаСервере(Результат, ДополнительныеПараметры)
	
	ОписаниеКонтекста = СовместноеИспользованиеКлиентСервер.КонтекстОбработкиСобытия(ЭтотОбъект, Объект);
	СовместноеИспользование.ОбновитьИнформационнуюПанель(ОписаниеКонтекста);
	
КонецПроцедуры
#КонецОбласти     
