
#Область ПрограммныйИнтерфейс

// Проверяет срок действия сертификатов
// Параметры:
//  Объект - ДокументОбъект - Документ для проверки
//  ИмяТабличнойЧасти - Строка - Табличная часть в которой ищем сертификаты,
//                               если не указана, значит в шапке документа
Процедура ПроверитьСрокДействия(Объект, ИмяТабличнойЧасти = "", Отказ) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПодарочныеСертификаты") Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	// Подготовка таблицы для проверки
	Если ИмяТабличнойЧасти = "Запасы" Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Запасы.Номенклатура КАК ПодарочныйСертификат,
		|	Запасы.КлючСвязи КАК КлючСвязи
		|ПОМЕСТИТЬ Запасы
		|ИЗ
		|	&Запасы КАК Запасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СерииНоменклатуры.Серия КАК НомерСертификата,
		|	СерииНоменклатуры.КлючСвязи КАК КлючСвязи
		|ПОМЕСТИТЬ СерииНоменклатуры
		|ИЗ
		|	&СерииНоменклатуры КАК СерииНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Запасы.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	ЕСТЬNULL(СерииНоменклатуры.НомерСертификата, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК НомерСертификата
		|ПОМЕСТИТЬ ПодарочныеСертификаты
		|ИЗ
		|	Запасы КАК Запасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ СерииНоменклатуры КАК СерииНоменклатуры
		|		ПО Запасы.КлючСвязи = СерииНоменклатуры.КлючСвязи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Запасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СерииНоменклатуры";
		Запрос.УстановитьПараметр("Запасы", Объект.Запасы.Выгрузить());
		Запрос.УстановитьПараметр("СерииНоменклатуры", Объект.СерииНоменклатуры.Выгрузить());
		Запрос.Выполнить();
		
	ИначеЕсли ИмяТабличнойЧасти = "БезналичнаяОплата" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	БезналичнаяОплата.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	БезналичнаяОплата.НомерСертификата КАК НомерСертификата
		|ПОМЕСТИТЬ ПодарочныеСертификаты
		|ИЗ
		|	&БезналичнаяОплата КАК БезналичнаяОплата";
		Запрос.УстановитьПараметр("БезналичнаяОплата", Объект.БезналичнаяОплата.Выгрузить());
		Запрос.Выполнить();
		
	ИначеЕсли ИмяТабличнойЧасти = "Предоплата" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Предоплата.Документ КАК ПодарочныйСертификат,
		|	Предоплата.НомерСертификата КАК НомерСертификата
		|ПОМЕСТИТЬ ПодарочныеСертификаты
		|ИЗ
		|	&Предоплата КАК Предоплата
		|ГДЕ
		|	Предоплата.ОплатаСертификатом";
		Запрос.УстановитьПараметр("Предоплата", Объект.Предоплата.Выгрузить());
		Запрос.Выполнить();
		
	ИначеЕсли ИмяТабличнойЧасти = "" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаСертификата.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	ТаблицаСертификата.НомерСертификата КАК НомерСертификата
		|ПОМЕСТИТЬ ПодарочныеСертификаты
		|ИЗ
		|	&ТаблицаСертификата КАК ТаблицаСертификата";
		ТаблицаСертификата = Новый ТаблицаЗначений;
		ТаблицаСертификата.Колонки.Добавить("ПодарочныйСертификат", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаСертификата.Колонки.Добавить("НомерСертификата", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
		СтрокаСертификата = ТаблицаСертификата.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСертификата, Объект);
		Запрос.УстановитьПараметр("ТаблицаСертификата", ТаблицаСертификата);
		Запрос.Выполнить();
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	// Определение периодов окончания сроков действия
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодарочныеСертификаты.ПодарочныйСертификат КАК ПодарочныйСертификат,
	|	ПодарочныеСертификаты.НомерСертификата КАК НомерСертификата,
	|	Номенклатура.Периодичность КАК ПериодичностьДействия,
	|	Номенклатура.КоличествоПериодовДействия КАК КоличествоПериодовДействия
	|ПОМЕСТИТЬ СертификатыСПериодичностью
	|ИЗ
	|	ПодарочныеСертификаты КАК ПодарочныеСертификаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ПодарочныеСертификаты.ПодарочныйСертификат = Номенклатура.Ссылка
	|			И (Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат))
	|			И (Номенклатура.ТипСрокаДействия <> ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.БезОграниченияСрока))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СертификатыСПериодичностью.ПодарочныйСертификат КАК ПодарочныйСертификат,
	|	СертификатыСПериодичностью.НомерСертификата КАК НомерСертификата,
	|	СертификатыСПериодичностью.ПериодичностьДействия КАК ПериодичностьДействия,
	|	СертификатыСПериодичностью.КоличествоПериодовДействия КАК КоличествоПериодовДействия,
	|	МАКСИМУМ(СерииНоменклатурыОбороты.Период) КАК ПериодПродажи
	|ПОМЕСТИТЬ СертификатыСПериодомПродажи
	|ИЗ
	|	СертификатыСПериодичностью КАК СертификатыСПериодичностью
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СерииНоменклатуры.Обороты(, , Регистратор, ) КАК СерииНоменклатурыОбороты
	|		ПО СертификатыСПериодичностью.НомерСертификата = СерииНоменклатурыОбороты.Серия
	|			И (СерииНоменклатурыОбороты.Регистратор ССЫЛКА Документ.РасходнаяНакладная
	|				ИЛИ СерииНоменклатурыОбороты.Регистратор ССЫЛКА Документ.ЧекККМ
	|				ИЛИ СерииНоменклатурыОбороты.Регистратор ССЫЛКА Документ.ЗаказПокупателя)
	|
	|СГРУППИРОВАТЬ ПО
	|	СертификатыСПериодичностью.ПодарочныйСертификат,
	|	СертификатыСПериодичностью.НомерСертификата,
	|	СертификатыСПериодичностью.ПериодичностьДействия,
	|	СертификатыСПериодичностью.КоличествоПериодовДействия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СертификатыСПериодомПродажи.ПодарочныйСертификат КАК ПодарочныйСертификат,
	|	СертификатыСПериодомПродажи.НомерСертификата КАК НомерСертификата,
	|	ВЫБОР
	|		КОГДА Номенклатура.ДатаОкончанияДействия ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА СертификатыСПериодомПродажи.ПериодичностьДействия = ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(СертификатыСПериодомПродажи.ПериодПродажи, ДЕНЬ, СертификатыСПериодомПродажи.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА СертификатыСПериодомПродажи.ПериодичностьДействия = ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(СертификатыСПериодомПродажи.ПериодПродажи, НЕДЕЛЯ, СертификатыСПериодомПродажи.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА СертификатыСПериодомПродажи.ПериодичностьДействия = ЗНАЧЕНИЕ(Перечисление.Периодичность.Декада)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(СертификатыСПериодомПродажи.ПериодПродажи, ДЕКАДА, СертификатыСПериодомПродажи.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА СертификатыСПериодомПродажи.ПериодичностьДействия = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(СертификатыСПериодомПродажи.ПериодПродажи, МЕСЯЦ, СертификатыСПериодомПродажи.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА СертификатыСПериодомПродажи.ПериодичностьДействия = ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(СертификатыСПериодомПродажи.ПериодПродажи, КВАРТАЛ, СертификатыСПериодомПродажи.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА СертификатыСПериодомПродажи.ПериодичностьДействия = ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(СертификатыСПериодомПродажи.ПериодПродажи, ПОЛУГОДИЕ, СертификатыСПериодомПродажи.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА СертификатыСПериодомПродажи.ПериодичностьДействия = ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(СертификатыСПериодомПродажи.ПериодПродажи, ГОД, СертификатыСПериодомПродажи.КоличествоПериодовДействия), ДЕНЬ)
	|					ИНАЧЕ NULL
	|				КОНЕЦ
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(Номенклатура.ДатаОкончанияДействия, ДЕНЬ)
	|	КОНЕЦ КАК СрокОкончания
	|ИЗ
	|	СертификатыСПериодомПродажи КАК СертификатыСПериодомПродажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО СертификатыСПериодомПродажи.ПодарочныйСертификат = Номенклатура.Ссылка
	|			И (Номенклатура.ТипСрокаДействия = ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.СОграничениемНаДату))";
	Результат = Запрос.Выполнить().Выбрать();
	ДатаСравнения = НачалоДня(ТекущаяДатаСеанса());
	Пока Результат.Следующий() Цикл
		Если ЗначениеЗаполнено(Результат.СрокОкончания)
			И Результат.СрокОкончания < ДатаСравнения Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'Срок действия %ПодарочныйСертификат%%НомерСертификата% истек %СрокОкончания%!'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПодарочныйСертификат%", Результат.ПодарочныйСертификат);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСертификата%", ": " + Результат.НомерСертификата);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СрокОкончания%", Формат(Результат.СрокОкончания, "ДФ=dd.MM.yyyy"));
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Выполняет поиск номера среди штрихкодов и серийных номеров
// и возвращает таблицу значений с остатками и сроками действия
// найденных сертификатов
// Параметры:
//  Номер - Строка - Номер сертификата
//
Функция ВыполнитьПоискСертификатаПоНомеру(Номер) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СерииНоменклатуры.Владелец КАК ПодарочныйСертификат,
	|	СерииНоменклатуры.Ссылка КАК НомерСертификата
	|ПОМЕСТИТЬ Сертификаты
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.Продан
	|	И СерииНоменклатуры.Владелец.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
	|	И СерииНоменклатуры.Наименование = &Номер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Номер
	|	И ШтрихкодыНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
	|	И НЕ ШтрихкодыНоменклатуры.Номенклатура.ИспользоватьСерииНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сертификаты.ПодарочныйСертификат КАК ПодарочныйСертификат,
	|	Сертификаты.НомерСертификата КАК НомерСертификата,
	|	Номенклатура.ТипСрокаДействия КАК ТипСрокаДействия,
	|	Номенклатура.Периодичность КАК Периодичность,
	|	Номенклатура.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	Номенклатура.КоличествоПериодовДействия КАК КоличествоПериодовДействия
	|ПОМЕСТИТЬ СертификатыСРеквизитами
	|ИЗ
	|	Сертификаты КАК Сертификаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО Сертификаты.ПодарочныйСертификат = Номенклатура.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СерииНоменклатурыОбороты.Серия КАК Серия,
	|	МАКСИМУМ(СерииНоменклатурыОбороты.Период) КАК Период
	|ПОМЕСТИТЬ ПродажиСерийНоменклатуры
	|ИЗ
	|	РегистрНакопления.СерииНоменклатуры.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Серия В
	|				(ВЫБРАТЬ
	|					Сертификаты.НомерСертификата КАК НомерСертификата
	|				ИЗ
	|					Сертификаты КАК Сертификаты)) КАК СерииНоменклатурыОбороты
	|ГДЕ
	|	(СерииНоменклатурыОбороты.Регистратор ССЫЛКА Документ.РасходнаяНакладная
	|			ИЛИ СерииНоменклатурыОбороты.Регистратор ССЫЛКА Документ.ЧекККМ
	|			ИЛИ СерииНоменклатурыОбороты.Регистратор ССЫЛКА Документ.ЗаказПокупателя)
	|
	|СГРУППИРОВАТЬ ПО
	|	СерииНоменклатурыОбороты.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СертификатыСРеквизитами.ПодарочныйСертификат КАК ПодарочныйСертификат,
	|	СертификатыСРеквизитами.НомерСертификата КАК НомерСертификата,
	|	ВЫБОР
	|		КОГДА СертификатыСРеквизитами.ТипСрокаДействия = ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.СОграничениемНаДату)
	|			ТОГДА СертификатыСРеквизитами.ДатаОкончанияДействия
	|		КОГДА СертификатыСРеквизитами.ТипСрокаДействия = ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.ПериодПослеПродажи)
	|			ТОГДА ВЫБОР
	|					КОГДА СертификатыСРеквизитами.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПродажиСерийНоменклатуры.Период, ДЕНЬ, СертификатыСРеквизитами.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА СертификатыСРеквизитами.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПродажиСерийНоменклатуры.Период, НЕДЕЛЯ, СертификатыСРеквизитами.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА СертификатыСРеквизитами.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Декада)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПродажиСерийНоменклатуры.Период, ДЕКАДА, СертификатыСРеквизитами.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА СертификатыСРеквизитами.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПродажиСерийНоменклатуры.Период, МЕСЯЦ, СертификатыСРеквизитами.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА СертификатыСРеквизитами.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПродажиСерийНоменклатуры.Период, КВАРТАЛ, СертификатыСРеквизитами.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА СертификатыСРеквизитами.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПродажиСерийНоменклатуры.Период, ПОЛУГОДИЕ, СертификатыСРеквизитами.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА СертификатыСРеквизитами.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПродажиСерийНоменклатуры.Период, ГОД, СертификатыСРеквизитами.КоличествоПериодовДействия), ДЕНЬ)
	|					ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|				КОНЕЦ
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаОкончания,
	|	ВЫБОР
	|		КОГДА СертификатыСРеквизитами.ПодарочныйСертификат.ИспользоватьСерииНоменклатуры
	|			ТОГДА ЕСТЬNULL(ПодарочныеСертификатыОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ СертификатыСРеквизитами.ПодарочныйСертификат.Номинал
	|	КОНЕЦ КАК Остаток
	|ИЗ
	|	СертификатыСРеквизитами КАК СертификатыСРеквизитами
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиСерийНоменклатуры КАК ПродажиСерийНоменклатуры
	|		ПО СертификатыСРеквизитами.НомерСертификата = ПродажиСерийНоменклатуры.Серия
	|			И (СертификатыСРеквизитами.ТипСрокаДействия = ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.ПериодПослеПродажи))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПодарочныеСертификаты.Остатки КАК ПодарочныеСертификатыОстатки
	|		ПО СертификатыСРеквизитами.ПодарочныйСертификат = ПодарочныеСертификатыОстатки.ПодарочныйСертификат
	|			И СертификатыСРеквизитами.НомерСертификата = ПодарочныеСертификатыОстатки.НомерСертификата");
	
	Запрос.УстановитьПараметр("Номер", Номер);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает структуру с остатком и сроком действия переданного сертификата
// Параметры:
//  ПодарочныйСертификат - Справочник.Номенклатура - Вид искомого сертификата
//  НомерСертификата - Справочник.СерииНоменклатуры - Номер искомого сертификата
//
Функция ПолучитьСтруктуруДанныхСертификата(ПодарочныйСертификат, НомерСертификата, Документ = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК ПодарочныйСертификат,
	|	ЕСТЬNULL(СерииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
	|	Номенклатура.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	Номенклатура.КоличествоПериодовДействия КАК КоличествоПериодовДействия,
	|	Номенклатура.Периодичность КАК Периодичность,
	|	Номенклатура.ТипСрокаДействия КАК ТипСрокаДействия
	|ПОМЕСТИТЬ Сертификаты
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО (СерииНоменклатуры.Ссылка = &НомерСертификата)
	|ГДЕ
	|	Номенклатура.Ссылка = &ПодарочныйСертификат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СерииНоменклатурыОбороты.Серия КАК Серия,
	|	МАКСИМУМ(СерииНоменклатурыОбороты.Период) КАК Период
	|ПОМЕСТИТЬ ПродажиСерийНоменклатуры
	|ИЗ
	|	РегистрНакопления.СерииНоменклатуры.Обороты(, , Регистратор, Серия = &НомерСертификата) КАК СерииНоменклатурыОбороты
	|ГДЕ
	|	(СерииНоменклатурыОбороты.Регистратор ССЫЛКА Документ.РасходнаяНакладная
	|			ИЛИ СерииНоменклатурыОбороты.Регистратор ССЫЛКА Документ.ЧекККМ
	|			ИЛИ СерииНоменклатурыОбороты.Регистратор ССЫЛКА Документ.ЗаказПокупателя
	|			ИЛИ СерииНоменклатурыОбороты.Регистратор ССЫЛКА Документ.ВводНачальныхОстатков)
	|
	|СГРУППИРОВАТЬ ПО
	|	СерииНоменклатурыОбороты.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодарочныеСертификатыОбороты.ПодарочныйСертификат КАК ПодарочныйСертификат,
	|	ПодарочныеСертификатыОбороты.НомерСертификата КАК НомерСертификата,
	|	ПодарочныеСертификатыОбороты.СуммаОборот КАК СуммаОборот
	|ПОМЕСТИТЬ ОборотПоДокументу
	|ИЗ
	|	РегистрНакопления.ПодарочныеСертификаты.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			ПодарочныйСертификат = &ПодарочныйСертификат
	|				И НомерСертификата = &НомерСертификата) КАК ПодарочныеСертификатыОбороты
	|ГДЕ
	|	ПодарочныеСертификатыОбороты.Регистратор = &Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ПодарочныеСертификатыОстатки.СуммаОстаток, 0) - ЕСТЬNULL(ОборотПоДокументу.СуммаОборот, 0) - ЕСТЬNULL(ПодарочныеСертификатыКСписаниюСерверЛояльности.КСписанию, 0) КАК Остаток,
	|	ВЫБОР
	|		КОГДА Сертификаты.ТипСрокаДействия = ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.СОграничениемНаДату)
	|			ТОГДА Сертификаты.ДатаОкончанияДействия
	|		КОГДА Сертификаты.ТипСрокаДействия = ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.ПериодПослеПродажи)
	|			ТОГДА ВЫБОР
	|					КОГДА Сертификаты.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПродажиСерийНоменклатуры.Период, ДЕНЬ, Сертификаты.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА Сертификаты.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПродажиСерийНоменклатуры.Период, НЕДЕЛЯ, Сертификаты.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА Сертификаты.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Декада)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПродажиСерийНоменклатуры.Период, ДЕКАДА, Сертификаты.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА Сертификаты.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПродажиСерийНоменклатуры.Период, МЕСЯЦ, Сертификаты.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА Сертификаты.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПродажиСерийНоменклатуры.Период, КВАРТАЛ, Сертификаты.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА Сертификаты.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПродажиСерийНоменклатуры.Период, ПОЛУГОДИЕ, Сертификаты.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА Сертификаты.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПродажиСерийНоменклатуры.Период, ГОД, Сертификаты.КоличествоПериодовДействия), ДЕНЬ)
	|					ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|				КОНЕЦ
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаОкончания
	|ИЗ
	|	Сертификаты КАК Сертификаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиСерийНоменклатуры КАК ПродажиСерийНоменклатуры
	|		ПО Сертификаты.Серия = ПродажиСерийНоменклатуры.Серия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПодарочныеСертификаты.Остатки(
	|				,
	|				ПодарочныйСертификат = &ПодарочныйСертификат
	|					И НомерСертификата = &НомерСертификата) КАК ПодарочныеСертификатыОстатки
	|		ПО Сертификаты.ПодарочныйСертификат = ПодарочныеСертификатыОстатки.ПодарочныйСертификат
	|			И Сертификаты.Серия = ПодарочныеСертификатыОстатки.НомерСертификата
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОборотПоДокументу КАК ОборотПоДокументу
	|		ПО Сертификаты.ПодарочныйСертификат = ОборотПоДокументу.ПодарочныйСертификат
	|			И Сертификаты.Серия = ОборотПоДокументу.НомерСертификата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодарочныеСертификатыКСписаниюСерверЛояльности КАК ПодарочныеСертификатыКСписаниюСерверЛояльности
	|		ПО Сертификаты.ПодарочныйСертификат = ПодарочныеСертификатыКСписаниюСерверЛояльности.ПодарочныйСертификат
	|			И Сертификаты.Серия = ПодарочныеСертификатыКСписаниюСерверЛояльности.СерийныйНомер");
	
	Запрос.УстановитьПараметр("ПодарочныйСертификат", ПодарочныйСертификат);
	Запрос.УстановитьПараметр("НомерСертификата", НомерСертификата);
	Запрос.УстановитьПараметр("Регистратор", Документ);
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Остаток", 0);
	СтруктураВозврата.Вставить("Доступно", 0);
	СтруктураВозврата.Вставить("УстановленЛимит", Ложь);
	СтруктураВозврата.Вставить("ДатаОкончания", Дата('00010101'));

	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Результат);
	КонецЕсли;
	
	Если ПодарочныйСертификат.НоменклатураГруппыЦеновыеГруппы.Количество()
		И НЕ ПодарочныйСертификат.СпособОграниченияСертификата = Перечисления.СпособыОграниченияПодарочныхСертификатов.НеОграничен
		И ЗначениеЗаполнено(Документ) Тогда
		ЗапросОграничения = Новый Запрос;
		ЗапросОграничения.Текст = РаботаСПодарочнымиСертификатами.ТекстЗапросаОграниченийПодарочногоСертификата();
		ЗапросОграничения.УстановитьПараметр("Товары", Документ.Запасы);
		РаботаСПодарочнымиСертификатами.УстановитьПараметрыЗапросаОграниченийПодарочногоСертификата(ЗапросОграничения, ПодарочныйСертификат);
		СуммаВозможнойОплаты = ЗапросОграничения.Выполнить().Выгрузить().Итог("Сумма");
		СтруктураВозврата.Доступно = Мин(СуммаВозможнойОплаты, СтруктураВозврата.Остаток);
		СтруктураВозврата.УстановленЛимит = Истина;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Возвращает таблицу с остатками и окончанием действия переданных сертификатов
// Параметры:
//  ТаблицаСертификатов - ТаблицаЗначений - содержит колонки:
//   *ПодарочныйСертификат - СправочникСсылка.Номенклатура
//   *НомерСертификата - СправочникСсылка.СерииНоменклатуры
//
Функция ПолучитьСтруктуруДанныхПоТаблицеСертификатов(ТаблицаСертификатов) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаСертификатов.ПодарочныйСертификат КАК ПодарочныйСертификат,
	|	ТаблицаСертификатов.НомерСертификата КАК НомерСертификата
	|ПОМЕСТИТЬ ТаблицаСертификатов
	|ИЗ
	|	&ТаблицаСертификатов КАК ТаблицаСертификатов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСертификатов.ПодарочныйСертификат КАК ПодарочныйСертификат,
	|	ТаблицаСертификатов.НомерСертификата КАК НомерСертификата,
	|	Номенклатура.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	Номенклатура.КоличествоПериодовДействия КАК КоличествоПериодовДействия,
	|	Номенклатура.Периодичность КАК Периодичность,
	|	Номенклатура.ТипСрокаДействия КАК ТипСрокаДействия
	|ПОМЕСТИТЬ Сертификаты
	|ИЗ
	|	ТаблицаСертификатов КАК ТаблицаСертификатов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ТаблицаСертификатов.ПодарочныйСертификат = Номенклатура.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СерииНоменклатурыОбороты.Серия КАК Серия,
	|	МАКСИМУМ(СерииНоменклатурыОбороты.Период) КАК Период
	|ПОМЕСТИТЬ ПродажиСерийНоменклатуры
	|ИЗ
	|	РегистрНакопления.СерииНоменклатуры.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Серия В
	|				(ВЫБРАТЬ
	|					ТаблицаСертификатов.НомерСертификата КАК НомерСертификата
	|				ИЗ
	|					ТаблицаСертификатов КАК ТаблицаСертификатов)) КАК СерииНоменклатурыОбороты
	|ГДЕ
	|	(СерииНоменклатурыОбороты.Регистратор ССЫЛКА Документ.РасходнаяНакладная
	|			ИЛИ СерииНоменклатурыОбороты.Регистратор ССЫЛКА Документ.ЧекККМ
	|			ИЛИ СерииНоменклатурыОбороты.Регистратор ССЫЛКА Документ.ЗаказПокупателя)
	|
	|СГРУППИРОВАТЬ ПО
	|	СерииНоменклатурыОбороты.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сертификаты.ПодарочныйСертификат КАК ПодарочныйСертификат,
	|	Сертификаты.НомерСертификата КАК НомерСертификата,
	|	ЕСТЬNULL(ПодарочныеСертификатыОстатки.СуммаОстаток, 0) КАК Остаток,
	|	ВЫБОР
	|		КОГДА Сертификаты.ТипСрокаДействия = ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.СОграничениемНаДату)
	|			ТОГДА Сертификаты.ДатаОкончанияДействия
	|		КОГДА Сертификаты.ТипСрокаДействия = ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.ПериодПослеПродажи)
	|			ТОГДА ВЫБОР
	|					КОГДА Сертификаты.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПродажиСерийНоменклатуры.Период, ДЕНЬ, Сертификаты.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА Сертификаты.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПродажиСерийНоменклатуры.Период, НЕДЕЛЯ, Сертификаты.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА Сертификаты.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Декада)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПродажиСерийНоменклатуры.Период, ДЕКАДА, Сертификаты.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА Сертификаты.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПродажиСерийНоменклатуры.Период, МЕСЯЦ, Сертификаты.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА Сертификаты.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПродажиСерийНоменклатуры.Период, КВАРТАЛ, Сертификаты.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА Сертификаты.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПродажиСерийНоменклатуры.Период, ПОЛУГОДИЕ, Сертификаты.КоличествоПериодовДействия), ДЕНЬ)
	|					КОГДА Сертификаты.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
	|						ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПродажиСерийНоменклатуры.Период, ГОД, Сертификаты.КоличествоПериодовДействия), ДЕНЬ)
	|					ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|				КОНЕЦ
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаОкончания
	|ИЗ
	|	Сертификаты КАК Сертификаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПодарочныеСертификаты.Остатки(, ) КАК ПодарочныеСертификатыОстатки
	|		ПО Сертификаты.ПодарочныйСертификат = ПодарочныеСертификатыОстатки.ПодарочныйСертификат
	|			И Сертификаты.НомерСертификата = ПодарочныеСертификатыОстатки.НомерСертификата
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиСерийНоменклатуры КАК ПродажиСерийНоменклатуры
	|		ПО Сертификаты.НомерСертификата = ПродажиСерийНоменклатуры.Серия");
	Запрос.УстановитьПараметр("ТаблицаСертификатов", ТаблицаСертификатов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Проверяет позволяет ли область действия сертификатов оплатить все товары документа
// Параметры:
//  СтруктураДляПроверки - Структура - содержит две таблицы значений:
//   * Запасы - ТаблицаЗначений - Таблица товаров с колонками:
//    * Номенклатура - СправочникСсылка.Номенклатура
//    * Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры
//    * Сумма - Число
//   * Сертификаты - ТаблицаЗначений - Таблица сертификатов с колонками:
//    * ПодарочныйСертификат - СправочникСсылка.Номенклатура
//    * Сумма - Число
//  Отказ - Булево
Процедура ПроверитьОбластьДействияСертификатов(СтруктураДляПроверки, Отказ) Экспорт
	
	// Если не было оплаты сертификатами
	Если СтруктураДляПроверки.Сертификаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВремяНачала = ОценкаПроизводительности.НачатьЗамерВремени();
	
	СтруктураДляПроверки.Сертификаты.Свернуть("ПодарочныйСертификат", "Сумма");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаОграниченийПодарочногоСертификата();
	Запрос.УстановитьПараметр("Товары", СтруктураДляПроверки.Запасы);
	
	Для Каждого СтрокаСертификата Из СтруктураДляПроверки.Сертификаты Цикл
		
		// Если у сертификата нет ограничений, он не нуждается в проверке
		Если СтрокаСертификата.ПодарочныйСертификат.НоменклатураГруппыЦеновыеГруппы.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаСертификата.ПодарочныйСертификат.СпособОграниченияСертификата = Перечисления.СпособыОграниченияПодарочныхСертификатов.НеОграничен Тогда
			Продолжить;
		КонецЕсли;
		
		УстановитьПараметрыЗапросаОграниченийПодарочногоСертификата(Запрос, СтрокаСертификата.ПодарочныйСертификат);
		
		СуммаВозможнойОплаты = Запрос.Выполнить().Выгрузить().Итог("Сумма");
		
		Если СуммаВозможнойОплаты < СтрокаСертификата.Сумма Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru='Сертификатом вида """ + СтрокаСертификата.ПодарочныйСертификат + """ можно оплатить не более "
				+ СуммаВозможнойОплаты + " " + УправлениеНебольшойФирмойПовтИсп.ПолучитьНациональнуюВалюту() + ".'");
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("ПроверкаОбластиДействияСертификатов", ВремяНачала);
	
КонецПроцедуры

Процедура УдалитьСертификатыИзТаблицы(ТаблицаЗначений, ИмяКолонки) Экспорт
	
	ТипПодарочныйСертификат = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат;
	
	Для Индекс = 1 - ТаблицаЗначений.Количество() По 0 Цикл
		СтрокаТаблицы = ТаблицаЗначений.Получить(-Индекс);
		Если СтрокаТаблицы[ИмяКолонки].ТипНоменклатуры = ТипПодарочныйСертификат Тогда
			ТаблицаЗначений.Удалить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьСлужебногоКонтрагента() Экспорт
	
	Контрагент = Константы.КонтрагентДляПодарочныхСертификатов.Получить();
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	НовыйЭлемент = Справочники.Контрагенты.СоздатьЭлемент();
	НовыйЭлемент.Заполнить(Неопределено);
	
	НовыйЭлемент.Наименование = "Служебный контрагент для подарочных сертификатов";
	НовыйЭлемент.НаименованиеПолное = "Служебный контрагент для подарочных сертификатов";
	
	НовыйЭлемент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
	
	НовыйЭлемент.СчетУчетаРасчетовСПокупателем = ПланыСчетов.Управленческий.РасчетыСПокупателями;
	НовыйЭлемент.СчетУчетаАвансовПокупателя = ПланыСчетов.Управленческий.РасчетыПоАвансамПолученным;
	НовыйЭлемент.СчетУчетаРасчетовСПоставщиком = ПланыСчетов.Управленческий.РасчетыСПоставщиками;
	НовыйЭлемент.СчетУчетаАвансовПоставщику = ПланыСчетов.Управленческий.РасчетыПоАвансамВыданным;
	НовыйЭлемент.ВестиРасчетыПоДоговорам = Истина;
	НовыйЭлемент.ВестиРасчетыПоДокументам = Ложь;
	НовыйЭлемент.ВестиРасчетыПоЗаказам = Ложь;
	НовыйЭлемент.ВестиУчетОплатыПоСчетам = Ложь;
	
	НовыйЭлемент.Записать();
	
	Константы.КонтрагентДляПодарочныхСертификатов.Установить(НовыйЭлемент.Ссылка);
	
КонецПроцедуры

Процедура ПроверитьЗаполнитьБезналичнуюОплатуДокумента(Документ) Экспорт
	
	ЕстьТерминал =  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Документ, "ЭквайринговыйТерминал");
	
	Для Каждого СтрокаОплаты Из Документ.БезналичнаяОплата Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаОплаты.ВидОплаты) Тогда
			СтрокаОплаты.ВидОплаты = Перечисления.ВидыБезналичныхОплат.БанковскаяКарта;
			Если Не ЗначениеЗаполнено(СтрокаОплаты.ЭквайринговыйТерминал) И ЕстьТерминал Тогда
				СтрокаОплаты.ЭквайринговыйТерминал = Документ.ЭквайринговыйТерминал;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет указан ли в документе ордерный склад, и если да, присутствуют ли
// в ТЧ подарочные сертификаты
// Параметры:
//  Отказ - Булево - переменная из процедуры проверки заполнения
//  Объект - ДокументОбъект - проверяемый документ
//  ИмяТаблицы - Строка - имя табличной части для поиска сертификатов
//  ИмяСклада - Строка - имя реквизита склада для проверки
//  СкладВШапке - Булево - положение склада в документе
Процедура ПроверитьВозможностьИспользованияСертификатов(Отказ, Объект, ИмяТаблицы, ИмяСклада, СкладВШапке) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПодарочныеСертификаты") Тогда
		Возврат;
	КонецЕсли;
	
	Если СкладВШапке Тогда
		Если Не Объект[ИмяСклада].ОрдерныйСклад Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ТипСертификат = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПодарочныйСертификат");
	Для Каждого СтрокаТаблицы Из Объект[ИмяТаблицы] Цикл
		Если (СтрокаТаблицы.Номенклатура.ТипНоменклатуры = ТипСертификат) Тогда
			
			Если СкладВШапке Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр(
					"ru = 'Нельзя перемещать, либо приходовать подарочные сертификаты на ордерные склады.'");
				Сообщение.Сообщить();
				
				Отказ = Истина;
				
				Прервать;
				
			ИначеЕсли СтрокаТаблицы[ИмяСклада].ОрдерныйСклад Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр(
					"ru = 'Нельзя перемещать, либо приходовать подарочные сертификаты на ордерные склады.'");
				Сообщение.Сообщить();
				
				Отказ = Истина;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьСертификаты(ТабличнаяЧасть) Экспорт
	
	Результат = Ложь;
	
	Если ТабличнаяЧасть.Колонки.Найти("ОплатаСертификатом") <> Неопределено Тогда // Предоплата
		
		Для Каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл
			Если СтрокаТаблицы.ОплатаСертификатом Тогда
				
				Результат = Истина;
				Прервать;
				
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТабличнаяЧасть.Колонки.Найти("ВидОплаты") <> Неопределено Тогда // БезналичнаяОплата
		
		ВидСертификат = ПредопределенноеЗначение("Перечисление.ВидыБезналичныхОплат.ПодарочныйСертификат");
		
		Для Каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл
			
			Если СтрокаТаблицы.ВидОплаты = ВидСертификат Тогда
				
				Результат = Истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ТабличнаяЧасть.Колонки.Найти("Номенклатура") <> Неопределено Тогда // Запасы
		
		ТипСертификат = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПодарочныйСертификат");
		
		Для Каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл
			Если СтрокаТаблицы.Номенклатура.ТипНоменклатуры = ТипСертификат Тогда
				
				Результат = Истина;
				Прервать;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьСписокНомеровСертификатов(Текст, Владелец) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СерииНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.Владелец = &Владелец
	|	И СерииНоменклатуры.Наименование ПОДОБНО &Текст
	|	И СерииНоменклатуры.Продан");
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Текст", "%"+Текст+"%");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Список = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		
		Список.Добавить(Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

Функция УказанКонтрагентДляПредоплаты() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = ЗначениеЗаполнено(Константы.КонтрагентДляПодарочныхСертификатов.Получить());
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Процедура ВыполнитьПроверкуОграниченийСертификатовВРМК(СтруктураЧека, Отказ) Экспорт
	
	// Проверка срока действия
	ПроверитьСрокДействия(СтруктураЧека, "БезналичнаяОплата", Отказ);
	
	// Проверка области действия
	СтруктураДляПроверки = Новый Структура;
	СтруктураДляПроверки.Вставить("Запасы", СтруктураЧека.Запасы.Выгрузить(,"Номенклатура, Характеристика, Сумма"));
	СтруктураДляПроверки.Вставить("Сертификаты", СтруктураЧека.БезналичнаяОплата.Выгрузить(
		Новый Структура("ВидОплаты", Перечисления.ВидыБезналичныхОплат.ПодарочныйСертификат),
		"ПодарочныйСертификат, Сумма"));
	ПроверитьОбластьДействияСертификатов(СтруктураДляПроверки, Отказ);
	
КонецПроцедуры

Функция СформироватьТекстЗапросаПоОплатеПодарочнымиСертификатами(ЭтоОпт = Ложь, ЭтоВозврат = Ложь, ЭтоОтчет = Ложь) Экспорт
	
	Если ЭтоОпт Тогда
	
		Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Период КАК Период,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаДокумента.Документ КАК ПодарочныйСертификат,
		|	ТаблицаДокумента.НомерСертификата КАК НомерСертификата,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.СуммаСертификата * &ЭтоВозврат КАК Сумма
		|ИЗ
		|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.ОплатаСертификатом";
		
	Иначе
		
		Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаДокумента.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	ТаблицаДокумента.НомерСертификата КАК НомерСертификата,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.СуммаСертификата * &ЭтоВозврат КАК Сумма
		|ИЗ
		|	ВременнаяТаблицаОплатаПлатежнымиКартами КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыБезналичныхОплат.ПодарочныйСертификат)";
		
		Если ЭтоОтчет Тогда
			Текст = Текст + "
			|И &ПолноеПроведение";
		Иначе
			Текст = Текст + "
			|И &ЧекПробит
			|И Не &Архивный";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоВозврат Тогда
		Текст = СтрЗаменить(Текст, "&ЭтоВозврат", "-1");
	Иначе
		Текст = СтрЗаменить(Текст, "&ЭтоВозврат", "1");
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция ПолучитьПредставлениеПодарочногоСертификатаКакПлатежногоДокумента(СертификатСсылка, ОплачиваемыйДокументСсылка, НомерСертификата) Экспорт
	
	Возврат Новый Структура("Дата, Номер", "", ""+НомерСертификата);
	
КонецФункции

Процедура ДобавитьВнереализационнуюПрибыль(ДокументОбъект, ОбщиеПараметры) Экспорт
	
	Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "БезналичнаяОплата") Тогда
		Запрос.Текст = ТекстЗапросаПоВнереализационнойПрибылиДляФискализацииРозница();
		Запрос.УстановитьПараметр("БезналичнаяОплата", ДокументОбъект.БезналичнаяОплата.Выгрузить());
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "Предоплата") Тогда
		Запрос.Текст = ТекстЗапросаПоВнереализационнойПрибылиДляФискализацииОпт();
		Запрос.УстановитьПараметр("Предоплата", ДокументОбъект.Предоплата.Выгрузить());
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат
	КонецЕсли;
	
	ТаблицаЗапроса = Результат.Выгрузить();
	ПотериПокупателя = ТаблицаЗапроса.Итог("Разница");
	
	Если ПотериПокупателя > 0 Тогда
		
		СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека();
		СтрокаПозицииЧека.Количество = 1;
		СтрокаПозицииЧека.Наименование = "8";
		Если ОбщиеПараметры.ПозицииЧека.Количество() > 0 Тогда
			ПоследняяПозиция = ОбщиеПараметры.ПозицииЧека[ОбщиеПараметры.ПозицииЧека.Количество() - 1];
			СтрокаПозицииЧека.НомерСекции = ПоследняяПозиция.НомерСекции;
		Иначе
			СтрокаПозицииЧека.НомерСекции = 1;
		КонецЕсли; 
		
		СтрокаПозицииЧека.НомерСтрокиТовара      = ОбщиеПараметры.ПозицииЧека.Количество();
		СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ВнереализационныйДоход;
		СтрокаПозицииЧека.ПризнакСпособаРасчета  = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
		СтрокаПозицииЧека.СтавкаНДС              = Неопределено;
		СтрокаПозицииЧека.Сумма                  = ПотериПокупателя;
		СтрокаПозицииЧека.Цена                   = ПотериПокупателя;
		СтрокаПозицииЧека.ЦенаСоСкидками         = ПотериПокупателя;
		
		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
		
		СтрокаТаблицыОплат = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
		СтрокаТаблицыОплат.Сумма     = ПотериПокупателя;
		СтрокаТаблицыОплат.ТипОплаты = Перечисления.ТипыОплатыККТ.Предоплата;
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаТаблицыОплат);
		
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает текст запроса по ограничениям подарочного сертификата
// 
// Возвращаемое значение:
//  ТекстЗапроса - Текст - Текст запроса.
//
Функция ТекстЗапросаОграниченийПодарочногоСертификата() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Сумма КАК Сумма
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураНоменклатураГруппыЦеновыеГруппы.ЗначениеУточнения КАК ГруппаНоменклатуры
	|ПОМЕСТИТЬ ОграниченияГруппыНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура.НоменклатураГруппыЦеновыеГруппы КАК НоменклатураНоменклатураГруппыЦеновыеГруппы
	|ГДЕ
	|	НоменклатураНоменклатураГруппыЦеновыеГруппы.Ссылка = &ПодарочныйСертификат
	|	И НоменклатураНоменклатураГруппыЦеновыеГруппы.ЗначениеУточнения.ЭтоГруппа
	|	И &ОграничениеПоНоменклатуре
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураНоменклатураГруппыЦеновыеГруппы.ЗначениеУточнения КАК Номенклатура
	|ПОМЕСТИТЬ ОграниченияНоменклатура
	|ИЗ
	|	Справочник.Номенклатура.НоменклатураГруппыЦеновыеГруппы КАК НоменклатураНоменклатураГруппыЦеновыеГруппы
	|ГДЕ
	|	НоменклатураНоменклатураГруппыЦеновыеГруппы.Ссылка = &ПодарочныйСертификат
	|	И НЕ НоменклатураНоменклатураГруппыЦеновыеГруппы.ЗначениеУточнения.ЭтоГруппа
	|	И &ОграничениеПоНоменклатуре
	|	И НоменклатураНоменклатураГруппыЦеновыеГруппы.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураНоменклатураГруппыЦеновыеГруппы.ЗначениеУточнения КАК Номенклатура,
	|	НоменклатураНоменклатураГруппыЦеновыеГруппы.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ОграниченияНоменклатураХарактеристика
	|ИЗ
	|	Справочник.Номенклатура.НоменклатураГруппыЦеновыеГруппы КАК НоменклатураНоменклатураГруппыЦеновыеГруппы
	|ГДЕ
	|	НоменклатураНоменклатураГруппыЦеновыеГруппы.Ссылка = &ПодарочныйСертификат
	|	И НЕ НоменклатураНоменклатураГруппыЦеновыеГруппы.ЗначениеУточнения.ЭтоГруппа
	|	И &ОграничениеПоНоменклатуре
	|	И НЕ НоменклатураНоменклатураГруппыЦеновыеГруппы.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураНоменклатураГруппыЦеновыеГруппы.ЗначениеУточнения КАК ГруппаКатегорий
	|ПОМЕСТИТЬ ОграниченияГруппыКатегорий
	|ИЗ
	|	Справочник.Номенклатура.НоменклатураГруппыЦеновыеГруппы КАК НоменклатураНоменклатураГруппыЦеновыеГруппы
	|ГДЕ
	|	НоменклатураНоменклатураГруппыЦеновыеГруппы.Ссылка = &ПодарочныйСертификат
	|	И НоменклатураНоменклатураГруппыЦеновыеГруппы.ЗначениеУточнения.ЭтоГруппа
	|	И &ОграничениеПоКатегориям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураНоменклатураГруппыЦеновыеГруппы.ЗначениеУточнения КАК Категория
	|ПОМЕСТИТЬ ОграниченияКатегорий
	|ИЗ
	|	Справочник.Номенклатура.НоменклатураГруппыЦеновыеГруппы КАК НоменклатураНоменклатураГруппыЦеновыеГруппы
	|ГДЕ
	|	НоменклатураНоменклатураГруппыЦеновыеГруппы.Ссылка = &ПодарочныйСертификат
	|	И НЕ НоменклатураНоменклатураГруппыЦеновыеГруппы.ЗначениеУточнения.ЭтоГруппа
	|	И &ОграничениеПоКатегориям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураНоменклатураГруппыЦеновыеГруппы.ЗначениеУточнения КАК ГруппаНоменклатуры
	|ПОМЕСТИТЬ ОграниченияЦеновыхГрупп
	|ИЗ
	|	Справочник.Номенклатура.НоменклатураГруппыЦеновыеГруппы КАК НоменклатураНоменклатураГруппыЦеновыеГруппы
	|ГДЕ
	|	НоменклатураНоменклатураГруппыЦеновыеГруппы.Ссылка = &ПодарочныйСертификат
	|	И &ОграничениеПоЦеновымГруппам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Товары.Сумма) КАК Сумма
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	&ОграничениеПоНоменклатуре
	|	И &ВключатьОграничение
	|	И (Товары.Номенклатура В ИЕРАРХИИ
	|				(ВЫБРАТЬ
	|					ОграниченияГруппыНоменклатуры.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	|				ИЗ
	|					ОграниченияГруппыНоменклатуры КАК ОграниченияГруппыНоменклатуры)
	|			ИЛИ Товары.Номенклатура В
	|				(ВЫБРАТЬ
	|					ОграниченияНоменклатура.Номенклатура КАК Номенклатура
	|				ИЗ
	|					ОграниченияНоменклатура КАК ОграниченияНоменклатура)
	|			ИЛИ (Товары.Номенклатура, Товары.Характеристика) В
	|				(ВЫБРАТЬ
	|					ОграниченияНоменклатураХарактеристика.Номенклатура КАК Номенклатура,
	|					ОграниченияНоменклатураХарактеристика.Характеристика КАК Характеристика
	|				ИЗ
	|					ОграниченияНоменклатураХарактеристика КАК ОграниченияНоменклатураХарактеристика))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(Товары.Сумма)
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Товары.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	(СпрНоменклатура.КатегорияНоменклатуры В ИЕРАРХИИ
	|				(ВЫБРАТЬ
	|					ОграниченияГруппыКатегорий.ГруппаКатегорий КАК ГруппаКатегорий
	|				ИЗ
	|					ОграниченияГруппыКатегорий КАК ОграниченияГруппыКатегорий)
	|			ИЛИ СпрНоменклатура.КатегорияНоменклатуры В
	|				(ВЫБРАТЬ
	|					ОграниченияКатегорий.Категория КАК Категория
	|				ИЗ
	|					ОграниченияКатегорий КАК ОграниченияКатегорий))
	|	И &ОграничениеПоКатегориям
	|	И &ВключатьОграничение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(Товары.Сумма)
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Товары.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	СпрНоменклатура.ЦеноваяГруппа В
	|			(ВЫБРАТЬ
	|				ОграниченияЦеновыхГрупп.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	|			ИЗ
	|				ОграниченияЦеновыхГрупп КАК ОграниченияЦеновыхГрупп)
	|	И &ОграничениеПоЦеновымГруппам
	|	И &ВключатьОграничение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(Товары.Сумма)
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	НЕ Товары.Номенклатура В ИЕРАРХИИ
	|				(ВЫБРАТЬ
	|					ОграниченияГруппыНоменклатуры.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	|				ИЗ
	|					ОграниченияГруппыНоменклатуры КАК ОграниченияГруппыНоменклатуры)
	|	И НЕ Товары.Номенклатура В
	|				(ВЫБРАТЬ
	|					ОграниченияНоменклатура.Номенклатура КАК Номенклатура
	|				ИЗ
	|					ОграниченияНоменклатура КАК ОграниченияНоменклатура)
	|	И НЕ (Товары.Номенклатура, Товары.Характеристика) В
	|				(ВЫБРАТЬ
	|					ОграниченияНоменклатураХарактеристика.Номенклатура КАК Номенклатура,
	|					ОграниченияНоменклатураХарактеристика.Характеристика КАК Характеристика
	|				ИЗ
	|					ОграниченияНоменклатураХарактеристика КАК ОграниченияНоменклатураХарактеристика)
	|	И &ОграничениеПоНоменклатуре
	|	И &ИсключатьОграничение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(Товары.Сумма)
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Товары.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	НЕ СпрНоменклатура.КатегорияНоменклатуры В ИЕРАРХИИ
	|				(ВЫБРАТЬ
	|					ОграниченияГруппыКатегорий.ГруппаКатегорий КАК ГруппаКатегорий
	|				ИЗ
	|					ОграниченияГруппыКатегорий КАК ОграниченияГруппыКатегорий)
	|	И НЕ СпрНоменклатура.КатегорияНоменклатуры В
	|				(ВЫБРАТЬ
	|					ОграниченияКатегорий.Категория КАК Категория
	|				ИЗ
	|					ОграниченияКатегорий КАК ОграниченияКатегорий)
	|	И &ОграничениеПоКатегориям
	|	И &ИсключатьОграничение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(Товары.Сумма)
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Товары.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	НЕ СпрНоменклатура.ЦеноваяГруппа В
	|				(ВЫБРАТЬ
	|					ОграниченияЦеновыхГрупп.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	|				ИЗ
	|					ОграниченияЦеновыхГрупп КАК ОграниченияЦеновыхГрупп)
	|	И &ОграничениеПоЦеновымГруппам
	|	И &ИсключатьОграничение";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Процедура - Установить параметры запроса ограничений подарочного сертификата
//
// Параметры:
//  Запрос				 - 	Запрос - Запрос по ограничению подарочного сертификата.
//  ПодарочныйСертификат - 	СправочникСсылка.Номенклатура - Подарочный сертификат.
//
Процедура УстановитьПараметрыЗапросаОграниченийПодарочногоСертификата(Запрос, Знач ПодарочныйСертификат) Экспорт
	
	Запрос.УстановитьПараметр("ПодарочныйСертификат", ПодарочныйСертификат);
	Запрос.УстановитьПараметр("ОграничениеПоНоменклатуре",
		ПодарочныйСертификат.ВариантОграниченияСертификата = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоНоменклатуре);
	Запрос.УстановитьПараметр("ОграничениеПоКатегориям",
		ПодарочныйСертификат.ВариантОграниченияСертификата = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоКатегориям);
	Запрос.УстановитьПараметр("ОграничениеПоЦеновымГруппам",
		ПодарочныйСертификат.ВариантОграниченияСертификата = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоЦеновымГруппам);
	Запрос.УстановитьПараметр("ВключатьОграничение",
		ПодарочныйСертификат.СпособОграниченияСертификата = Перечисления.СпособыОграниченияПодарочныхСертификатов.ЗапрещеныКроме);
	Запрос.УстановитьПараметр("ИсключатьОграничение",
		ПодарочныйСертификат.СпособОграниченияСертификата = Перечисления.СпособыОграниченияПодарочныхСертификатов.РазрешеныКроме);
	Запрос.УстановитьПараметр("НеОграничивать",
		ПодарочныйСертификат.СпособОграниченияСертификата = Перечисления.СпособыОграниченияПодарочныхСертификатов.НеОграничен);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПоВнереализационнойПрибылиДляФискализацииРозница()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	БезналичнаяОплата.ВидОплаты КАК ВидОплаты,
	|	БезналичнаяОплата.Сумма КАК Сумма,
	|	БезналичнаяОплата.СуммаПогашенияСертификата КАК СуммаПогашенияСертификата
	|ПОМЕСТИТЬ ТаблицаОплаты
	|ИЗ
	|	&БезналичнаяОплата КАК БезналичнаяОплата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОплаты.СуммаПогашенияСертификата - ТаблицаОплаты.Сумма КАК Разница
	|ИЗ
	|	ТаблицаОплаты КАК ТаблицаОплаты
	|ГДЕ
	|	ТаблицаОплаты.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыБезналичныхОплат.ПодарочныйСертификат)";
	
	Возврат ТекстЗапроса
	
КонецФункции

Функция ТекстЗапросаПоВнереализационнойПрибылиДляФискализацииОпт()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Предоплата.ОплатаСертификатом КАК ОплатаСертификатом,
	|	Предоплата.СуммаПогашенияСертификата КАК СуммаПогашенияСертификата,
	|	Предоплата.СуммаРасчетов КАК СуммаРасчетов
	|ПОМЕСТИТЬ ТаблицаОплаты
	|ИЗ
	|	&Предоплата КАК Предоплата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОплаты.СуммаПогашенияСертификата - ТаблицаОплаты.СуммаРасчетов КАК Разница
	|ИЗ
	|	ТаблицаОплаты КАК ТаблицаОплаты
	|ГДЕ
	|	ТаблицаОплаты.ОплатаСертификатом";
	
	Возврат ТекстЗапроса
	
КонецФункции


Функция ТекстЗапросаФормированияВременныхТаблицДляПроведения(ИмяТаблицыОплатыСертификатом = Неопределено, ВыполнятьПродажу = Истина, ИмяТаблицыПродажиСертификатов = Неопределено) Экспорт
	
	ТекстЗапросаПустойТаблицы = 
	"Выбрать
	|	Неопределено КАК Ссылка,
	|	0 КАК НомерСтроки,
	|	ДатаВремя(1, 1, 1) КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК Операция,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК ПодарочныйСертификат,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК НомерСертификата,
	|	Значение(Справочник.Организации.ПустаяСсылка) КАК Организация,
	|	Значение(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
	|	Значение(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК Договор,
	|	Значение(Документ.ЗаказПокупателя.ПустаяСсылка) КАК Заказ,
	|	Значение(Справочник.Контрагенты.ПустаяСсылка) КАК ДержательСертификата,
	|	Значение(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК ДоговорДержателяСертификата,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Справочник.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация,
	|	Значение(ПланСчетов.Управленческий.ПустаяСсылка) Как СчетУчетаДенежныхСредств,
	|	Значение(ПланСчетов.Управленческий.ПустаяСсылка) Как СчетУчетаАвансовПокупателя,
	|	Значение(Справочник.Валюты.ПустаяСсылка) Как ВалютаДокумента,
	|	0 КАК СуммаДвиженияПоНоминалу,
	|	0 КАК СуммаВалДвиженияПоНоминалу,
	|	0 КАК СуммаДвиженияПоРасчетам,
	|	0 КАК СуммаВалДвиженияПоРасчетам,
	|	0 СуммаДоходаОтРазницыСНоминалом,
	|	0 СуммаРасходаОтРазницыСНоминалом,
	|	0 СуммаВалДоходаОтРазницыСНоминалом,
	|	0 СуммаВалРасходаОтРазницыСНоминалом
	|	
	|Поместить ВременнаяТаблицаДвиженийСертификатов
	|Где
	|	Ложь";		 
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодарочныеСертификаты") Тогда	
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	КонтрагентДляСертификатов.Значение КАК Контрагент,
		|	ДоговорДержателя.Ссылка КАК Договор
		|ПОМЕСТИТЬ вт_ДанныеДержателяАванса
		|ИЗ
		|	Константа.КонтрагентДляПодарочныхСертификатов КАК КонтрагентДляСертификатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеДоговорыКонтрагента КАК ОсновныеДоговорыКонтрагента
		|		ПО (ОсновныеДоговорыКонтрагента.Контрагент = КонтрагентДляСертификатов.Значение)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорДержателя
		|		ПО (ОсновныеДоговорыКонтрагента.Договор = ДоговорДержателя.Ссылка)
		|ГДЕ
		|	НЕ ДоговорДержателя.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтрагентДляСертификатов.Значение" + ОбщегоНазначения.РазделительПакетаЗапросов();
		Если ВыполнятьПродажу Тогда
			ТекстЗапроса = ТекстЗапроса +	
			"ВЫБРАТЬ
			|	ПродажаСертификата.Ссылка КАК Ссылка,
			|	ПродажаСертификата.НомерСтроки КАК НомерСтроки,
			|	ПродажаСертификата.Период КАК Период,
			|	ПродажаСертификата.ВидДвижения КАК ВидДвижения,
			|	ПродажаСертификата.Операция КАК Операция,
			|	ПродажаСертификата.ПодарочныйСертификат КАК ПодарочныйСертификат,
			|	ПродажаСертификата.НомерСертификата КАК НомерСертификата,
			|	ПродажаСертификата.Организация КАК Организация,
			|	ПродажаСертификата.ДержательСертификата КАК ДержательСертификата,
			|	ПродажаСертификата.ДоговорДержателяСертификата КАК ДоговорДержателяСертификата,
			|	ПродажаСертификата.Контрагент КАК Контрагент,
			|	ПродажаСертификата.Договор КАК Договор,
			|	ПродажаСертификата.Заказ КАК Заказ,
			|	ПродажаСертификата.НаправлениеДеятельности КАК НаправлениеДеятельности,
			|	ПродажаСертификата.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
			|	ПродажаСертификата.СчетУчетаДенежныхСредств КАК СчетУчетаДенежныхСредств,
			|	ПродажаСертификата.СчетУчетаАвансовПокупателя КАК СчетУчетаАвансовПокупателя,
			|	ПродажаСертификата.ВалютаДокумента КАК ВалютаДокумента,
			|	ПродажаСертификата.СуммаДвиженияПоНоминалу КАК СуммаДвиженияПоНоминалу,
			|	ПродажаСертификата.СуммаВалДвиженияПоНоминалу КАК СуммаВалДвиженияПоНоминалу,
			|	ПродажаСертификата.СуммаДвиженияПоРасчетам КАК СуммаДвиженияПоРасчетам,
			|	ПродажаСертификата.СуммаВалДвиженияПоРасчетам КАК СуммаВалДвиженияПоРасчетам,
			|	ВЫБОР
			|		КОГДА ПродажаСертификата.СуммаДвиженияПоРасчетам > ПродажаСертификата.СуммаДвиженияПоНоминалу
			|			ТОГДА ПродажаСертификата.СуммаДвиженияПоРасчетам - ПродажаСертификата.СуммаДвиженияПоНоминалу
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СуммаДоходаОтРазницыСНоминалом,
			|	ВЫБОР
			|		КОГДА ПродажаСертификата.СуммаДвиженияПоНоминалу > ПродажаСертификата.СуммаДвиженияПоРасчетам
			|			ТОГДА ПродажаСертификата.СуммаДвиженияПоНоминалу - ПродажаСертификата.СуммаДвиженияПоРасчетам
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СуммаРасходаОтРазницыСНоминалом,
			|	ВЫБОР
			|		КОГДА ПродажаСертификата.СуммаВалДвиженияПоРасчетам > ПродажаСертификата.СуммаВалДвиженияПоНоминалу
			|			ТОГДА ПродажаСертификата.СуммаВалДвиженияПоРасчетам - ПродажаСертификата.СуммаВалДвиженияПоНоминалу
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СуммаВалДоходаОтРазницыСНоминалом,
			|	ВЫБОР
			|		КОГДА ПродажаСертификата.СуммаВалДвиженияПоНоминалу > ПродажаСертификата.СуммаВалДвиженияПоРасчетам
			|			ТОГДА ПродажаСертификата.СуммаВалДвиженияПоНоминалу - ПродажаСертификата.СуммаВалДвиженияПоРасчетам
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СуммаВалРасходаОтРазницыСНоминалом
			|ПОМЕСТИТЬ вт_ПродажаСертификата
			|ИЗ
			|	(ВЫБРАТЬ
			|		ДокументДвижения.Ссылка КАК Ссылка,
			|		ВременнаяТаблицаЗапасы.НомерСтроки КАК НомерСтроки,
			|		ВременнаяТаблицаЗапасы.Дата КАК Период,
			|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
			|		ВЫБОР
			|			КОГДА ТИПЗНАЧЕНИЯ(ДокументДвижения.Ссылка) = ТИП(Документ.ПриходнаяНакладная)
			|					ИЛИ ТИПЗНАЧЕНИЯ(ДокументДвижения.Ссылка) = ТИП(Документ.ЧекККМВозврат)
			|				ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|			ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|		КОНЕЦ КАК Операция,
			|		ВременнаяТаблицаЗапасы.Номенклатура КАК ПодарочныйСертификат,
			|		ЕСТЬNULL(СерииНоменклатуры.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК НомерСертификата,
			|		ВременнаяТаблицаЗапасы.Организация КАК Организация,
			|		ДокументДвижения.Контрагент КАК Контрагент, 
			|		ДокументДвижения.Договор КАК Договор, 
			|		ВременнаяТаблицаЗапасы.Заказ КАК Заказ, 
			|		ДержательСертификата.Ссылка КАК ДержательСертификата,
			|		ЕСТЬNULL(ЗаписьОсновногоДоговора.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК ДоговорДержателяСертификата,
			|		ДокументДвижения.НаправлениеДеятельности КАК НаправлениеДеятельности,
			|		ЕстьNull(ВременнаяТаблицаЗапасы.ХозяйственнаяОперация, ДокументДвижения.ХозяйственнаяОперация) КАК ХозяйственнаяОперация,			
			|		ВременнаяТаблицаЗапасы.СчетУчетаДенежныхСредств КАК СчетУчетаДенежныхСредств,
			|		ДержательСертификата.СчетУчетаАвансовПокупателя КАК СчетУчетаАвансовПокупателя,
			|		ДокументДвижения.ВалютаДокумента КАК ВалютаДокумента,
			|		ВременнаяТаблицаЗапасы.НоминалСертификата КАК СуммаДвиженияПоНоминалу,
			|		ВременнаяТаблицаЗапасы.НоминалСертификатаВал КАК СуммаВалДвиженияПоНоминалу,
			|		ВременнаяТаблицаЗапасы.Сумма / ВЫБОР
			|					КОГДА ВременнаяТаблицаЗапасы.ИспользоватьСерииНоменклатуры
			|						ТОГДА ВременнаяТаблицаЗапасы.Количество
			|					ИНАЧЕ 1
			|				КОНЕЦ  КАК СуммаДвиженияПоРасчетам,
			|		ВременнаяТаблицаЗапасы.СуммаВал / ВЫБОР
			|					КОГДА ВременнаяТаблицаЗапасы.ИспользоватьСерииНоменклатуры
			|						ТОГДА ВременнаяТаблицаЗапасы.Количество
			|					ИНАЧЕ 1
			|				КОНЕЦ КАК СуммаВалДвиженияПоРасчетам
			|	ИЗ
			|		ВременнаяТаблицаЗапасы КАК ВременнаяТаблицаЗапасы
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСерииНоменклатуры КАК СерииНоменклатуры
			|			ПО ВременнаяТаблицаЗапасы.КлючСвязи = СерииНоменклатуры.КлючСвязи
			|				И (ВременнаяТаблицаЗапасы.ИспользоватьСерииНоменклатуры)
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ДокументДвижения
			|			ПО (ИСТИНА)
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.КонтрагентДляПодарочныхСертификатов КАК НастройкаКонтрагентПодарочныхСертификатов
			|			ПО (ИСТИНА)
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК ДержательСертификата
			|			ПО (НастройкаКонтрагентПодарочныхСертификатов.Значение = ДержательСертификата.Ссылка)
			|			Левое Соединение вт_ДанныеДержателяАванса как ЗаписьОсновногоДоговора
			|			ПО (ЗаписьОсновногоДоговора.Контрагент = ДержательСертификата.Ссылка)
			|	ГДЕ
			|		ВременнаяТаблицаЗапасы.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
			|		И НЕ ТИПЗНАЧЕНИЯ(ДокументДвижения.Ссылка) = ТИП(Документ.ОтчетОРозничныхПродажах)
			|		И ВременнаяТаблицаЗапасы.Количество > 0
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ДокументДвижения.Ссылка,
			|		ВременнаяТаблицаЗапасы.НомерСтроки,
			|		ВременнаяТаблицаЗапасы.Дата,
			|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
			|		ВЫБОР
			|			КОГДА ВременнаяТаблицаЗапасы.Сумма > 0
			|				ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|			ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|		КОНЕЦ,
			|		ВременнаяТаблицаЗапасы.Номенклатура,
			|		ЕСТЬNULL(СерииНоменклатуры.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)),
			|		ВременнаяТаблицаЗапасы.Организация,
			|		ДокументДвижения.Контрагент,
			|		ДокументДвижения.Договор,
			|		ВременнаяТаблицаЗапасы.Заказ,
			|		ДержательСертификата.Ссылка,
			|		ЕСТЬNULL(ЗаписьОсновногоДоговора.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)),
			|		ДокументДвижения.НаправлениеДеятельности,
			|		ЕстьNull(ВременнаяТаблицаЗапасы.ХозяйственнаяОперация, ДокументДвижения.ХозяйственнаяОперация),			
			|		ВременнаяТаблицаЗапасы.СчетУчетаДенежныхСредств,
			|		ДержательСертификата.СчетУчетаАвансовПокупателя,
			|		ДокументДвижения.ВалютаДокумента,
			|		ВЫБОР
			|			КОГДА ВременнаяТаблицаЗапасы.Сумма > 0
			|				ТОГДА ВременнаяТаблицаЗапасы.НоминалСертификата
			|			ИНАЧЕ -ВременнаяТаблицаЗапасы.НоминалСертификата
			|		КОНЕЦ,
			|		ВЫБОР
			|			КОГДА ВременнаяТаблицаЗапасы.Сумма > 0
			|				ТОГДА ВременнаяТаблицаЗапасы.НоминалСертификата
			|			ИНАЧЕ -ВременнаяТаблицаЗапасы.НоминалСертификата
			|		КОНЕЦ,
			|		ВЫБОР
			|			КОГДА ВременнаяТаблицаЗапасы.Сумма > 0
			|				ТОГДА ВременнаяТаблицаЗапасы.Сумма
			|			ИНАЧЕ -ВременнаяТаблицаЗапасы.Сумма
			|		КОНЕЦ / ВЫБОР
			|					КОГДА ВременнаяТаблицаЗапасы.ИспользоватьСерииНоменклатуры
			|						ТОГДА ВременнаяТаблицаЗапасы.Количество
			|					ИНАЧЕ 1
			|				КОНЕЦ,
			|		ВЫБОР
			|			КОГДА ВременнаяТаблицаЗапасы.Сумма > 0
			|				ТОГДА ВременнаяТаблицаЗапасы.Сумма
			|			ИНАЧЕ -ВременнаяТаблицаЗапасы.Сумма
			|		КОНЕЦ / ВЫБОР
			|					КОГДА ВременнаяТаблицаЗапасы.ИспользоватьСерииНоменклатуры
			|						ТОГДА ВременнаяТаблицаЗапасы.Количество
			|					ИНАЧЕ 1
			|				КОНЕЦ
			|	ИЗ
			|		ВременнаяТаблицаЗапасы КАК ВременнаяТаблицаЗапасы
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСерииНоменклатуры КАК СерииНоменклатуры
			|			ПО ВременнаяТаблицаЗапасы.КлючСвязи = СерииНоменклатуры.КлючСвязи
			|				И (ВременнаяТаблицаЗапасы.ИспользоватьСерииНоменклатуры)
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ДокументДвижения
			|			ПО (ИСТИНА)
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.КонтрагентДляПодарочныхСертификатов КАК НастройкаКонтрагентПодарочныхСертификатов
			|			ПО (ИСТИНА)
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК ДержательСертификата
			|			ПО (НастройкаКонтрагентПодарочныхСертификатов.Значение = ДержательСертификата.Ссылка)
			|			Левое Соединение вт_ДанныеДержателяАванса как ЗаписьОсновногоДоговора
			|			ПО (ЗаписьОсновногоДоговора.Контрагент = ДержательСертификата.Ссылка)
			|	ГДЕ
			|		ТИПЗНАЧЕНИЯ(ДокументДвижения.Ссылка) = ТИП(Документ.ОтчетОРозничныхПродажах)
			|		И ВременнаяТаблицаЗапасы.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
			|	) КАК ПродажаСертификата" +  ОбщегоНазначения.РазделительПакетаЗапросов(); 
		Иначе
			ТекстЗапроса = ТекстЗапроса + СтрЗаменить(ТекстЗапросаПустойТаблицы, 
				"Поместить ВременнаяТаблицаДвиженийСертификатов",
				"Поместить вт_ПродажаСертификата") + ОбщегоНазначения.РазделительПакетаЗапросов(); 
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	ОстатокБезДвиженийДокумента.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	ОстатокБезДвиженийДокумента.НомерСертификата КАК НомерСертификата,
		|	СУММА(ОстатокБезДвиженийДокумента.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(ОстатокБезДвиженийДокумента.СуммаОстаток) КАК СуммаВалОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиСертификатов
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПодарочныеСертификатыОстатки.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|		ПодарочныеСертификатыОстатки.НомерСертификата КАК НомерСертификата,
		|		НЕОПРЕДЕЛЕНО КАК Регистратор,
		|		ПодарочныеСертификатыОстатки.СуммаОстаток КАК СуммаОстаток
		|	ИЗ
		|		РегистрНакопления.ПодарочныеСертификаты.Остатки(
		|				,
		|				(ПодарочныйСертификат, НомерСертификата) В
		|					(ВЫБРАТЬ
		|						ВременнаяТаблицаОплатаПлатежнымиКартами.ПодарочныйСертификат,
		|						ВременнаяТаблицаОплатаПлатежнымиКартами.НомерСертификата
		|					ИЗ
		|						ВременнаяТаблицаОплатаПлатежнымиКартами КАК ВременнаяТаблицаОплатаПлатежнымиКартами
		|				
		|					ОБЪЕДИНИТЬ ВСЕ
		|				
		|					ВЫБРАТЬ
		|						ПродажаСертификата.ПодарочныйСертификат,
		|						ПродажаСертификата.НомерСертификата
		|					ИЗ
		|						вт_ПродажаСертификата КАК ПродажаСертификата)) КАК ПодарочныеСертификатыОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЕСТЬNULL(ОплатаСертификатами.ПодарочныйСертификат, ПодарочныеСертификаты.ПодарочныйСертификат),
		|		ЕСТЬNULL(ОплатаСертификатами.НомерСертификата, ПодарочныеСертификаты.НомерСертификата),
		|		ЕСТЬNULL(ОплатаСертификатами.Ссылка, ПодарочныеСертификаты.Регистратор),
		|		ВЫБОР
		|			КОГДА ОРП.СтатусКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыОтчетаОРозничныхПродажах.ЗакрытаЧекиЗаархивированы)
		|					И ПодарочныеСертификаты.Сумма ЕСТЬ NULL
		|				ТОГДА ВЫБОР
		|						КОГДА ПараметрыСертификата.ЧастичноеПогашение
		|								ИЛИ ПараметрыСертификата.ПроизвольныйНоминал
		|							ТОГДА ОплатаСертификатами.Сумма
		|						ИНАЧЕ ПараметрыСертификата.Номинал
		|					КОНЕЦ
		|			ИНАЧЕ ЕСТЬNULL(ПодарочныеСертификаты.Сумма, 0)
		|		КОНЕЦ
		|	ИЗ
		|		Документ.ОтчетОРозничныхПродажах.БезналичнаяОплата КАК ОплатаСертификатами
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОРП
		|			ПО ОплатаСертификатами.Ссылка = ОРП.Ссылка
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ПараметрыСертификата
		|			ПО ОплатаСертификатами.ПодарочныйСертификат = ПараметрыСертификата.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ПодарочныеСертификаты.Регистратор КАК Регистратор,
		|				ПодарочныеСертификаты.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|				ПодарочныеСертификаты.НомерСертификата КАК НомерСертификата,
		|				ПодарочныеСертификаты.Сумма КАК Сумма
		|			ИЗ
		|				РегистрНакопления.ПодарочныеСертификаты КАК ПодарочныеСертификаты
		|			ГДЕ
		|				ПодарочныеСертификаты.Регистратор = &Ссылка
		|				И ПодарочныеСертификаты.Регистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|				И ПодарочныеСертификаты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)) КАК ПодарочныеСертификаты
		|			ПО ОплатаСертификатами.Ссылка = ПодарочныеСертификаты.Регистратор
		|				И ОплатаСертификатами.ПодарочныйСертификат = ПодарочныеСертификаты.ПодарочныйСертификат
		|				И ОплатаСертификатами.НомерСертификата = ПодарочныеСертификаты.НомерСертификата
		|	ГДЕ
		|		ОплатаСертификатами.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыБезналичныхОплат.ПодарочныйСертификат)
		|		И ОплатаСертификатами.Ссылка В(&Ссылка)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПодарочныеСертификаты.ПодарочныйСертификат,
		|		ПодарочныеСертификаты.НомерСертификата,
		|		ПодарочныеСертификаты.Регистратор,
		|		ВЫБОР
		|			КОГДА ПодарочныеСертификаты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ПодарочныеСертификаты.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.ПодарочныеСертификаты КАК ПодарочныеСертификаты
		|	ГДЕ
		|		ПодарочныеСертификаты.Регистратор В
		|				(ВЫБРАТЬ
		|					ДокументДвиженияСертификата.Ссылка
		|				ИЗ
		|					Документ.ЧекККМ КАК ДокументДвиженияСертификата
		|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОРП
		|						ПО
		|							ДокументДвиженияСертификата.КассоваяСмена = ОРП.Ссылка
		|				ГДЕ
		|					ОРП.Ссылка = &Ссылка)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПодарочныеСертификаты.ПодарочныйСертификат,
		|		ПодарочныеСертификаты.НомерСертификата,
		|		ПодарочныеСертификаты.Регистратор,
		|		ВЫБОР
		|			КОГДА ПодарочныеСертификаты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ПодарочныеСертификаты.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.ПодарочныеСертификаты КАК ПодарочныеСертификаты
		|	ГДЕ
		|		ПодарочныеСертификаты.Регистратор В
		|				(ВЫБРАТЬ
		|					ДокументДвиженияСертификата.Ссылка
		|				ИЗ
		|					Документ.ЧекККМВозврат КАК ДокументДвиженияСертификата
		|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОРП
		|						ПО
		|							ДокументДвиженияСертификата.КассоваяСмена = ОРП.Ссылка
		|				ГДЕ
		|					ОРП.Ссылка = &Ссылка)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПодарочныеСертификаты.ПодарочныйСертификат,
		|		ПодарочныеСертификаты.НомерСертификата,
		|		ПодарочныеСертификаты.Регистратор,
		|		ВЫБОР
		|			КОГДА ПодарочныеСертификаты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ПодарочныеСертификаты.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.ПодарочныеСертификаты КАК ПодарочныеСертификаты
		|	ГДЕ
		|		ПодарочныеСертификаты.Регистратор = &Ссылка
		|		И НЕ ПодарочныеСертификаты.Регистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах) КАК ОстатокБезДвиженийДокумента
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстатокБезДвиженийДокумента.ПодарочныйСертификат,
		|	ОстатокБезДвиженийДокумента.НомерСертификата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияПередачиСертификата.Ссылка КАК Ссылка,
		|	ДвиженияПередачиСертификата.НомерСтроки КАК НомерСтроки,
		|	ДвиженияПередачиСертификата.Период КАК Период,
		|	ДвиженияПередачиСертификата.ВидДвижения КАК ВидДвижения,
		|	ДвиженияПередачиСертификата.Операция КАК Операция,
		|	ДвиженияПередачиСертификата.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	ДвиженияПередачиСертификата.НомерСертификата КАК НомерСертификата,
		|	ДвиженияПередачиСертификата.Организация КАК Организация,
		|	ДвиженияПередачиСертификата.ДержательСертификата КАК ДержательСертификата,
		|	ДвиженияПередачиСертификата.ДоговорДержателяСертификата КАК ДоговорДержателяСертификата,
		|	ДвиженияПередачиСертификата.Контрагент КАК Контрагент,
		|	ДвиженияПередачиСертификата.Договор КАК Договор,
		|	ДвиженияПередачиСертификата.Заказ КАК Заказ,
		|	ДвиженияПередачиСертификата.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ДвиженияПередачиСертификата.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ДвиженияПередачиСертификата.СчетУчетаДенежныхСредств КАК СчетУчетаДенежныхСредств,
		|	ДвиженияПередачиСертификата.СчетУчетаАвансовПокупателя КАК СчетУчетаАвансовПокупателя,
		|	ДвиженияПередачиСертификата.ВалютаДокумента КАК ВалютаДокумента,
		|	ДвиженияПередачиСертификата.СуммаДвиженияПоНоминалу КАК СуммаДвиженияПоНоминалу,
		|	ДвиженияПередачиСертификата.СуммаВалДвиженияПоНоминалу КАК СуммаВалДвиженияПоНоминалу,
		|	ДвиженияПередачиСертификата.СуммаДвиженияПоРасчетам КАК СуммаДвиженияПоРасчетам,
		|	ДвиженияПередачиСертификата.СуммаВалДвиженияПоРасчетам КАК СуммаВалДвиженияПоРасчетам,
		|	ДвиженияПередачиСертификата.СуммаДоходаОтРазницыСНоминалом КАК СуммаДоходаОтРазницыСНоминалом,
		|	ДвиженияПередачиСертификата.СуммаРасходаОтРазницыСНоминалом КАК СуммаРасходаОтРазницыСНоминалом,
		|	ДвиженияПередачиСертификата.СуммаВалДоходаОтРазницыСНоминалом КАК СуммаВалДоходаОтРазницыСНоминалом,
		|	ДвиженияПередачиСертификата.СуммаВалРасходаОтРазницыСНоминалом КАК СуммаВалРасходаОтРазницыСНоминалом
		|ПОМЕСТИТЬ ДвиженияПередачиСертификата
		|ИЗ
		|	вт_ПродажаСертификата КАК ДвиженияПередачиСертификата
		|ГДЕ
		|	ДвиженияПередачиСертификата.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДвиженияВозвратаСертификата.Ссылка,
		|	ДвиженияВозвратаСертификата.НомерСтроки,
		|	ДвиженияВозвратаСертификата.Период,
		|	ДвиженияВозвратаСертификата.ВидДвижения,
		|	ДвиженияВозвратаСертификата.Операция,
		|	ДвиженияВозвратаСертификата.ПодарочныйСертификат,
		|	ДвиженияВозвратаСертификата.НомерСертификата,
		|	ДвиженияВозвратаСертификата.Организация,
		|	ДвиженияВозвратаСертификата.ДержательСертификата,
		|	ДвиженияВозвратаСертификата.ДоговорДержателяСертификата,
		|	ДвиженияВозвратаСертификата.Контрагент,
		|	ДвиженияВозвратаСертификата.Договор,
		|	ДвиженияВозвратаСертификата.Заказ,
		|	ДвиженияВозвратаСертификата.НаправлениеДеятельности,
		|	ДвиженияВозвратаСертификата.ХозяйственнаяОперация,
		|	ДвиженияВозвратаСертификата.СчетУчетаДенежныхСредств,
		|	ДвиженияВозвратаСертификата.СчетУчетаАвансовПокупателя,
		|	ДвиженияВозвратаСертификата.ВалютаДокумента,
		|	ДвиженияВозвратаСертификата.СуммаДвиженияПоНоминалу * ЕСТЬNULL(ОстатокСертификата.СуммаОстаток / ДвиженияВозвратаСертификата.СуммаДвиженияПоНоминалу, 1),
		|	ДвиженияВозвратаСертификата.СуммаВалДвиженияПоНоминалу * ЕСТЬNULL(ОстатокСертификата.СуммаОстаток / ДвиженияВозвратаСертификата.СуммаДвиженияПоНоминалу, 1),
		|	ДвиженияВозвратаСертификата.СуммаДвиженияПоРасчетам * ЕСТЬNULL(ОстатокСертификата.СуммаОстаток / ДвиженияВозвратаСертификата.СуммаДвиженияПоНоминалу, 1),
		|	ДвиженияВозвратаСертификата.СуммаВалДвиженияПоРасчетам * ЕСТЬNULL(ОстатокСертификата.СуммаОстаток / ДвиженияВозвратаСертификата.СуммаДвиженияПоНоминалу, 1),
		|	ДвиженияВозвратаСертификата.СуммаДоходаОтРазницыСНоминалом * ЕСТЬNULL(ОстатокСертификата.СуммаОстаток / ДвиженияВозвратаСертификата.СуммаДвиженияПоНоминалу, 1),
		|	ДвиженияВозвратаСертификата.СуммаРасходаОтРазницыСНоминалом * ЕСТЬNULL(ОстатокСертификата.СуммаОстаток / ДвиженияВозвратаСертификата.СуммаДвиженияПоНоминалу, 1),
		|	ДвиженияВозвратаСертификата.СуммаВалДоходаОтРазницыСНоминалом * ЕСТЬNULL(ОстатокСертификата.СуммаОстаток / ДвиженияВозвратаСертификата.СуммаДвиженияПоНоминалу, 1),
		|	ДвиженияВозвратаСертификата.СуммаВалРасходаОтРазницыСНоминалом * ЕСТЬNULL(ОстатокСертификата.СуммаОстаток / ДвиженияВозвратаСертификата.СуммаДвиженияПоНоминалу, 1)
		|ИЗ
		|	вт_ПродажаСертификата КАК ДвиженияВозвратаСертификата
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиСертификатов КАК ОстатокСертификата
		|		ПО ДвиженияВозвратаСертификата.ПодарочныйСертификат = ОстатокСертификата.ПодарочныйСертификат
		|			И ДвиженияВозвратаСертификата.НомерСертификата = ОстатокСертификата.НомерСертификата
		|ГДЕ
		|	ДвиженияВозвратаСертификата.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ДвиженияВозвратаСертификата.СуммаДвиженияПоНоминалу <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОплатаСертификатом.Ссылка КАК Ссылка,
		|	ОплатаСертификатом.НомерСтроки КАК НомерСтроки,
		|	ОплатаСертификатом.Дата КАК Дата,
		|	ОплатаСертификатом.ВидДвижения КАК ВидДвижения,
		|	ОплатаСертификатом.Операция КАК Операция,
		|	ОплатаСертификатом.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	ОплатаСертификатом.НомерСертификата КАК НомерСертификата,
		|	ОплатаСертификатом.Организация КАК Организация,
		|	ОплатаСертификатом.ДержательСертификата КАК ДержательСертификата,
		|	ОплатаСертификатом.ДоговорДержателяСертификата КАК ДоговорДержателяСертификата,
		|	ОплатаСертификатом.Контрагент КАК Контрагент,
		|	ОплатаСертификатом.Договор КАК Договор,
		|	ВЫБОР
		|		КОГДА ОплатаСертификатом.Заказ = НЕОПРЕДЕЛЕНО
		|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
		|		ИНАЧЕ ЕСТЬNULL(ОплатаСертификатом.Заказ, ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))
		|	КОНЕЦ КАК Заказ,
		|	ОплатаСертификатом.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ОплатаСертификатом.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ОплатаСертификатом.СчетУчетаДенежныхСредств КАК СчетУчетаДенежныхСредств,
		|	ОплатаСертификатом.СчетУчетаАвансовПокупателя КАК СчетУчетаАвансовПокупателя,
		|	ОплатаСертификатом.ВалютаДокумента КАК ВалютаДокумента,
		|	ОплатаСертификатом.СуммаДвиженияПоНоминалу КАК СуммаДвиженияПоНоминалу,
		|	ОплатаСертификатом.СуммаВалДвиженияПоНоминалу КАК СуммаВалДвиженияПоНоминалу,
		|	ОплатаСертификатом.СуммаДвиженияПоРасчетам КАК СуммаДвиженияПоРасчетам,
		|	ОплатаСертификатом.СуммаВалДвиженияПоРасчетам КАК СуммаВалДвиженияПоРасчетам,
		|	ВЫБОР
		|		КОГДА ОплатаСертификатом.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И ОплатаСертификатом.СуммаДвиженияПоНоминалу > ОплатаСертификатом.СуммаДвиженияПоРасчетам
		|			ТОГДА ОплатаСертификатом.СуммаДвиженияПоНоминалу - ОплатаСертификатом.СуммаДвиженияПоРасчетам
		|		КОГДА ОплатаСертификатом.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И ОплатаСертификатом.СуммаДвиженияПоРасчетам > ОплатаСертификатом.СуммаДвиженияПоНоминалу
		|			ТОГДА -(ОплатаСертификатом.СуммаДвиженияПоРасчетам - ОплатаСертификатом.СуммаДвиженияПоНоминалу)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаДоходаОтРазницыСНоминалом,
		|	ВЫБОР
		|		КОГДА ОплатаСертификатом.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И ОплатаСертификатом.СуммаДвиженияПоРасчетам > ОплатаСертификатом.СуммаДвиженияПоНоминалу
		|			ТОГДА ОплатаСертификатом.СуммаДвиженияПоРасчетам - ОплатаСертификатом.СуммаДвиженияПоНоминалу
		|		КОГДА ОплатаСертификатом.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И ОплатаСертификатом.СуммаДвиженияПоНоминалу > ОплатаСертификатом.СуммаДвиженияПоРасчетам
		|			ТОГДА -(ОплатаСертификатом.СуммаДвиженияПоНоминалу - ОплатаСертификатом.СуммаДвиженияПоРасчетам)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаРасходаОтРазницыСНоминалом,
		|	ВЫБОР
		|		КОГДА ОплатаСертификатом.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И ОплатаСертификатом.СуммаВалДвиженияПоНоминалу > ОплатаСертификатом.СуммаВалДвиженияПоРасчетам
		|			ТОГДА ОплатаСертификатом.СуммаВалДвиженияПоНоминалу - ОплатаСертификатом.СуммаВалДвиженияПоРасчетам
		|		КОГДА ОплатаСертификатом.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И ОплатаСертификатом.СуммаВалДвиженияПоРасчетам > ОплатаСертификатом.СуммаВалДвиженияПоНоминалу
		|			ТОГДА -(ОплатаСертификатом.СуммаВалДвиженияПоРасчетам - ОплатаСертификатом.СуммаВалДвиженияПоНоминалу)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВалДоходаОтРазницыСНоминалом,
		|	ВЫБОР
		|		КОГДА ОплатаСертификатом.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И ОплатаСертификатом.СуммаВалДвиженияПоРасчетам > ОплатаСертификатом.СуммаВалДвиженияПоНоминалу
		|			ТОГДА ОплатаСертификатом.СуммаВалДвиженияПоРасчетам - ОплатаСертификатом.СуммаВалДвиженияПоНоминалу
		|		КОГДА ОплатаСертификатом.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И ОплатаСертификатом.СуммаВалДвиженияПоНоминалу > ОплатаСертификатом.СуммаВалДвиженияПоРасчетам
		|			ТОГДА -(ОплатаСертификатом.СуммаВалДвиженияПоНоминалу - ОплатаСертификатом.СуммаВалДвиженияПоРасчетам)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВалРасходаОтРазницыСНоминалом,
		|	ВЫБОР
		|		КОГДА ОплатаСертификатом.ОстатокСертификата <= ОплатаСертификатом.СуммаДвиженияПоНоминалу
		|				И ОплатаСертификатом.СуммаДвиженияПоНоминалу > 0
		|				И ОплатаСертификатом.Операция = ОплатаСертификатом.ВидДвижения
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СертификатПогашенПолностью
		|ПОМЕСТИТЬ вт_ОплатаСертификатом
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОплатаИОстатки.Ссылка КАК Ссылка,
		|		ОплатаИОстатки.НомерСтроки КАК НомерСтроки,
		|		ОплатаИОстатки.Дата КАК Дата,
		|		ОплатаИОстатки.ВидДвижения КАК ВидДвижения,
		|		ОплатаИОстатки.Операция КАК Операция,
		|		ОплатаИОстатки.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|		ОплатаИОстатки.НомерСертификата КАК НомерСертификата,
		|		ОплатаИОстатки.Организация КАК Организация,
		|		ОплатаИОстатки.Контрагент КАК Контрагент,
		|		ОплатаИОстатки.Договор КАК Договор,
		|		ОплатаИОстатки.Заказ КАК Заказ,
		|		ОплатаИОстатки.ДержательСертификата КАК ДержательСертификата,
		|		ОплатаИОстатки.ДоговорДержателяСертификата КАК ДоговорДержателяСертификата,
		|		ОплатаИОстатки.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|		ОплатаИОстатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|		ОплатаИОстатки.СчетУчетаАвансовПокупателя КАК СчетУчетаАвансовПокупателя,
		|		ОплатаИОстатки.СчетУчетаДенежныхСредств КАК СчетУчетаДенежныхСредств,
		|		ОплатаИОстатки.ВалютаДокумента КАК ВалютаДокумента,
		|		ВЫБОР Когда ОплатаИОстатки.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) Тогда
		|				ОплатаИОстатки.СуммаДвиженияПоНоминалу
		|			КОГДА ОплатаИОстатки.СуммаДвиженияПоНоминалу > ОплатаИОстатки.ОстатокСертификата
		|				ТОГДА ОплатаИОстатки.ОстатокСертификата
		|			ИНАЧЕ ОплатаИОстатки.СуммаДвиженияПоНоминалу
		|		КОНЕЦ КАК СуммаДвиженияПоНоминалу,
		|		ВЫБОР Когда ОплатаИОстатки.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) Тогда
		|				ОплатаИОстатки.СуммаВалДвиженияПоНоминалу
		|			КОГДА ОплатаИОстатки.СуммаДвиженияПоНоминалу > ОплатаИОстатки.ОстатокСертификата
		|				ТОГДА ОплатаИОстатки.ОстатокСертификатаВал
		|			ИНАЧЕ ОплатаИОстатки.СуммаВалДвиженияПоНоминалу
		|		КОНЕЦ КАК СуммаВалДвиженияПоНоминалу,
		|		ОплатаИОстатки.ОстатокСертификата КАК ОстатокСертификата,
		|		ОплатаИОстатки.ОстатокСертификатаВал КАК ОстатокСертификатаВал,
		|		ОплатаИОстатки.СуммаДвиженияПоРасчетам КАК СуммаДвиженияПоРасчетам,
		|		ОплатаИОстатки.СуммаВалДвиженияПоРасчетам КАК СуммаВалДвиженияПоРасчетам
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ДокументДвижения.Ссылка КАК Ссылка,
		|			ВременнаяТаблицаОплатаПлатежнымиКартами.НомерСтроки КАК НомерСтроки,
		|			ВременнаяТаблицаОплатаПлатежнымиКартами.Дата КАК Дата,
		|			ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|			ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(ДокументДвижения.Ссылка) = ТИП(Документ.ПриходнаяНакладная)
		|						ИЛИ ТИПЗНАЧЕНИЯ(ДокументДвижения.Ссылка) = ТИП(Документ.ЧекККМВозврат)
		|						ИЛИ ТИПЗНАЧЕНИЯ(ДокументДвижения.Ссылка) = ТИП(Документ.ОтчетОРозничныхПродажах)
		|							И ВременнаяТаблицаОплатаПлатежнымиКартами.ЭтоОтмена
		|					ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			КОНЕЦ КАК Операция,
		|			ВременнаяТаблицаОплатаПлатежнымиКартами.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|			ВременнаяТаблицаОплатаПлатежнымиКартами.НомерСертификата КАК НомерСертификата,
		|			ВременнаяТаблицаОплатаПлатежнымиКартами.Организация КАК Организация,
		|			ДокументДвижения.Контрагент КАК Контрагент,
		|			ДокументДвижения.Договор КАК Договор,
		|			ВременнаяТаблицаОплатаПлатежнымиКартами.Заказ КАК Заказ,
		|			ДержательСертификата.Ссылка КАК ДержательСертификата,
		|			ЕСТЬNULL(ЗаписьОсновногоДоговора.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК ДоговорДержателяСертификата,
		|			ДокументДвижения.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|			ДокументДвижения.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|			ДержательСертификата.СчетУчетаАвансовПокупателя КАК СчетУчетаАвансовПокупателя,
		|			ДержательСертификата.СчетУчетаРасчетовСПокупателем КАК СчетУчетаДенежныхСредств,
		|			ДокументДвижения.ВалютаДокумента КАК ВалютаДокумента,
		|			ВЫБОР
		|				КОГДА ВременнаяТаблицаОплатаПлатежнымиКартами.ЧастичноеПогашение
		|					ТОГДА ВременнаяТаблицаОплатаПлатежнымиКартами.СуммаСертификата
		|				КОГДА ВременнаяТаблицаОплатаПлатежнымиКартами.ИспользоватьСерииНоменклатуры
		|					ТОГДА ВЫБОР
		|							КОГДА ЕСТЬNULL(ПодарочныеСертификатыОстатки.СуммаОстаток, 0) > ВременнаяТаблицаОплатаПлатежнымиКартами.СуммаСертификата
		|								ТОГДА ЕСТЬNULL(ПодарочныеСертификатыОстатки.СуммаОстаток, 0)
		|							ИНАЧЕ ВременнаяТаблицаОплатаПлатежнымиКартами.СуммаСертификата
		|						КОНЕЦ
		|				ИНАЧЕ ВременнаяТаблицаОплатаПлатежнымиКартами.Номинал
		|			КОНЕЦ КАК СуммаДвиженияПоНоминалу,
		|			ВЫБОР
		|				КОГДА ВременнаяТаблицаОплатаПлатежнымиКартами.ЧастичноеПогашение
		|					ТОГДА ВременнаяТаблицаОплатаПлатежнымиКартами.СуммаСертификатаВал
		|				КОГДА ВременнаяТаблицаОплатаПлатежнымиКартами.ИспользоватьСерииНоменклатуры
		|					ТОГДА ВЫБОР
		|							КОГДА ЕСТЬNULL(ПодарочныеСертификатыОстатки.СуммаВалОстаток, 0) > ВременнаяТаблицаОплатаПлатежнымиКартами.СуммаСертификатаВал
		|								ТОГДА ЕСТЬNULL(ПодарочныеСертификатыОстатки.СуммаВалОстаток, 0)
		|							ИНАЧЕ ВременнаяТаблицаОплатаПлатежнымиКартами.СуммаСертификатаВал
		|						КОНЕЦ
		|				ИНАЧЕ ВременнаяТаблицаОплатаПлатежнымиКартами.Номинал
		|			КОНЕЦ КАК СуммаВалДвиженияПоНоминалу,
		|			ЕСТЬNULL(ПодарочныеСертификатыОстатки.СуммаОстаток, 0) КАК ОстатокСертификата,
		|			ЕСТЬNULL(ПодарочныеСертификатыОстатки.СуммаОстаток, 0) КАК ОстатокСертификатаВал,
		|			ВременнаяТаблицаОплатаПлатежнымиКартами.СуммаСертификата КАК СуммаДвиженияПоРасчетам,
		|			ВременнаяТаблицаОплатаПлатежнымиКартами.СуммаСертификатаВал КАК СуммаВалДвиженияПоРасчетам
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ВременнаяТаблицаОплатаПлатежнымиКартами.Ссылка КАК Ссылка,
		|				ВременнаяТаблицаОплатаПлатежнымиКартами.НомерСтроки КАК НомерСтроки,
		|				ВременнаяТаблицаОплатаПлатежнымиКартами.Дата КАК Дата,
		|				ВременнаяТаблицаОплатаПлатежнымиКартами.ВидОплаты КАК ВидОплаты,
		|				ВременнаяТаблицаОплатаПлатежнымиКартами.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|				ВременнаяТаблицаОплатаПлатежнымиКартами.НомерСертификата КАК НомерСертификата,
		|				ВременнаяТаблицаОплатаПлатежнымиКартами.Организация КАК Организация,
		|				ВременнаяТаблицаОплатаПлатежнымиКартами.Заказ КАК Заказ,
		|				ВременнаяТаблицаОплатаПлатежнымиКартами.Номинал КАК Номинал,
		|				ВременнаяТаблицаОплатаПлатежнымиКартами.ИспользоватьСерииНоменклатуры КАК ИспользоватьСерииНоменклатуры,
		|				ВременнаяТаблицаОплатаПлатежнымиКартами.ЧастичноеПогашение КАК ЧастичноеПогашение,
		|				ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаОплатаПлатежнымиКартами.Ссылка) = ТИП(Документ.ОтчетОРозничныхПродажах)
		|							И ВременнаяТаблицаОплатаПлатежнымиКартами.ЭтоОтмена
		|						ТОГДА -ВременнаяТаблицаОплатаПлатежнымиКартами.СуммаСертификата
		|					ИНАЧЕ ВременнаяТаблицаОплатаПлатежнымиКартами.СуммаСертификата
		|				КОНЕЦ КАК СуммаСертификата,
		|				ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаОплатаПлатежнымиКартами.Ссылка) = ТИП(Документ.ОтчетОРозничныхПродажах)
		|							И ВременнаяТаблицаОплатаПлатежнымиКартами.ЭтоОтмена
		|						ТОГДА -ВременнаяТаблицаОплатаПлатежнымиКартами.СуммаСертификатаВал
		|					ИНАЧЕ ВременнаяТаблицаОплатаПлатежнымиКартами.СуммаСертификатаВал
		|				КОНЕЦ КАК СуммаСертификатаВал,
		|				ВременнаяТаблицаОплатаПлатежнымиКартами.ЭтоОтмена КАК ЭтоОтмена
		|			ИЗ
		|				ВременнаяТаблицаОплатаПлатежнымиКартами КАК ВременнаяТаблицаОплатаПлатежнымиКартами) КАК ВременнаяТаблицаОплатаПлатежнымиКартами
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ДокументДвижения
		|				ПО (ДокументДвижения.Ссылка = ВременнаяТаблицаОплатаПлатежнымиКартами.Ссылка)
		|				ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиСертификатов КАК ПодарочныеСертификатыОстатки
		|				ПО ВременнаяТаблицаОплатаПлатежнымиКартами.ПодарочныйСертификат = ПодарочныеСертификатыОстатки.ПодарочныйСертификат
		|					И ВременнаяТаблицаОплатаПлатежнымиКартами.НомерСертификата = ПодарочныеСертификатыОстатки.НомерСертификата
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.КонтрагентДляПодарочныхСертификатов КАК НастройкаКонтрагентПодарочныхСертификатов
		|				ПО (ИСТИНА)
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК ДержательСертификата
		|				ПО (НастройкаКонтрагентПодарочныхСертификатов.Значение = ДержательСертификата.Ссылка)
		|				ЛЕВОЕ СОЕДИНЕНИЕ вт_ДанныеДержателяАванса КАК ЗаписьОсновногоДоговора
		|				ПО (ЗаписьОсновногоДоговора.Контрагент = ДержательСертификата.Ссылка)
		|		ГДЕ
		|			ВременнаяТаблицаОплатаПлатежнымиКартами.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыБезналичныхОплат.ПодарочныйСертификат)) КАК ОплатаИОстатки) КАК ОплатаСертификатом
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаДанные.Заказ = НЕОПРЕДЕЛЕНО
		|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
		|		ИНАЧЕ ЕСТЬNULL(ВременнаяТаблицаДанные.Заказ, ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))
		|	КОНЕЦ КАК Заказ,
		|	СУММА(ВременнаяТаблицаДанные.Сумма) КАК СуммаРасчетов
		|ПОМЕСТИТЬ ВТ_Заказы
		|ИЗ
		|	ВременнаяТаблицаЗапасы КАК ВременнаяТаблицаДанные
		|ГДЕ
		|	ВременнаяТаблицаДанные.ВестиРасчетыПоЗаказам
		|	И НЕ ТИПЗНАЧЕНИЯ(ВременнаяТаблицаДанные.Документ) = ТИП(Документ.ЗаказПокупателя)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаДанные.Заказ = НЕОПРЕДЕЛЕНО
		|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
		|		ИНАЧЕ ЕСТЬNULL(ВременнаяТаблицаДанные.Заказ, ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка),
		|	СУММА(ВременнаяТаблицаДанные.Сумма)
		|ИЗ
		|	ВременнаяТаблицаЗапасы КАК ВременнаяТаблицаДанные
		|ГДЕ
		|	НЕ ВременнаяТаблицаДанные.ВестиРасчетыПоЗаказам
		|	И НЕ ТИПЗНАЧЕНИЯ(ВременнаяТаблицаДанные.Документ) = ТИП(Документ.ЗаказПокупателя)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВременнаяТаблицаДанные.Контрагент.ВестиРасчетыПоЗаказам, ЛОЖЬ)
		|			ТОГДА ВременнаяТаблицаДанные.Ссылка
		|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВременнаяТаблицаДанные.СуммаДокумента
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаДанные
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ВременнаяТаблицаДанные.Ссылка) = ТИП(Документ.ЗаказПокупателя)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказыКОплате.Заказ КАК Заказ,
		|	ЗаказыКОплате.СуммаРасчетов - ЕСТЬNULL(ЗачтеннаяПредоплата.Сумма, 0) КАК КЗачету
		|ПОМЕСТИТЬ вт_СуммыЗачетаПоЗаказам
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПроизведеннаяОплата.Заказ КАК Заказ,
		|		СУММА(ПроизведеннаяОплата.Сумма) КАК Сумма
		|	ИЗ
		|		ВременнаяТаблицаПредоплата КАК ПроизведеннаяОплата
		|	ГДЕ
		|		НЕ ПроизведеннаяОплата.ОплатаСертификатом
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПроизведеннаяОплата.Заказ) КАК ЗачтеннаяПредоплата
		|		ПРАВОЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ЗаказыКОплате
		|		ПО ЗачтеннаяПредоплата.Заказ = ЗаказыКОплате.Заказ
		|ГДЕ
		|	ЗаказыКОплате.СуммаРасчетов > ЕСТЬNULL(ЗачтеннаяПредоплата.Сумма, 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таблица1.Заказ КАК Заказ,
		|	Таблица1.КЗачету КАК СуммаЗаказа,
		|	ЕСТЬNULL(СУММА(Таблица2.КЗачету), 0) КАК СуммаС,
		|	Таблица1.КЗачету + ЕСТЬNULL(СУММА(Таблица2.КЗачету), 0) КАК СуммаПо,
		|	ВЫБОР
		|		КОГДА Таблица2.КЗачету ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПервыйЗаказ
		|ПОМЕСТИТЬ вт_ПорядокЗачетаЗаказов
		|ИЗ
		|	вт_СуммыЗачетаПоЗаказам КАК Таблица1
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СуммыЗачетаПоЗаказам КАК Таблица2
		|		ПО Таблица1.Заказ > Таблица2.Заказ
		|
		|СГРУППИРОВАТЬ ПО
		|	Таблица1.Заказ,
		|	Таблица1.КЗачету,
		|	ВЫБОР
		|		КОГДА Таблица2.КЗачету ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗачетЗаказовПоПорядку.Заказ КАК Заказ,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ОплатаСертификатом.ИтогоОплата < ЗачетЗаказовПоПорядку.СуммаС
		|				ТОГДА 0
		|			КОГДА ОплатаСертификатом.ИтогоОплата = 0
		|				ТОГДА 0
		|			КОГДА ОплатаСертификатом.ИтогоОплата >= ЗачетЗаказовПоПорядку.СуммаПо
		|				ТОГДА ЗачетЗаказовПоПорядку.СуммаЗаказа / ОплатаСертификатом.ИтогоОплата
		|			ИНАЧЕ (ОплатаСертификатом.ИтогоОплата - ЗачетЗаказовПоПорядку.СуммаС) / ОплатаСертификатом.ИтогоОплата
		|		КОНЕЦ КАК ЧИСЛО(10, 9)) КАК ДоляОплатыСертификатомНаЗаказ
		|ПОМЕСТИТЬ вт_СуммыЗаказовКОплатеСертификатов
		|ИЗ
		|	вт_ПорядокЗачетаЗаказов КАК ЗачетЗаказовПоПорядку
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЕСТЬNULL(СУММА(ОплатаСертификатом.СуммаВалДвиженияПоРасчетам), 0) КАК ИтогоОплата
		|		ИЗ
		|			вт_ОплатаСертификатом КАК ОплатаСертификатом) КАК ОплатаСертификатом
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОплатаСертификатом.НомерСтроки КАК НомерСтроки,
		|	ОплатаСертификатом.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	ОплатаСертификатом.НомерСертификата КАК НомерСертификата,
		|	СуммыПоЗаказам.Заказ КАК Заказ,
		|	ВЫРАЗИТЬ(ОплатаСертификатом.СуммаДвиженияПоРасчетам * СуммыПоЗаказам.ДоляОплатыСертификатомНаЗаказ КАК ЧИСЛО(15, 2)) КАК СуммаДвиженияПоРасчетам,
		|	ВЫРАЗИТЬ(ОплатаСертификатом.СуммаВалДвиженияПоРасчетам * СуммыПоЗаказам.ДоляОплатыСертификатомНаЗаказ КАК ЧИСЛО(15, 2)) КАК СуммаВалДвиженияПоРасчетам
		|ПОМЕСТИТЬ вт_РаспределениеОплатПоЗаказам
		|ИЗ
		|	вт_ОплатаСертификатом КАК ОплатаСертификатом
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_СуммыЗаказовКОплатеСертификатов КАК СуммыПоЗаказам
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ СуммыПоЗаказам.ДоляОплатыСертификатомНаЗаказ = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СуммаСучетомКопеек.НомерСтроки КАК НомерСтроки,
		|	СуммаСучетомКопеек.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	СуммаСучетомКопеек.НомерСертификата КАК НомерСертификата,
		|	СуммаСучетомКопеек.Заказ КАК Заказ,
		|	СУММА(СуммаСучетомКопеек.СуммаДвиженияПоРасчетам) КАК СуммаДвиженияПоРасчетам,
		|	СУММА(СуммаСучетомКопеек.СуммаВалДвиженияПоРасчетам) КАК СуммаВалДвиженияПоРасчетам
		|ПОМЕСТИТЬ вт_РаспределениеОплатПоЗаказамСКопейками
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОплатаСертификатомДоКопеек.НомерСтроки КАК НомерСтроки,
		|		ОплатаСертификатомДоКопеек.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|		ОплатаСертификатомДоКопеек.НомерСертификата КАК НомерСертификата,
		|		СписокЗаказов.Заказ КАК Заказ,
		|		-ОплатаСертификатомДоКопеек.СуммаДвиженияПоРасчетам КАК СуммаДвиженияПоРасчетам,
		|		-ОплатаСертификатомДоКопеек.СуммаВалДвиженияПоРасчетам КАК СуммаВалДвиженияПоРасчетам
		|	ИЗ
		|		вт_РаспределениеОплатПоЗаказам КАК ОплатаСертификатомДоКопеек
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ПорядокЗачетаЗаказов КАК СписокЗаказов
		|			ПО (СписокЗаказов.ПервыйЗаказ)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ОплатаСертификатом.НомерСтроки,
		|		ОплатаСертификатом.ПодарочныйСертификат,
		|		ОплатаСертификатом.НомерСертификата,
		|		СписокЗаказов.Заказ,
		|		ОплатаСертификатом.СуммаДвиженияПоРасчетам,
		|		ОплатаСертификатом.СуммаВалДвиженияПоРасчетам
		|	ИЗ
		|		вт_ОплатаСертификатом КАК ОплатаСертификатом
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ПорядокЗачетаЗаказов КАК СписокЗаказов
		|			ПО (СписокЗаказов.ПервыйЗаказ)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ОплатаСертификатомДоКопеек.НомерСтроки,
		|		ОплатаСертификатомДоКопеек.ПодарочныйСертификат,
		|		ОплатаСертификатомДоКопеек.НомерСертификата,
		|		ОплатаСертификатомДоКопеек.Заказ,
		|		ОплатаСертификатомДоКопеек.СуммаДвиженияПоРасчетам,
		|		ОплатаСертификатомДоКопеек.СуммаВалДвиженияПоРасчетам
		|	ИЗ
		|		вт_РаспределениеОплатПоЗаказам КАК ОплатаСертификатомДоКопеек) КАК СуммаСучетомКопеек
		|
		|СГРУППИРОВАТЬ ПО
		|	СуммаСучетомКопеек.НомерСтроки,
		|	СуммаСучетомКопеек.ПодарочныйСертификат,
		|	СуммаСучетомКопеек.НомерСертификата,
		|	СуммаСучетомКопеек.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажаСертификата.Ссылка КАК Ссылка,
		|	ПродажаСертификата.НомерСтроки КАК НомерСтроки,
		|	ПродажаСертификата.Период КАК Период,
		|	ПродажаСертификата.ВидДвижения КАК ВидДвижения,
		|	ПродажаСертификата.Операция КАК Операция,
		|	ПродажаСертификата.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	ПродажаСертификата.НомерСертификата КАК НомерСертификата,
		|	ПродажаСертификата.Организация КАК Организация,
		|	ПродажаСертификата.Контрагент КАК Контрагент,
		|	ПродажаСертификата.Договор КАК Договор,
		|	ПродажаСертификата.Заказ КАК Заказ,
		|	ПродажаСертификата.ДержательСертификата КАК ДержательСертификата,
		|	ПродажаСертификата.ДоговорДержателяСертификата КАК ДоговорДержателяСертификата,
		|	ПродажаСертификата.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ПродажаСертификата.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ПродажаСертификата.СчетУчетаДенежныхСредств КАК СчетУчетаДенежныхСредств,
		|	ПродажаСертификата.СчетУчетаАвансовПокупателя КАК СчетУчетаАвансовПокупателя,
		|	ПродажаСертификата.ВалютаДокумента КАК ВалютаДокумента,
		|	ПродажаСертификата.СуммаДвиженияПоНоминалу КАК СуммаДвиженияПоНоминалу,
		|	ПродажаСертификата.СуммаВалДвиженияПоНоминалу КАК СуммаВалДвиженияПоНоминалу,
		|	ПродажаСертификата.СуммаДвиженияПоРасчетам КАК СуммаДвиженияПоРасчетам,
		|	ПродажаСертификата.СуммаВалДвиженияПоРасчетам КАК СуммаВалДвиженияПоРасчетам,
		|	ПродажаСертификата.СуммаДоходаОтРазницыСНоминалом КАК СуммаДоходаОтРазницыСНоминалом,
		|	ПродажаСертификата.СуммаРасходаОтРазницыСНоминалом КАК СуммаРасходаОтРазницыСНоминалом,
		|	ПродажаСертификата.СуммаВалДоходаОтРазницыСНоминалом КАК СуммаВалДоходаОтРазницыСНоминалом,
		|	ПродажаСертификата.СуммаВалРасходаОтРазницыСНоминалом КАК СуммаВалРасходаОтРазницыСНоминалом,
		|	ЛОЖЬ КАК СертификатПогашенПолностью
		|ПОМЕСТИТЬ ВременнаяТаблицаДвиженийСертификатов
		|ИЗ
		|	ДвиженияПередачиСертификата КАК ПродажаСертификата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОплатаСертификатом.Ссылка,
		|	ОплатаСертификатом.НомерСтроки,
		|	ОплатаСертификатом.Дата,
		|	ОплатаСертификатом.ВидДвижения,
		|	ОплатаСертификатом.Операция,
		|	ОплатаСертификатом.ПодарочныйСертификат,
		|	ОплатаСертификатом.НомерСертификата,
		|	ОплатаСертификатом.Организация,
		|	ОплатаСертификатом.Контрагент,
		|	ОплатаСертификатом.Договор,
		|	ОплатаСертификатом.Заказ,
		|	ОплатаСертификатом.ДержательСертификата,
		|	ОплатаСертификатом.ДоговорДержателяСертификата,
		|	ОплатаСертификатом.НаправлениеДеятельности,
		|	ОплатаСертификатом.ХозяйственнаяОперация,
		|	ОплатаСертификатом.СчетУчетаДенежныхСредств,
		|	ОплатаСертификатом.СчетУчетаАвансовПокупателя,
		|	ОплатаСертификатом.ВалютаДокумента,
		|	ОплатаСертификатом.СуммаДвиженияПоНоминалу,
		|	ОплатаСертификатом.СуммаВалДвиженияПоНоминалу,
		|	ОплатаСертификатом.СуммаДвиженияПоРасчетам,
		|	ОплатаСертификатом.СуммаВалДвиженияПоРасчетам,
		|	ОплатаСертификатом.СуммаДоходаОтРазницыСНоминалом,
		|	ОплатаСертификатом.СуммаРасходаОтРазницыСНоминалом,
		|	ОплатаСертификатом.СуммаВалДоходаОтРазницыСНоминалом,
		|	ОплатаСертификатом.СуммаВалРасходаОтРазницыСНоминалом,
		|	ОплатаСертификатом.СертификатПогашенПолностью
		|ИЗ
		|	вт_ОплатаСертификатом КАК ОплатаСертификатом
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОплатаСертификатом.Ссылка КАК Ссылка,
		|	ОплатаСертификатом.НомерСтроки КАК НомерСтроки,
		|	ОплатаСертификатом.Дата КАК Период,
		|	ОплатаСертификатом.ВидДвижения КАК ВидДвижения,
		|	ОплатаСертификатом.Операция КАК Операция,
		|	ОплатаСертификатом.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	ОплатаСертификатом.НомерСертификата КАК НомерСертификата,
		|	ОплатаСертификатом.Организация КАК Организация,
		|	ОплатаСертификатом.Контрагент КАК Контрагент,
		|	ОплатаСертификатом.Договор КАК Договор,
		|	СуммаЗачетаОплатыСертификатаПоЗаказу.Заказ КАК Заказ,
		|	ОплатаСертификатом.ДержательСертификата КАК ДержательСертификата,
		|	ОплатаСертификатом.ДоговорДержателяСертификата КАК ДоговорДержателяСертификата,
		|	ОплатаСертификатом.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ОплатаСертификатом.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ОплатаСертификатом.СчетУчетаДенежныхСредств КАК СчетУчетаДенежныхСредств,
		|	ОплатаСертификатом.СчетУчетаАвансовПокупателя КАК СчетУчетаАвансовПокупателя,
		|	ОплатаСертификатом.ВалютаДокумента КАК ВалютаДокумента,
		|	СуммаЗачетаОплатыСертификатаПоЗаказу.СуммаДвиженияПоРасчетам КАК СуммаДвиженияПоРасчетам,
		|	СуммаЗачетаОплатыСертификатаПоЗаказу.СуммаВалДвиженияПоРасчетам КАК СуммаВалДвиженияПоРасчетам
		|ПОМЕСТИТЬ ЗачетОплатыСертификатамиПоЗаказам
		|ИЗ
		|	вт_ОплатаСертификатом КАК ОплатаСертификатом
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_РаспределениеОплатПоЗаказамСКопейками КАК СуммаЗачетаОплатыСертификатаПоЗаказу
		|		ПО (СуммаЗачетаОплатыСертификатаПоЗаказу.НомерСертификата = ОплатаСертификатом.НомерСертификата)
		|			И (СуммаЗачетаОплатыСертификатаПоЗаказу.ПодарочныйСертификат = ОплатаСертификатом.ПодарочныйСертификат)
		|			И (СуммаЗачетаОплатыСертификатаПоЗаказу.НомерСтроки = ОплатаСертификатом.НомерСтроки)";
		Если НЕ ИмяТаблицыОплатыСертификатом = Неопределено Тогда 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВременнаяТаблицаОплатаПлатежнымиКартами КАК", ИмяТаблицыОплатыСертификатом + " КАК");
		КонецЕсли;
		Если НЕ ИмяТаблицыПродажиСертификатов = Неопределено Тогда 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВременнаяТаблицаЗапасы КАК", ИмяТаблицыПродажиСертификатов + " КАК");
		КонецЕсли;
	Иначе
		ТекстЗапроса = ТекстЗапросаПустойТаблицы;
	КонецЕсли;
	
	Возврат ТекстЗапроса	
	
КонецФункции

Функция ТекстЗапросаДвиженийПодарочныхСертификатов(ВыполнятьДвижения = Истина) Экспорт
	Если ВыполнятьДвижения И ПолучитьФункциональнуюОпцию("ИспользоватьПодарочныеСертификаты") Тогда	
		Текст = "
		|ВЫБРАТЬ
		|	ВременнаяТаблицаДвиженийСертификатов.Период КАК Период,
		|	ВременнаяТаблицаДвиженийСертификатов.ВидДвижения КАК ВидДвижения,
		|	ВременнаяТаблицаДвиженийСертификатов.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	ВременнаяТаблицаДвиженийСертификатов.НомерСертификата КАК НомерСертификата,
		|	Выбор Когда ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ВременнаяТаблицаДвиженийСертификатов.Операция
		|		Тогда ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоНоминалу 
		|		Иначе -ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоНоминалу
		|	Конец КАК Сумма
		|ИЗ
		|	ВременнаяТаблицаДвиженийСертификатов КАК ВременнаяТаблицаДвиженийСертификатов
		|ГДЕ НЕ ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоНоминалу = 0 
		|";
	Иначе
		Текст = "
		|ВЫБРАТЬ
		|	ДатаВремя(1, 1, 1) КАК Период,
		|	Значение(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК ПодарочныйСертификат,
		|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК НомерСертификата,
		|	0 КАК Сумма
		|Где
		|	Ложь";
	КонецЕсли;
	Возврат Текст
КонецФункции


Функция ТекстЗапросаДвиженийОплатыПодарочнымиСертификатами(ВыполнятьДвижения = Истина) Экспорт

	Если ВыполнятьДвижения И ПолучитьФункциональнуюОпцию("ИспользоватьПодарочныеСертификаты") Тогда	
		Текст = 
		"ВЫБРАТЬ
		|	ВременнаяТаблицаДвиженийСертификатов.Период КАК Период,
		|	ВременнаяТаблицаДвиженийСертификатов.Организация КАК Организация,
		|	ДокументДвижения.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ВременнаяТаблицаДвиженийСертификатов.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаДвиженийСертификатов.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	ВременнаяТаблицаДвиженийСертификатов.НомерСертификата КАК НомерСертификата,
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ВременнаяТаблицаДвиженийСертификатов.Операция
		|				ТОГДА ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоРасчетам
		|			ИНАЧЕ -ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоРасчетам
		|		КОНЕЦ) КАК Сумма
		|ИЗ
		|	ВременнаяТаблицаДвиженийСертификатов КАК ВременнаяТаблицаДвиженийСертификатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ДокументДвижения
		|		ПО (ДокументДвижения.Ссылка = ВременнаяТаблицаДвиженийСертификатов.Ссылка)
		|ГДЕ
		|	ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И НЕ ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоРасчетам = 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаДвиженийСертификатов.Период,
		|	ВременнаяТаблицаДвиженийСертификатов.Организация,
		|	ДокументДвижения.СтруктурнаяЕдиница,
		|	ВременнаяТаблицаДвиженийСертификатов.Контрагент,
		|	ВременнаяТаблицаДвиженийСертификатов.ПодарочныйСертификат,
		|	ВременнаяТаблицаДвиженийСертификатов.НомерСертификата";
	Иначе
		Текст = "
		|ВЫБРАТЬ
		|	ДатаВремя(1, 1, 1) КАК Период,
		|	Значение(Справочник.Организации.ПустаяСсылка) КАК Организация,
		|	Значение(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) КАК СтруктурнаяЕдиница,
		|	Значение(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
		|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК ПодарочныйСертификат,
		|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК НомерСертификата,
		|	0 КАК Сумма
		|Где
		|	Ложь";
	КонецЕсли;
	Возврат Текст
КонецФункции

Функция ТекстЗапросаДвиженийРасчетыСПокупателями(ВыполнятьДвижения = Истина, ТолькоПереносАванса = Ложь) Экспорт
	
	Если ВыполнятьДвижения И ПолучитьФункциональнуюОпцию("ИспользоватьПодарочныеСертификаты") Тогда	
		Текст = 
		"ВЫБРАТЬ
		|	ВременнаяТаблицаДвиженийСертификатов.Период КАК Период,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	КОНЕЦ КАК ВидДвижения,
		|	ВременнаяТаблицаДвиженийСертификатов.Организация КАК Организация,
		|	ВременнаяТаблицаДвиженийСертификатов.ДержательСертификата КАК Контрагент,
		|	ВременнаяТаблицаДвиженийСертификатов.ДоговорДержателяСертификата КАК Договор,
		|	НЕОПРЕДЕЛЕНО как Документ,
		|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК Заказ,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс) КАК ТипРасчетов,
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаДвиженийСертификатов.Операция = ВременнаяТаблицаДвиженийСертификатов.ВидДвижения
		|				ТОГДА ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоНоминалу
		|			ИНАЧЕ -ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоНоминалу
		|		КОНЕЦ) КАК Сумма,
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаДвиженийСертификатов.Операция = ВременнаяТаблицаДвиженийСертификатов.ВидДвижения
		|				ТОГДА ВременнаяТаблицаДвиженийСертификатов.СуммаВалДвиженияПоНоминалу
		|			ИНАЧЕ -ВременнаяТаблицаДвиженийСертификатов.СуммаВалДвиженияПоНоминалу
		|		КОНЕЦ) КАК СуммаВал,
		|	ВременнаяТаблицаДвиженийСертификатов.СчетУчетаАвансовПокупателя КАК СчетУчета,
		|	ВременнаяТаблицаДвиженийСертификатов.ВалютаДокумента КАК Валюта,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаДвиженийСертификатов.ВидДвижения= ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И ВременнаяТаблицаДвиженийСертификатов.Операция  = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА &ВозникновениеАванса
		|		КОГДА ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И ВременнаяТаблицаДвиженийСертификатов.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ТОГДА &СторнированиеАванса
		|		КОГДА ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И ВременнаяТаблицаДвиженийСертификатов.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ТОГДА &ЗачетАванса
		|		КОГДА ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И ВременнаяТаблицаДвиженийСертификатов.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА &ВосстановлениеАванса
		|	КОНЕЦ КАК СодержаниеПроводки,
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаДвиженийСертификатов.Операция = ВременнаяТаблицаДвиженийСертификатов.ВидДвижения
		|				ТОГДА ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоНоминалу
		|			ИНАЧЕ -ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоНоминалу
		|		КОНЕЦ) КАК СуммаРег,
		|	0 КАК Курс,
		|	НЕОПРЕДЕЛЕНО КАК СпособЗачета,
		|	0 КАК Кратность,
		|	НЕОПРЕДЕЛЕНО КАК ДокументОплаты,
		|	0 КАК СуммаПлатежа,
		|	НЕОПРЕДЕЛЕНО КАК ВалютаПлатежа,
		|	0 КАК СуммаНДС,
		|	НЕОПРЕДЕЛЕНО КАК СтавкаНДС,
		|	Ложь КАК ЭтоОплатаЗаказа,
		|	Ложь КАК ОплатаСертификатом
		|
		|ИЗ
		|	ВременнаяТаблицаДвиженийСертификатов КАК ВременнаяТаблицаДвиженийСертификатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ДокументДвижения
		|		ПО (ДокументДвижения.Ссылка = ВременнаяТаблицаДвиженийСертификатов.Ссылка)
		|ГДЕ НЕ ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоНоминалу = 0 
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаДвиженийСертификатов.Организация,
		|	ВременнаяТаблицаДвиженийСертификатов.ВидДвижения,
		|	ВременнаяТаблицаДвиженийСертификатов.Заказ,
		|	ВременнаяТаблицаДвиженийСертификатов.ДержательСертификата,
		|	ВременнаяТаблицаДвиженийСертификатов.ДоговорДержателяСертификата,
		|	ВременнаяТаблицаДвиженийСертификатов.СчетУчетаАвансовПокупателя,
		|	ВременнаяТаблицаДвиженийСертификатов.ВалютаДокумента,
		|	ВременнаяТаблицаДвиженийСертификатов.Операция,
		|	ВременнаяТаблицаДвиженийСертификатов.Период,
		|	ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И ВременнаяТаблицаДвиженийСертификатов.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА &ВозникновениеАванса
		|		КОГДА ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И ВременнаяТаблицаДвиженийСертификатов.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ТОГДА &СторнированиеАванса
		|		КОГДА ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И ВременнаяТаблицаДвиженийСертификатов.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ТОГДА &ЗачетАванса
		|		КОГДА ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И ВременнаяТаблицаДвиженийСертификатов.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА &ВосстановлениеАванса
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаДвиженийСертификатов.Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	ВременнаяТаблицаДвиженийСертификатов.Организация,
		|	ВременнаяТаблицаДвиженийСертификатов.Контрагент,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(КонтрагентПокупатель.ВестиРасчетыПоДоговорам, ЛОЖЬ)
		|			ТОГДА ВременнаяТаблицаДвиженийСертификатов.Договор
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(КонтрагентПокупатель.ВестиРасчетыПоДокументам, ЛОЖЬ)
		|			ТОГДА ДокументДвижения.Ссылка
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(КонтрагентПокупатель.ВестиРасчетыПоЗаказам, ЛОЖЬ)
		|			ТОГДА ВременнаяТаблицаДвиженийСертификатов.Заказ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаДвиженийСертификатов.Операция = ВременнаяТаблицаДвиженийСертификатов.ВидДвижения
		|				ТОГДА ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоРасчетам
		|			ИНАЧЕ -ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоРасчетам
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаДвиженийСертификатов.Операция = ВременнаяТаблицаДвиженийСертификатов.ВидДвижения
		|				ТОГДА ВременнаяТаблицаДвиженийСертификатов.СуммаВалДвиженияПоРасчетам
		|			ИНАЧЕ -ВременнаяТаблицаДвиженийСертификатов.СуммаВалДвиженияПоРасчетам
		|		КОНЕЦ),
		|	ВременнаяТаблицаДвиженийСертификатов.СчетУчетаАвансовПокупателя,
		|	ВременнаяТаблицаДвиженийСертификатов.ВалютаДокумента,
		|	&ЗачетАванса,
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаДвиженийСертификатов.Операция = ВременнаяТаблицаДвиженийСертификатов.ВидДвижения
		|				ТОГДА ВременнаяТаблицаДвиженийСертификатов.СуммаВалДвиженияПоРасчетам
		|			ИНАЧЕ -ВременнаяТаблицаДвиженийСертификатов.СуммаВалДвиженияПоРасчетам
		|		КОНЕЦ),
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	Истина,
		|	Истина
		|ИЗ
		|	ЗачетОплатыСертификатамиПоЗаказам КАК ВременнаяТаблицаДвиженийСертификатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ДокументДвижения
		|		ПО (ДокументДвижения.Ссылка = ВременнаяТаблицаДвиженийСертификатов.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентПокупатель
		|		ПО ВременнаяТаблицаДвиженийСертификатов.Контрагент = КонтрагентПокупатель.Ссылка
		|ГДЕ
		|	ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И НЕ ТИПЗНАЧЕНИЯ(ВременнаяТаблицаДвиженийСертификатов.Ссылка) В (ТИП(Документ.ЧекККМ), ТИП(Документ.ЧекККМВозврат), ТИП(Документ.ЧекККМКоррекции), ТИП(Документ.ОтчетОРозничныхПродажах))
		|	И НЕ ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоРасчетам = 0
		|	И НЕ &ФиксироватьАванс
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаДвиженийСертификатов.Организация,
		|	ВременнаяТаблицаДвиженийСертификатов.ВидДвижения,
		|	ВременнаяТаблицаДвиженийСертификатов.Контрагент,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(КонтрагентПокупатель.ВестиРасчетыПоДоговорам, ЛОЖЬ)
		|			ТОГДА ВременнаяТаблицаДвиженийСертификатов.Договор
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(КонтрагентПокупатель.ВестиРасчетыПоДокументам, ЛОЖЬ)
		|			ТОГДА ДокументДвижения.Ссылка
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(КонтрагентПокупатель.ВестиРасчетыПоЗаказам, ЛОЖЬ)
		|			ТОГДА ВременнаяТаблицаДвиженийСертификатов.Заказ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВременнаяТаблицаДвиженийСертификатов.СчетУчетаАвансовПокупателя,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(КонтрагентПокупатель.ВестиРасчетыПоДокументам, ЛОЖЬ)
		|			ТОГДА ДокументДвижения.Ссылка
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВременнаяТаблицаДвиженийСертификатов.ВалютаДокумента,
		|	ВременнаяТаблицаДвиженийСертификатов.Операция,
		|	ВременнаяТаблицаДвиженийСертификатов.Период,
		|	ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаДвиженийСертификатов.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА &ВозникновениеАванса
		|		КОГДА ВременнаяТаблицаДвиженийСертификатов.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ТОГДА &СторнированиеАванса
		|		КОГДА ВременнаяТаблицаДвиженийСертификатов.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ТОГДА &ЗачетАванса
		|		КОГДА ВременнаяТаблицаДвиженийСертификатов.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА &ВосстановлениеАванса
		|	КОНЕЦ
		|		
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаДвиженийСертификатов.Период,
		|	ВременнаяТаблицаДвиженийСертификатов.ВидДвижения,
		|	ВременнаяТаблицаДвиженийСертификатов.Организация,
		|	ВременнаяТаблицаДвиженийСертификатов.Контрагент,
		|	ВременнаяТаблицаДвиженийСертификатов.Договор,
		|	ДокументДвижения.Ссылка,
		|	ВременнаяТаблицаДвиженийСертификатов.Заказ,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс),
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаДвиженийСертификатов.Операция = ВременнаяТаблицаДвиженийСертификатов.ВидДвижения
		|				ТОГДА ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоРасчетам
		|			ИНАЧЕ -ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоРасчетам
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаДвиженийСертификатов.Операция = ВременнаяТаблицаДвиженийСертификатов.ВидДвижения
		|				ТОГДА ВременнаяТаблицаДвиженийСертификатов.СуммаВалДвиженияПоРасчетам
		|			ИНАЧЕ -ВременнаяТаблицаДвиженийСертификатов.СуммаВалДвиженияПоРасчетам
		|		КОНЕЦ),
		|	ВременнаяТаблицаДвиженийСертификатов.СчетУчетаАвансовПокупателя,
		|	ВременнаяТаблицаДвиженийСертификатов.ВалютаДокумента,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаДвиженийСертификатов.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА &ВосстановлениеАванса
		|		КОГДА ВременнаяТаблицаДвиженийСертификатов.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ТОГДА &ЗачетАванса
		|	КОНЕЦ,
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаДвиженийСертификатов.Операция = ВременнаяТаблицаДвиженийСертификатов.ВидДвижения
		|				ТОГДА ВременнаяТаблицаДвиженийСертификатов.СуммаВалДвиженияПоРасчетам
		|			ИНАЧЕ -ВременнаяТаблицаДвиженийСертификатов.СуммаВалДвиженияПоРасчетам
		|		КОНЕЦ),
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	Истина,
		|	Истина
		|ИЗ
		|	ЗачетОплатыСертификатамиПоЗаказам КАК ВременнаяТаблицаДвиженийСертификатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ДокументДвижения
		|		ПО (ДокументДвижения.Ссылка = ВременнаяТаблицаДвиженийСертификатов.Ссылка)
		|ГДЕ
		|	ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И НЕ ТИПЗНАЧЕНИЯ(ВременнаяТаблицаДвиженийСертификатов.Ссылка) В (ТИП(Документ.ЧекККМ), ТИП(Документ.ЧекККМВозврат), ТИП(Документ.ЧекККМКоррекции), ТИП(Документ.ОтчетОРозничныхПродажах))
		|	И НЕ ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоРасчетам = 0
		|	И &ФиксироватьАванс
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаДвиженийСертификатов.Организация,
		|	ВременнаяТаблицаДвиженийСертификатов.ВидДвижения,
		|	ВременнаяТаблицаДвиженийСертификатов.Контрагент,
		|	ВременнаяТаблицаДвиженийСертификатов.Договор,
		|	ВременнаяТаблицаДвиженийСертификатов.СчетУчетаАвансовПокупателя,
		|	ВременнаяТаблицаДвиженийСертификатов.Заказ,
		|	ДокументДвижения.Ссылка,
		|	ВременнаяТаблицаДвиженийСертификатов.ВалютаДокумента,
		|	ВременнаяТаблицаДвиженийСертификатов.Операция,
		|	ВременнаяТаблицаДвиженийСертификатов.Период,
		|	ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаДвиженийСертификатов.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА &ВозникновениеАванса
		|		КОГДА ВременнаяТаблицаДвиженийСертификатов.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ТОГДА &СторнированиеАванса
		|		КОГДА ВременнаяТаблицаДвиженийСертификатов.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ТОГДА &ЗачетАванса
		|		КОГДА ВременнаяТаблицаДвиженийСертификатов.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА &ВосстановлениеАванса
		|	КОНЕЦ";
		
		Текст = СтрЗаменить(Текст, "&ВозникновениеАванса", """"+СодержанияПроводок.ВозникновениеАвансаПриПродажеПодарочногоСертификата()+"""");
		Текст = СтрЗаменить(Текст, "&СторнированиеАванса", """"+СодержанияПроводок.СторнированиеАвансаПриВозвратеПодарочногоСертификата()+"""");
		Текст = СтрЗаменить(Текст, "&ЗачетАванса", """"+СодержанияПроводок.ЗачетАвансаПриОплатеПодарочнымСертификтом()+"""");
		Текст = СтрЗаменить(Текст, "&ВосстановлениеАванса", """"+СодержанияПроводок.ВосстановлениеАвансаПриВозвратеПокупкиОплаченнойПодарочнымСертификтом()+"""");
		Текст = СтрЗаменить(Текст, "&ФиксироватьАванс", Формат(ТолькоПереносАванса, "БЛ=Ложь; БИ=Истина;"));
		
	Иначе
		Текст = "ВЫБРАТЬ
		|	ДатаВремя(1, 1, 1) КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	Значение(Справочник.Организации.ПустаяСсылка) КАК Организация,
		|	Значение(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
		|	Значение(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК Договор,
		|	НЕОПРЕДЕЛЕНО КАК Документ,
		|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК Заказ,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс) КАК ТипРасчетов,
		|	0 КАК Сумма,
		|	0 КАК СуммаВал,
		|	Значение(ПланСчетов.Управленческий.ПустаяСсылка) КАК СчетУчета,
		|	Значение(Справочник.Валюты.ПустаяСсылка) КАК Валюта,
		|	"""" КАК СодержаниеПроводки,
		|	0 КАК СуммаРег,
		|	0 КАК Курс,
		|	НЕОПРЕДЕЛЕНО КАК СпособЗачета,
		|	0 КАК Кратность,
		|	НЕОПРЕДЕЛЕНО КАК ДокументОплаты,
		|	0 КАК СуммаПлатежа,
		|	НЕОПРЕДЕЛЕНО КАК ВалютаПлатежа,
		|	0 КАК СуммаНДС,
		|	НЕОПРЕДЕЛЕНО КАК СтавкаНДС,
		|	Ложь КАК ЭтоОплатаЗаказа,
		|	Ложь КАК ОплатаСертификатом
		|Где
		|	Ложь";
	КонецЕсли;
	Возврат Текст;
КонецФункции

Функция ТекстЗапросаДвиженийУправлченческий(Знач СчетчикПервойТаблицы, ВыполнятьДвижения = Истина) Экспорт

	Если ВыполнятьДвижения И ПолучитьФункциональнуюОпцию("ИспользоватьПодарочныеСертификаты") Тогда	
		//Описание таблиц по порядку
		// Оплата подарочным сертификатом - зачет аванса на сумму товара
		// Возврат товара, оплаченного подарочным сертификатом - Сторно зачета аванса на сумму товара
		// Оплата подарочным сертификатом - сгорание баллов, если они остались не истраченными, и сертификат без частичного погашения
		// 		Возврата сгоревшего номинала не происходит, даже если вернули всю покупку целиком
		// Покупка подарочного сертификата - принятие аванса ровно (сумму номинала сертификата)
		// Возврат подарочного сертификата - Сторно принятия аванса ровно (сумму номинала сертификата)
		// Покупка подарочного сертификата - доход, если продали сертификат дороже номинала
		// Возврат подарочного сертификата - Сторно дохода, если продали сертификат дороже номинала
		// Покупка подарочного сертификата - затрата, если продали со скидкой
		// Возврат подарочного сертификата - Сторно затрата, если продали со скидкой
		
		Текст = 
		"ВЫБРАТЬ
		|	%1 КАК Порядок,
		|	ТаблицаУправленческий.НомерСтроки КАК НомерСтроки,
		|	ТаблицаУправленческий.Период КАК Период,
		|	ТаблицаУправленческий.Организация КАК Организация,
		|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
		|	ТаблицаУправленческий.СчетУчетаАвансовПокупателя КАК СчетДт,
		|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
		|	0 КАК СуммаВалДт,
		|	ТаблицаУправленческий.СчетУчетаДенежныхСредств КАК СчетКт,
		|	ВЫБОР
		|		КОГДА ТаблицаУправленческий.СчетУчетаДенежныхСредств.Валютный
		|			ТОГДА ТаблицаУправленческий.ВалютаДокумента
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ВалютаКт,
		|	ВЫБОР
		|		КОГДА ТаблицаУправленческий.СчетУчетаДенежныхСредств.Валютный
		|			ТОГДА ТаблицаУправленческий.СуммаВалДвиженияПоРасчетам
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВалКт,
		|	ТаблицаУправленческий.СуммаДвиженияПоРасчетам КАК Сумма,
		|	&ЗачетАванса КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаДвиженийСертификатов КАК ТаблицаУправленческий
		|ГДЕ
		|	ТаблицаУправленческий.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ТаблицаУправленческий.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И НЕ ТаблицаУправленческий.СуммаДвиженияПоРасчетам = 0 
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	%2,
		|	ТаблицаУправленческий.НомерСтроки,
		|	ТаблицаУправленческий.Период,
		|	ТаблицаУправленческий.Организация,
		|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
		|	ТаблицаУправленческий.СчетУчетаАвансовПокупателя,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	ТаблицаУправленческий.СчетУчетаДенежныхСредств КАК СчетУчетаДенежныхСредств,
		|	ВЫБОР
		|		КОГДА ТаблицаУправленческий.СчетУчетаДенежныхСредств.Валютный
		|			ТОГДА ТаблицаУправленческий.ВалютаДокумента
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТаблицаУправленческий.СчетУчетаДенежныхСредств.Валютный
		|			ТОГДА -ТаблицаУправленческий.СуммаВалДвиженияПоРасчетам
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	-ТаблицаУправленческий.СуммаДвиженияПоРасчетам,
		|	&ЗачетАвансаСторно
		|ИЗ
		|	ВременнаяТаблицаДвиженийСертификатов КАК ТаблицаУправленческий
		|ГДЕ
		|	ТаблицаУправленческий.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ТаблицаУправленческий.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И НЕ ТаблицаУправленческий.СуммаДвиженияПоРасчетам = 0 
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	%3,
		|	ТаблицаУправленческий.НомерСтроки,
		|	ТаблицаУправленческий.Период,
		|	ТаблицаУправленческий.Организация,
		|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
		|	ТаблицаУправленческий.СчетУчетаАвансовПокупателя,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы),
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	ТаблицаУправленческий.СуммаДоходаОтРазницыСНоминалом,
		|	&ДоходОтСписанияАванса
		|ИЗ
		|	ВременнаяТаблицаДвиженийСертификатов КАК ТаблицаУправленческий
		|ГДЕ
		|	ТаблицаУправленческий.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ТаблицаУправленческий.СуммаДоходаОтРазницыСНоминалом > 0
		|	И ТаблицаУправленческий.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	%5,
		|	ТаблицаУправленческий.НомерСтроки,
		|	ТаблицаУправленческий.Период,
		|	ТаблицаУправленческий.Организация,
		|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
		|	ТаблицаУправленческий.СчетУчетаДенежныхСредств,
		|	ВЫБОР
		|		КОГДА ТаблицаУправленческий.СчетУчетаДенежныхСредств.Валютный
		|			ТОГДА ТаблицаУправленческий.ВалютаДокумента
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТаблицаУправленческий.СчетУчетаДенежныхСредств.Валютный
		|			ТОГДА ТаблицаУправленческий.СуммаВалДвиженияПоНоминалу - ТаблицаУправленческий.СуммаВалРасходаОтРазницыСНоминалом
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ТаблицаУправленческий.СчетУчетаАвансовПокупателя,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	ТаблицаУправленческий.СуммаДвиженияПоНоминалу - ТаблицаУправленческий.СуммаРасходаОтРазницыСНоминалом,
		|	&ВозникновениеАвансаПокупателя
		|ИЗ
		|	ВременнаяТаблицаДвиженийСертификатов КАК ТаблицаУправленческий
		|ГДЕ
		|	ТаблицаУправленческий.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ТаблицаУправленческий.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ТаблицаУправленческий.СуммаДвиженияПоНоминалу > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	%6,
		|	ТаблицаУправленческий.НомерСтроки,
		|	ТаблицаУправленческий.Период,
		|	ТаблицаУправленческий.Организация,
		|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
		|	ТаблицаУправленческий.СчетУчетаДенежныхСредств,
		|	ВЫБОР
		|		КОГДА ТаблицаУправленческий.СчетУчетаДенежныхСредств.Валютный
		|			ТОГДА ТаблицаУправленческий.ВалютаДокумента
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТаблицаУправленческий.СчетУчетаДенежныхСредств.Валютный
		|			ТОГДА -(ТаблицаУправленческий.СуммаВалДвиженияПоНоминалу - ТаблицаУправленческий.СуммаВалРасходаОтРазницыСНоминалом)
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ТаблицаУправленческий.СчетУчетаАвансовПокупателя,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	-(ТаблицаУправленческий.СуммаДвиженияПоНоминалу - ТаблицаУправленческий.СуммаРасходаОтРазницыСНоминалом),
		|	&ВозникновениеАвансаПокупателяСторно
		|ИЗ
		|	ВременнаяТаблицаДвиженийСертификатов КАК ТаблицаУправленческий
		|ГДЕ
		|	ТаблицаУправленческий.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ТаблицаУправленческий.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ТаблицаУправленческий.СуммаДвиженияПоНоминалу > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	%7,
		|	ТаблицаУправленческий.НомерСтроки,
		|	ТаблицаУправленческий.Период,
		|	ТаблицаУправленческий.Организация,
		|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
		|	ТаблицаУправленческий.СчетУчетаДенежныхСредств,
		|	ВЫБОР
		|		КОГДА ТаблицаУправленческий.СчетУчетаДенежныхСредств.Валютный
		|			ТОГДА ТаблицаУправленческий.ВалютаДокумента
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТаблицаУправленческий.СчетУчетаДенежныхСредств.Валютный
		|			ТОГДА ТаблицаУправленческий.СуммаВалДоходаОтРазницыСНоминалом
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы),
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	ТаблицаУправленческий.СуммаДоходаОтРазницыСНоминалом,
		|	&ДоходПродажиСертификатаСНаценкой
		|ИЗ
		|	ВременнаяТаблицаДвиженийСертификатов КАК ТаблицаУправленческий
		|ГДЕ
		|	ТаблицаУправленческий.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ТаблицаУправленческий.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ТаблицаУправленческий.СуммаДоходаОтРазницыСНоминалом > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	%8,
		|	ТаблицаУправленческий.НомерСтроки,
		|	ТаблицаУправленческий.Период,
		|	ТаблицаУправленческий.Организация,
		|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
		|	ТаблицаУправленческий.СчетУчетаДенежныхСредств,
		|	ВЫБОР
		|		КОГДА ТаблицаУправленческий.СчетУчетаДенежныхСредств.Валютный
		|			ТОГДА ТаблицаУправленческий.ВалютаДокумента
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТаблицаУправленческий.СчетУчетаДенежныхСредств.Валютный
		|			ТОГДА -ТаблицаУправленческий.СуммаВалДоходаОтРазницыСНоминалом
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы),
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	-ТаблицаУправленческий.СуммаДоходаОтРазницыСНоминалом,
		|	&ДоходПродажиСертификатаСНаценкойСторно
		|ИЗ
		|	ВременнаяТаблицаДвиженийСертификатов КАК ТаблицаУправленческий
		|ГДЕ
		|	ТаблицаУправленческий.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ТаблицаУправленческий.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ТаблицаУправленческий.СуммаДоходаОтРазницыСНоминалом > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	%9,
		|	ТаблицаУправленческий.НомерСтроки,
		|	ТаблицаУправленческий.Период,
		|	ТаблицаУправленческий.Организация,
		|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
		|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы),
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	ТаблицаУправленческий.СчетУчетаАвансовПокупателя,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	ТаблицаУправленческий.СуммаРасходаОтРазницыСНоминалом,
		|	&РахсодПродажаСертификатаСоСкидкой
		|ИЗ
		|	ВременнаяТаблицаДвиженийСертификатов КАК ТаблицаУправленческий
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСертификата
		|		ПО (НоменклатураСертификата.Ссылка = ТаблицаУправленческий.ПодарочныйСертификат)
		|ГДЕ
		|	ТаблицаУправленческий.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ТаблицаУправленческий.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ТаблицаУправленческий.СуммаРасходаОтРазницыСНоминалом > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	%10,
		|	ТаблицаУправленческий.НомерСтроки,
		|	ТаблицаУправленческий.Период,
		|	ТаблицаУправленческий.Организация,
		|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
		|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы),
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	ТаблицаУправленческий.СчетУчетаАвансовПокупателя,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	-ТаблицаУправленческий.СуммаРасходаОтРазницыСНоминалом,
		|	&РахсодПродажаСертификатаСоСкидкойСторно
		|ИЗ
		|	ВременнаяТаблицаДвиженийСертификатов КАК ТаблицаУправленческий
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСертификата
		|		ПО (НоменклатураСертификата.Ссылка = ТаблицаУправленческий.ПодарочныйСертификат)
		|ГДЕ
		|	ТаблицаУправленческий.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ТаблицаУправленческий.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ТаблицаУправленческий.СуммаРасходаОтРазницыСНоминалом > 0";
		Текст = СтрШаблон(Текст, СчетчикПервойТаблицы, 
										СчетчикПервойТаблицы+1,
										СчетчикПервойТаблицы+2,
										СчетчикПервойТаблицы+3, 
										СчетчикПервойТаблицы+4,
										СчетчикПервойТаблицы+5,
										СчетчикПервойТаблицы+6,
										СчетчикПервойТаблицы+7, 
										СчетчикПервойТаблицы+8,
										СчетчикПервойТаблицы+9);
		Текст = СтрЗаменить(Текст,"&ЗачетАванса", """" + СодержанияПроводок.ЗачетАвансаПриОплатеПодарочнымСертификтом() + """");
		Текст = СтрЗаменить(Текст,"&ЗачетАвансаСторно", """Сторно " + СодержанияПроводок.ЗачетАвансаПриОплатеПодарочнымСертификтом() + """");
		Текст = СтрЗаменить(Текст,"&ДоходОтСписанияАванса", """" + СодержанияПроводок.СгораниеПодарочногоСертификата() + """");
		Текст = СтрЗаменить(Текст,"&ДоходОтСписанияАвансаСторно", """Сторно " + СодержанияПроводок.СгораниеПодарочногоСертификата() + """");
		Текст = СтрЗаменить(Текст,"&ВозникновениеАвансаПокупателя", """" + СодержанияПроводок.ВозникновениеАвансаПриПродажеПодарочногоСертификата() + """");
		Текст = СтрЗаменить(Текст,"&ВозникновениеАвансаПокупателяСторно", """Сторно " + СодержанияПроводок.ВозникновениеАвансаПриПродажеПодарочногоСертификата() + """");
		Текст = СтрЗаменить(Текст,"&ДоходПродажиСертификатаСНаценкой", """" + СодержанияПроводок.НаценкаКНоминалуПодарочногоСертификата() + """");
		Текст = СтрЗаменить(Текст,"&ДоходПродажиСертификатаСНаценкойСторно", """Сторно " + СодержанияПроводок.НаценкаКНоминалуПодарочногоСертификата() + """");
		Текст = СтрЗаменить(Текст,"&РахсодПродажаСертификатаСоСкидкой", """" + СодержанияПроводок.СкидкаПриПродажеПодарочногоСертификата() + """");
		Текст = СтрЗаменить(Текст,"&РахсодПродажаСертификатаСоСкидкойСторно", """Сторно " + СодержанияПроводок.СкидкаПриПродажеПодарочногоСертификата() + """");
	Иначе
		Текст = "ВЫБРАТЬ
		|	0 КАК Порядок,
		|	0 КАК НомерСтроки,
		|	ДатаВремя(1, 1, 1) КАК Период,
		|	Значение(Справочник.Организации.ПустаяСсылка) КАК Организация,
		|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
		|	Значение(ПланСчетов.Управленческий.ПустаяСсылка) КАК СчетДт,
		|	Значение(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
		|	0 КАК СуммаВалДт,
		|	Значение(ПланСчетов.Управленческий.ПустаяСсылка) КАК СчетКт,
		|	Значение(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
		|	0 КАК СуммаВалКт,
		|	0 КАК Сумма,
		|	"""" КАК Содержание
		|Где
		|	Ложь";
	КонецЕсли;
		
	Возврат Текст;
КонецФункции

Функция ТекстЗапросаДвиженийДоходыИРасходы(Знач СчетчикПервойТаблицы, ВыполнятьДвижения = Истина) Экспорт
	
	Если ВыполнятьДвижения И ПолучитьФункциональнуюОпцию("ИспользоватьПодарочныеСертификаты") Тогда	
		
		Текст = "ВЫБРАТЬ
		|	%1 КАК Порядок,
		|	0 КАК НомерСтроки,
		|	ВременнаяТаблицаДвиженийСертификатов.Период КАК Период,
		|	ВременнаяТаблицаДвиженийСертификатов.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Подразделение КАК СтруктурнаяЕдиница,
		|	Неопределено КАК Проект,
		|	ВременнаяТаблицаДвиженийСертификатов.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ВременнаяТаблицаДвиженийСертификатов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя,
		|	Выбор Когда ВременнаяТаблицаДвиженийСертификатов.СуммаДоходаОтРазницыСНоминалом > 0
		|		Тогда Значение(ПланСчетов.Управленческий.ПрочиеДоходы)
		|		Иначе Значение(ПланСчетов.Управленческий.ПрочиеРасходы)
		|	Конец КАК СчетУчета,
		|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка) КАК Аналитика,
		|	Выбор Когда ВременнаяТаблицаДвиженийСертификатов.СуммаДоходаОтРазницыСНоминалом > 0
		|		Тогда ВЫРАЗИТЬ(&ОтражениеДоходов КАК СТРОКА(100))
		|		Иначе ВЫРАЗИТЬ(&ОтражениеРасходов КАК СТРОКА(100))
		|	Конец КАК СодержаниеПроводки,
		|	СУММА(ВременнаяТаблицаДвиженийСертификатов.СуммаДоходаОтРазницыСНоминалом) КАК СуммаДоходов,
		|	СУММА(ВременнаяТаблицаДвиженийСертификатов.СуммаРасходаОтРазницыСНоминалом) КАК СуммаРасходов,
		|	СУММА(ВременнаяТаблицаДвиженийСертификатов.СуммаДоходаОтРазницыСНоминалом +
		|		ВременнаяТаблицаДвиженийСертификатов.СуммаРасходаОтРазницыСНоминалом) КАК Сумма
		|ИЗ
		|	ВременнаяТаблицаДвиженийСертификатов КАК ВременнаяТаблицаДвиженийСертификатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ВременнаяТаблицаДвиженийСертификатов.Ссылка = ВременнаяТаблицаШапка.Ссылка
		|ГДЕ
		|	ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ВременнаяТаблицаДвиженийСертификатов.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И НЕ ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоРасчетам = ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоНоминалу
		|	
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаДвиженийСертификатов.Период,
		|	ВременнаяТаблицаДвиженийСертификатов.Организация,
		|	ВременнаяТаблицаШапка.Подразделение, 
		|	ВременнаяТаблицаДвиженийСертификатов.НаправлениеДеятельности,
		|	ВременнаяТаблицаДвиженийСертификатов.ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка),
		|	Выбор Когда ВременнаяТаблицаДвиженийСертификатов.СуммаДоходаОтРазницыСНоминалом > 0
		|		Тогда ВЫРАЗИТЬ(&ОтражениеДоходов КАК СТРОКА(100))
		|		Иначе ВЫРАЗИТЬ(&ОтражениеРасходов КАК СТРОКА(100))
		|	Конец,
		|	Выбор Когда ВременнаяТаблицаДвиженийСертификатов.СуммаДоходаОтРазницыСНоминалом > 0
		|		Тогда Значение(ПланСчетов.Управленческий.ПрочиеДоходы)
		|		Иначе Значение(ПланСчетов.Управленческий.ПрочиеРасходы)
		|	Конец
		|
		|Объединить все
		|
		|ВЫБРАТЬ
		|	%2,
		|	0,
		|	ВременнаяТаблицаДвиженийСертификатов.Период,
		|	ВременнаяТаблицаДвиженийСертификатов.Организация,
		|	ВременнаяТаблицаШапка.Подразделение,
		|	Неопределено,
		|	ВременнаяТаблицаДвиженийСертификатов.НаправлениеДеятельности,
		|	ВременнаяТаблицаДвиженийСертификатов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка),
		|	Выбор Когда ВременнаяТаблицаДвиженийСертификатов.СуммаДоходаОтРазницыСНоминалом > 0
		|		Тогда Значение(ПланСчетов.Управленческий.ПрочиеДоходы)
		|		Иначе Значение(ПланСчетов.Управленческий.ПрочиеРасходы)
		|	Конец,
		|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка),
		|	Выбор Когда ВременнаяТаблицаДвиженийСертификатов.СуммаДоходаОтРазницыСНоминалом > 0
		|		Тогда ВЫРАЗИТЬ(&СторноОтражениеДоходов КАК СТРОКА(100))
		|		Иначе ВЫРАЗИТЬ(&СторноОтражениеРасходов КАК СТРОКА(100))
		|	Конец,
		|	-СУММА(ВременнаяТаблицаДвиженийСертификатов.СуммаДоходаОтРазницыСНоминалом),
		|	-СУММА(ВременнаяТаблицаДвиженийСертификатов.СуммаРасходаОтРазницыСНоминалом),
		|	-СУММА(ВременнаяТаблицаДвиженийСертификатов.СуммаДоходаОтРазницыСНоминалом +
		|		ВременнаяТаблицаДвиженийСертификатов.СуммаРасходаОтРазницыСНоминалом)
		|ИЗ
		|	ВременнаяТаблицаДвиженийСертификатов КАК ВременнаяТаблицаДвиженийСертификатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ВременнаяТаблицаДвиженийСертификатов.Ссылка = ВременнаяТаблицаШапка.Ссылка
		|ГДЕ
		|	ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И НЕ
		|		ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоРасчетам = ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоНоминалу
		|	
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаДвиженийСертификатов.Период,
		|	ВременнаяТаблицаДвиженийСертификатов.Организация,
		|	ВременнаяТаблицаШапка.Подразделение,
		|	ВременнаяТаблицаДвиженийСертификатов.НаправлениеДеятельности,
		|	ВременнаяТаблицаДвиженийСертификатов.ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка),
		|	Выбор Когда ВременнаяТаблицаДвиженийСертификатов.СуммаДоходаОтРазницыСНоминалом > 0
		|		Тогда ВЫРАЗИТЬ(&СторноОтражениеДоходов КАК СТРОКА(100))
		|		Иначе ВЫРАЗИТЬ(&СторноОтражениеРасходов КАК СТРОКА(100))
		|	Конец,
		|	Выбор Когда ВременнаяТаблицаДвиженийСертификатов.СуммаДоходаОтРазницыСНоминалом > 0
		|		Тогда Значение(ПланСчетов.Управленческий.ПрочиеДоходы)
		|		Иначе Значение(ПланСчетов.Управленческий.ПрочиеРасходы)
		|	Конец
		|
		|Объединить все
		|
		|ВЫБРАТЬ
		|	%3,
		|	0,
		|	ВременнаяТаблицаДвиженийСертификатов.Период,
		|	ВременнаяТаблицаДвиженийСертификатов.Организация,
		|	ВременнаяТаблицаШапка.Подразделение,
		|	Неопределено,
		|	ВременнаяТаблицаДвиженийСертификатов.НаправлениеДеятельности,
		|	ВременнаяТаблицаДвиженийСертификатов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка),
		|	Значение(ПланСчетов.Управленческий.ПрочиеДоходы),
		|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка),
		|	ВЫРАЗИТЬ(&ОтражениеДоходов КАК СТРОКА(100)),
		|	СУММА(ВременнаяТаблицаДвиженийСертификатов.СуммаДоходаОтРазницыСНоминалом),
		|	0,
		|	СУММА(ВременнаяТаблицаДвиженийСертификатов.СуммаДоходаОтРазницыСНоминалом)
		|ИЗ
		|	ВременнаяТаблицаДвиженийСертификатов КАК ВременнаяТаблицаДвиженийСертификатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ВременнаяТаблицаДвиженийСертификатов.Ссылка = ВременнаяТаблицаШапка.Ссылка
		|ГДЕ
		|	ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ВременнаяТаблицаДвиженийСертификатов.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И НЕ
		|		ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоРасчетам = ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоНоминалу
		|	
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаДвиженийСертификатов.Период,
		|	ВременнаяТаблицаДвиженийСертификатов.Организация,
		|	ВременнаяТаблицаШапка.Подразделение,
		|	ВременнаяТаблицаДвиженийСертификатов.НаправлениеДеятельности,
		|	ВременнаяТаблицаДвиженийСертификатов.ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка),
		|	ВЫРАЗИТЬ(&ОтражениеДоходов КАК СТРОКА(100)),
		|	Значение(ПланСчетов.Управленческий.ПрочиеДоходы)
		|
		|Объединить все
		|
		|ВЫБРАТЬ
		|	%4,
		|	0,
		|	ВременнаяТаблицаДвиженийСертификатов.Период,
		|	ВременнаяТаблицаДвиженийСертификатов.Организация,
		|	ВременнаяТаблицаШапка.Подразделение,
		|	Неопределено,
		|	ВременнаяТаблицаДвиженийСертификатов.НаправлениеДеятельности,
		|	ВременнаяТаблицаДвиженийСертификатов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка),
		|	Значение(ПланСчетов.Управленческий.ПрочиеДоходы),
		|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка),
		|	ВЫРАЗИТЬ(&СторноОтражениеДоходов КАК СТРОКА(100)),
		|	-СУММА(ВременнаяТаблицаДвиженийСертификатов.СуммаДоходаОтРазницыСНоминалом),
		|	0,
		|	-СУММА(ВременнаяТаблицаДвиженийСертификатов.СуммаДоходаОтРазницыСНоминалом)
		|ИЗ
		|	ВременнаяТаблицаДвиженийСертификатов КАК ВременнаяТаблицаДвиженийСертификатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ВременнаяТаблицаДвиженийСертификатов.Ссылка = ВременнаяТаблицаШапка.Ссылка
		|ГДЕ
		|	ВременнаяТаблицаДвиженийСертификатов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ВременнаяТаблицаДвиженийСертификатов.Операция = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И НЕ
		|		ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоРасчетам = ВременнаяТаблицаДвиженийСертификатов.СуммаДвиженияПоНоминалу
		|	
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаДвиженийСертификатов.Период,
		|	ВременнаяТаблицаДвиженийСертификатов.Организация,
		|	ВременнаяТаблицаШапка.Подразделение,
		|	ВременнаяТаблицаДвиженийСертификатов.НаправлениеДеятельности,
		|	ВременнаяТаблицаДвиженийСертификатов.ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка),
		|	ВЫРАЗИТЬ(&ОтражениеДоходов КАК СТРОКА(100)),
		|	Значение(ПланСчетов.Управленческий.ПрочиеДоходы)
		|";
		Текст = СтрШаблон(Текст, 	СчетчикПервойТаблицы,
									СчетчикПервойТаблицы + 1,
									СчетчикПервойТаблицы + 2,
									СчетчикПервойТаблицы + 3);
		Текст = СтрЗаменить(Текст,"&ОтражениеДоходов", 			"""" + СодержанияПроводок.ОтражениеДоходов() + """");
		Текст = СтрЗаменить(Текст,"&СторноОтражениеДоходов", 	"""Сторно " + СодержанияПроводок.ОтражениеДоходов() + """");
		Текст = СтрЗаменить(Текст,"&ОтражениеРасходов", 		"""" + СодержанияПроводок.ОтражениеРасходов() + """");
		Текст = СтрЗаменить(Текст,"&СторноОтражениеРасходов", 	"""Сторно " + СодержанияПроводок.ОтражениеРасходов() + """");
	Иначе
		Текст = "ВЫБРАТЬ
		|	0 КАК Порядок,
		|	0 КАК НомерСтроки,
		|	ДатаВремя(1, 1, 1) КАК Период,
		|	Значение(Справочник.Организации.ПустаяСсылка) КАК Организация,
		|	Значение(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) КАК СтруктурнаяЕдиница,
		|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка) КАК НаправлениеДеятельности,
		|	Неопределено КАК Проект,
		|	Значение(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя,
		|	Значение(ПланСчетов.Управленческий.ПустаяСсылка) КАК СчетУчета,
		|	ЗНАЧЕНИЕ(Справочник.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация,		
		|	НЕОПРЕДЕЛЕНО КАК Аналитика,
		|	"""" КАК СодержаниеПроводки,
		|	0 КАК СуммаДоходов,
		|	0 КАК СуммаРасходов,
		|	0 КАК Сумма
		|Где
		|	Ложь";
	КонецЕсли;
	Возврат Текст;
КонецФункции

Функция ТекстЗапросаДвиженийЗапасыОприходованиеДляПовторнойПродажи(ВыполнятьДвижения = Истина) Экспорт
	
	Если ВыполнятьДвижения И ПолучитьФункциональнуюОпцию("ИспользоватьПодарочныеСертификаты") Тогда	
		Текст = 
		"ВЫБРАТЬ
		|	ТаблицаЗапасы.Ссылка КАК Ссылка,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ТаблицаЗапасы.Период КАК Период,
		|	ТаблицаЗапасы.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ПараметрыСклада.ОрдерныйСклад КАК ОрдерныйСклад,
		|	Выбор
		|		когда ПараметрыСклада.УчетОстатковПоЯчейкам
		|			Тогда ПараметрыСклада.ЯчейкаПолучателяПеремещения
		|		ИНАЧЕ Значение(Справочник.Ячейки.ПустаяСсылка)
		|	Конец КАК Ячейка,
		|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
		|	ВЫБОР
		|		КОГДА ПараметрыСклада.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
		|		ИЛИ ПараметрыСклада.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
		|		ИЛИ ПараметрыСклада.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
		|			ТОГДА ПараметрыСертификата.СчетУчетаЗапасов
		|		ИНАЧЕ ПараметрыСертификата.СчетУчетаЗатрат
		|	КОНЕЦ КАК СчетУчета,
		|	ТаблицаЗапасы.ПодарочныйСертификат КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
		|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка) КАК Партия,
		|	ТаблицаЗапасы.НомерСертификата КАК Серия,
		|	ИСТИНА КАК ФиксированнаяСтоимость,
		|	0 КАК Сумма,
		|	0 КАК СуммаБезНДС,
		|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет) КАК ВидДвиженияУправленческий,
		|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка) КАК СтранаПроисхождения,
		|	ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка) КАК НомерГТД,
		|	&ОприходованиеЗапасов КАК СодержаниеПроводки
		|ИЗ
		|	ВременнаяТаблицаДвиженийСертификатов КАК ТаблицаЗапасы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ПараметрыСертификата
		|		ПО ТаблицаЗапасы.ПодарочныйСертификат = ПараметрыСертификата.Ссылка
		|		И ПараметрыСертификата.ПриходоватьПодарочныйСертификатПриОплате
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ТаблицаЗапасы.Ссылка = ВременнаяТаблицаШапка.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК ПараметрыСклада
		|		ПО ВременнаяТаблицаШапка.СтруктурнаяЕдиница = ПараметрыСклада.Ссылка
		|ГДЕ
		|	ТаблицаЗапасы.СертификатПогашенПолностью
		|	И НЕ ТаблицаЗапасы.СуммаДвиженияПоРасчетам = 0";
		Текст = СтрЗаменить(Текст,"&ОприходованиеЗапасов", """" + СодержанияПроводок.ОприходованиеЗапасов() + """");
	Иначе
		Текст = 
		"ВЫБРАТЬ
		|	Неопределено КАК Ссылка,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДатаВремя(1, 1, 1) КАК Период,
		|	Значение(Справочник.Организации.ПустаяСсылка) КАК Организация,
		|	Значение(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) КАК СтруктурнаяЕдиница,
		|	Ложь КАК ОрдерныйСклад,
		|	Значение(Справочник.Ячейки.ПустаяСсылка) КАК Ячейка,
		|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
		|	Значение(ПланСчетов.Управленческий.ПустаяСсылка) КАК СчетУчета,
		|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
		|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
		|	Значение(Справочник.ПартииНоменклатуры.ПустаяСсылка) КАК Партия,
		|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
		|	Ложь КАК ФиксированнаяСтоимость,
		|	0 КАК Сумма,
		|	0 КАК СуммаБезНДС,
		|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет) КАК ВидДвиженияУправленческий,
		|	Значение(Справочник.СтраныМира.ПустаяСсылка) КАК СтранаПроисхождения,
		|	Значение(Справочник.НомераГТД.ПустаяСсылка) КАК НомерГТД,
		|	"""" КАК СодержаниеПроводки
		|Где
		|	Ложь";
	КонецЕсли;
	Возврат Текст;
КонецФункции
#КонецОбласти
