#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	Цвет = Новый ХранилищеЗначения(ОбъектКопирования.Цвет.Получить());
	ЦветФона = Новый ХранилищеЗначения(ОбъектКопирования.ЦветФона.Получить()); 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказовПокупателей") = Ложь Тогда
		
		ВидЗаказовОбъект = Справочники.ВидыЗаказовПокупателей.Основной.ПолучитьОбъект();
		
		СтрокаССостоянием = ВидЗаказовОбъект.ПорядокСостояний.Найти(Ссылка, "Состояние");
		
		Если СтрокаССостоянием <> Неопределено Тогда
			ВидЗаказовОбъект.ОбменДанными.Загрузка = Истина;
			ВидЗаказовОбъект.ПорядокСостояний.Удалить(СтрокаССостоянием);
			ВидЗаказовОбъект.Записать();
			ВидЗаказовОбъект.ОбменДанными.Загрузка = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли