
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Организация = ОрганизацияДокументаОснования(ПараметрКоманды);
	
	ПараметрыЗаказа = Новый Структура;
	ПараметрыЗаказа.Вставить("ДокументОснование", ПараметрКоманды);
	ПараметрыЗаказа.Вставить("ТипГрузоперевозки", СервисДоставкиКлиентСервер.ТипГрузоперевозкиСервис1СДоставка());
	ПараметрыЗаказа.Вставить("ОрганизацияБизнесСети", Организация);
		
	СервисДоставкиКлиент.ОткрытьФормуКарточкиЗаказаНаДоставку(ПараметрыЗаказа);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОрганизацияДокументаОснования(ДокументОснование)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование,"Организация");
КонецФункции

#КонецОбласти