// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияБЭД.СброситьРазмерыИПоложениеОкна(ЭтотОбъект);
	СписокКоманд.Очистить();
	ШаблонПредставленияКоманды = НСтр("ru='Выбрать %1';");
	Для Каждого Тип Из Метаданные.ОпределяемыеТипы.Организация.Тип.Типы() Цикл
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(Тип);
		Если МетаданныеОбъекта = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СвойстваМетаданных = Новый Структура("ПредставлениеОбъекта, Синоним", "", "");
		ЗаполнитьЗначенияСвойств(СвойстваМетаданных, МетаданныеОбъекта);
		ВыбранноеИмя = ?(ЗначениеЗаполнено(СвойстваМетаданных.ПредставлениеОбъекта),
			СвойстваМетаданных.ПредставлениеОбъекта, СвойстваМетаданных.Синоним);
		Представление = СтрШаблон(ШаблонПредставленияКоманды, ПолучитьСклоненияСтроки(НРег(ВыбранноеИмя), ,
			"ПД=Винительный;")[0]);
		СписокКоманд.Добавить(Тип, Представление);
	КонецЦикла;
	Для Каждого Тип Из Метаданные.ОпределяемыеТипы.КонтрагентБЭД.Тип.Типы() Цикл
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(Тип);
		Если МетаданныеОбъекта = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СвойстваМетаданных = Новый Структура("ПредставлениеОбъекта, Синоним", "", "");
		ЗаполнитьЗначенияСвойств(СвойстваМетаданных, МетаданныеОбъекта);
		ВыбранноеИмя = ?(ЗначениеЗаполнено(СвойстваМетаданных.ПредставлениеОбъекта),
			СвойстваМетаданных.ПредставлениеОбъекта, СвойстваМетаданных.Синоним);
		Представление = СтрШаблон(ШаблонПредставленияКоманды, ПолучитьСклоненияСтроки(НРег(ВыбранноеИмя), ,
			"ПД=Винительный;")[0]);
		СписокКоманд.Добавить(Тип, Представление);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИНННачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбработчикКоманды = Новый ОписаниеОповещения("ВыполнитьКомандуВыбора", ЭтотОбъект);
	ПоказатьВыборИзМеню(ОбработчикКоманды, СписокКоманд);
КонецПроцедуры

&НаКлиенте
Процедура ИННАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если Ожидание > 0 И ЗначениеЗаполнено(Текст) Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = МашиночитаемыеДоверенностиВызовСервера.ДанныеВыбораСубъекта(Текст, СписокКоманд);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИННОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ВыбранноеЗначение = ПолучитьИНН(ВыбранноеЗначение);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	Если ПроверитьЗаполнение() Тогда
		Закрыть(Новый Структура("ИННДоверителя, НомерДоверенности", ИНН, НомерДоверенности));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьИНН(Знач Ссылка)
	ИмяРеквизитаИНН = "";
	Если ИнтеграцияЭДО.ЭтоОрганизация(Ссылка) Тогда
		ИмяРеквизитаИНН = ЭлектронноеВзаимодействие.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("ИННОрганизации");
	ИначеЕсли ИнтеграцияЭДО.ЭтоКонтрагент(Ссылка) Тогда
		ИмяРеквизитаИНН = ЭлектронноеВзаимодействие.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("ИННКонтрагента");
	КонецЕсли;
	Если ЗначениеЗаполнено(ИмяРеквизитаИНН) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизитаИНН);
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

// Параметры:
//  ВыбранноеЗначение - ЭлементСпискаЗначений:
//  * Значение - Тип
//  ДополнительныеПараметры - Неопределено
&НаКлиенте
Процедура ВыполнитьКомандуВыбора(ВыбранноеЗначение, ДополнительныеПараметры = Неопределено) Экспорт
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ЭлементСпискаЗначений") Тогда
		ОбработчикЗавершенияВыбора = Новый ОписаниеОповещения("ВыбратьУчастникаЗавершение", ЭтотОбъект);
		ПоказатьВводЗначения(ОбработчикЗавершенияВыбора, Неопределено, "", ВыбранноеЗначение.Значение);
	КонецЕсли;
КонецПроцедуры

// Параметры:
//  ВыбранноеЗначение - ОпределяемыйТип.Организация
//                    - ОпределяемыйТип.КонтрагентБЭД
//  ДополнительныеПараметры - Неопределено - Дополнительные параметры
&НаКлиенте
Процедура ВыбратьУчастникаЗавершение(ВыбранноеЗначение, ДополнительныеПараметры = Неопределено) Экспорт
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ИНН = ПолучитьИНН(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
