

#Область ПрограммныйИнтерфейс

#Область Курьерика

// Дополняет массив типов документов, используемых в качестве оснований для заказов на доставку
// сервиса Курьерика.
//
// Параметры:
//	МассивТипов - Массив Из Тип - массив типов документов.
//
Процедура ПриОпределенииТиповДокументовОснованийКурьерика(МассивТипов) Экспорт
	
КонецПроцедуры

// Заполняет представление адреса склада
//
// Параметры:
//	Склад - ОпределяемыйТип.СкладСервисДоставки - элемент справочника
//	Адрес - Строка - представление адреса склада
//	
// Пример:
//  Адрес = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(Склад,
//		    Справочники.ВидыКонтактнойИнформации.АдресСклада)
//	
Процедура ЗаполнитьПредставлениеАдресаСклада(Склад, Адрес) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
