
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИмяНастройкиПользователей") Тогда 
		ИмяНастройкиПользователей = Параметры.ИмяНастройкиПользователей;
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяНастройкиПользователей) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			"ЗапомнитьВыбор", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			"ГруппаИнформацияПоВыборуВариантаОбработки", "Видимость", Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьТовар(Команда)
	
	ВариантОбработкиКодаМаркировки = 
		ПредопределенноеЗначение("Перечисление.ВариантыОбработкиКодаМаркировки.ДобавитьТоварВДокумент");
	ОбработатьВыбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПроверкиИПодбора(Команда)
	
	ВариантОбработкиКодаМаркировки = 
		ПредопределенноеЗначение("Перечисление.ВариантыОбработкиКодаМаркировки.ОткрытьФормуПроверкиИПодбора");
	ОбработатьВыбор();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыбор()
	
	Если ЗапомнитьВыбор Тогда
		ЗаписатьНовуюНастройку();
	КонецЕсли;
	Закрыть(ВариантОбработкиКодаМаркировки);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНовуюНастройку()
	
	Пользователь = Пользователи.ТекущийПользователь();
	НастройкаПользователя = ПланыВидовХарактеристик.НастройкиПользователей[ИмяНастройкиПользователей];
	
	НаборЗаписей = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Пользователь.Использование = Истина;
	НаборЗаписей.Отбор.Пользователь.Значение      = Пользователь;
	НаборЗаписей.Отбор.Настройка.Использование    = Истина;
	НаборЗаписей.Отбор.Настройка.Значение         = НастройкаПользователя;
	
	Запись = НаборЗаписей.Добавить();
	
	Запись.Пользователь = Пользователь;
	Запись.Настройка    = НастройкаПользователя;
	Запись.Значение = НастройкаПользователя.ТипЗначения.ПривестиЗначение(ВариантОбработкиКодаМаркировки);
	
	НаборЗаписей.Записать();
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти