// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// См. БлокировкаРаботыСВнешнимиРесурсамиПереопределяемый.ПриЗапретеРаботыСВнешнимиРесурсами
Процедура ПриЗапретеРаботыСВнешнимиРесурсами() Экспорт
	
	Отказ       = Ложь;
	Организации = БизнесСеть.ПодключенныеОрганизации().ВыгрузитьКолонку("Организация");
	
	БизнесСеть.ОтключитьОрганизации(Организации, Отказ);
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		Не Отказ,
		Нстр(
			"ru = 'Ошибка при отключении организаций'", 
			ОбщегоНазначения.КодОсновногоЯзыка()),
		"БизнесСетьСлужебный.ПриЗапретеРаботыСВнешнимиРесурсами");
	
КонецПроцедуры

#КонецОбласти
