// @strict-types
#Область СлужебныйПрограммныйИнтерфейс

#Область ОшибкиКриптографии

// Параметры:
//  Ошибка - См. ОбработкаНеисправностейБЭДКлиентСервер.НоваяОшибка
// 
// Возвращаемое значение:
//  Строка
Функция СформироватьМеченныйТекстОшибки(Ошибка) Экспорт
	Возврат СтрШаблон("%1
					  |#Метка: %2", Ошибка.ПодробноеПредставлениеОшибки, Ошибка.Идентификатор);
КонецФункции

// Параметры:
//  ТекстОшибкиБСП - Строка
//  ОшибкиБЭД - Массив Из См. ОбработкаНеисправностейБЭДКлиентСервер.НоваяОшибка
// 
// Возвращаемое значение:
//  Булево
Функция ВТекстеОшибкиБСПЕстьМеткаОшибкиБЭД(ТекстОшибкиБСП, ОшибкиБЭД) Экспорт
	Для Каждого Ошибка Из ОшибкиБЭД Цикл
		СтрокаПоиска = СтрШаблон("#Метка: %1", Ошибка.Идентификатор);
		Если СтрНайти(ТекстОшибкиБСП, СтрокаПоиска) > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

#КонецОбласти // ОшибкиКриптографии

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти