
#Область ПрограммныйИнтерфейс

// Функция показывает является ли текущая конфигурация конфигурацией УправлениеНебольшойФирмой
// 
// Параметры:
//  ОбластьДанных             - Число, Неопределено - номер области данных или Неопределено для неразделенных значений
//                                или при работе в коробке;
// Возвращаемое значение:
//  Булево - признак является ли текущая конфигурация конфигурацией УправлениеНебольшойФирмой
//
Функция ЭтоУНФ(ОбластьДанных = Неопределено) Экспорт
	
	Возврат ВозможностиПриложения.ЭтоУНФ(ОбластьДанных);
	
КонецФункции

// Функция показывает является ли текущая конфигурация конфигурацией Розница
// 
// Параметры:
//  ОбластьДанных             - Число, Неопределено - номер области данных или Неопределено для неразделенных значений
//                                или при работе в коробке;
// Возвращаемое значение:
//  Булево - признак является ли текущая конфигурация конфигурацией Розница
//
Функция ЭтоРозница(ОбластьДанных = Неопределено) Экспорт
	
	Возврат ВозможностиПриложения.ЭтоРозница(ОбластьДанных);
	
КонецФункции

#КонецОбласти
