
#Область СлужебныйПрограммныйИнтерфейс

// Параметры соединения к сервису.
//
// Параметры:
//  АдресСервиса - Строка - адрес сервиса "1С:Штамп".
// 
// Возвращаемое значение:
//  Структура - параметры соединения:
//   * Сервер - Строка - имя сервера.
//   * Порт - Число - порт соединения.
//   * Аутентификация - Булево - требуется аутентификация по токену.
//   * Таймаут - Число - длительность ожидания ответа в секундах.
//   * ЗащищенноеСоединение - ЗащищенноеСоединениеOpenSSL - объект защищенного соединения OpenSSL.
//                          - Неопределено - объект защищенного соединения не установлен.
//   * Прокси - ИнтернетПрокси - параметры прокси-сервера.
//
Функция ПараметрыСоединения(Знач АдресСервиса) Экспорт
	
	Возврат Интеграция1СШтампСлужебный.ПараметрыСоединения(АдресСервиса);

КонецФункции

#КонецОбласти