
#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбсужденияПередЗаписью(Источник, РежимЗаписи, РежимПроведения, ЛогироватьДействия) Экспорт
	
	Если Источник.ДополнительныеСвойства.Свойство("ГрупповаяЗагрузкаДанных") Тогда
		ЛогироватьДействия = Ложь;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ОбсуждениеЗаписано") Тогда
		ЛогироватьДействия = Ложь;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ЭтоЗаписьАссистентом") Тогда
		ЛогироватьДействия = Ложь;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ЗагрузкаПочты") Тогда
		ЛогироватьДействия = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОпределенииПроверяемыхРеквизитовОбъектаПередЗаписью() Экспорт
	
	
	
КонецПроцедуры

Процедура ПриПодготовкеОписанияИзмененийРеквизитовДокумента(СтруктураПроверяемыхРеквизитов, СтарыйОбъект, НовыйОбъект, СтрокиСообщения) Экспорт
	
	Если СтруктураПроверяемыхРеквизитов.Свойство("Договор")
		И СтруктураПроверяемыхРеквизитов.Свойство("Контрагент") Тогда
		
		Если СтарыйОбъект["Контрагент"] <> НовыйОбъект["Контрагент"] Тогда
			// Не выводить информацию об изменении договора, если в объекте был изменен контрагент.
			СтруктураПроверяемыхРеквизитов.Удалить("Договор");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти