#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.СервисEDI") Тогда
		ОбщийМодульНастройкиEDI = ОбщегоНазначения.ОбщийМодуль("НастройкиEDI");
		ОбщийМодульНастройкиEDI.УстановитьИспользованиеРегламентныхЗаданий();
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ТорговыеПредложения") Тогда
		
		ОбщийМодульТорговыеПредложенияСлужебный = ОбщегоНазначения.ОбщийМодуль("ТорговыеПредложенияСлужебный");
		ОбщийМодульТорговыеПредложенияСлужебный.ПриЗаписиКонстантыИспользоватьБизнесСеть(Значение);
		Если НЕ ВозможностиПриложения.КонстантаДоступнаВПриложении( "ИспользоватьПодсистемуТорговыеПредложения" ) Тогда
			Константы.ИспользоватьПодсистемуТорговыеПредложения.Установить(Значение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли