
#Область ПрограммныйИнтерфейс

// Возвращает через описание оповещения результат штампирования документа.
//
// Параметры:
//  ОписаниеОповещенияОВыполнении  - ОписаниеОповещения - Данные процедуры в которую необходимо вернуть результат
//                                      выполнения функции
//  ПараметрыДобавленияШтампов     - см. Интеграция1СШтампКлиентСервер.НовыеПараметрыДобавленияШтамповВДокумент
//  Таймаут - Число, Неопределено - Максимальное время ожидания получения результата выполнения задания из сервиса.
//                                    По умолчанию - 600 сек.
//  ПараметрыОжидания              - см. ДлительныеОперацииКлиент.ПараметрыОжидания
//  
// Пример:
// 
//  МассивШтампов = Новый Массив;
//	
//	МассивШтампов.Добавить(ДвоичныеДанныеШтампа);
//	ПараметрыШтампов = ПараметрыШтампов(МассивШтампов);
//	
//	ПараметрыДобавленияШтамповВДокумент = Интеграция1СШтампКлиентСервер.НовыеПараметрыДобавленияШтамповВДокумент();
//	
//	ПараметрыДобавленияШтамповВДокумент.ПараметрыДокумента.ДвоичныеДанные = ДвоичныеДанныеДокумента;
//	ПараметрыДобавленияШтамповВДокумент.ПараметрыДокумента.Расширение     = "pdf";
//	ПараметрыДобавленияШтамповВДокумент.ПараметрыШтампов                  = ПараметрыШтампов;
//	
//	ОписаниеОповещения = Новый ОписаниеОповещения("РезультатУстановкиШтамповВДокумент", ЭтотОбъект);
//	
//	Интеграция1СШтампКлиент.УстановитьШтампВДокумент(
//		ОписаниеОповещения,
//		ПараметрыДобавленияШтамповВДокумент,
//		600);
//
Процедура УстановитьШтампВДокумент(Знач ОписаниеОповещенияОВыполнении,
	 Знач ПараметрыДобавленияШтампов,
	 Знач Таймаут = Неопределено,
	 Знач ПараметрыОжидания = Неопределено) Экспорт
	
	// Асинхронный режим
	// Получаем результат проштамповки в 3 этапа:
	//  1. Отправляем запрос в сервис на добавление штампа. В сервисе формируется задание в очереди,
	//     которое будет выполнено в течение какого-то времни
	//  2. Отправляем запрос на получение статуса выполнения задания.
	//  3. Получаем результат выполнения задания. Результат отправляем в процедуру описания оповещения о выполнении.
	
	Интеграция1СШтампСлужебныйКлиент.УстановитьШтампВДокумент(ОписаниеОповещенияОВыполнении,
		ПараметрыДобавленияШтампов,
		Таймаут,
		ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти
