////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы (УНФ)
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииПодсистемы
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя = "УправлениеНебольшойФирмой";
	Описание.Версия = "3.0.10.235";
	Описание.ИдентификаторИнтернетПоддержки = "SmallBusiness";
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления 
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	#Область ПервыйЗапуск
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.0.1";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ПервыйЗапуск_РазделенныеДанные";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.0.1";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ПервыйЗапуск_ОбщиеДанные";
	Обработчик.ОбщиеДанные = Истина;
	
	#КонецОбласти
	
	#Область Обработчики_3_0_9
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.14";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьСтатусыСчетовФактурПоДокументамПередачиМеждуОрганизациями";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("21d13301-df9b-4c73-b8eb-dd2558803b15");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение статусов счетов-фактур по документам передачи между организациями'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.17";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьНаименованиеСокращенноеОрганизаций";
	Обработчик.Идентификатор       = Новый УникальныйИдентификатор("97a93dac-625d-4496-a9ca-b7bd82fa2aa1");
	Обработчик.Комментарий = НСтр("ru = 'Заполнить сокращенное наименований организаций'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.23";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ПереместитьШаблоныЧекаККМВНовыйСправочникИЗаменитьВКассахККМ";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("25d90cad-4f7f-4502-8d6d-8fd7337b18c2");
	Обработчик.Комментарий = НСтр("ru = 'Перенос шаблонов чека ККМ в новый справочник ""Хранилище шаблонов РМК"" и замена в справочнике ""Кассы ККМ""'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.49";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьПараметрыСчетаРасчетыССамозанятыми";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("f60e10bf-ebc2-43ff-bc1f-7c2181e119ee");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение параметров счета ""Расчеты с самозанятыми""'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.53";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьОтчеты_3_0_9";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("dd3df34d-9a2f-4f86-be70-4e3a2792e4ab");
	Обработчик.Комментарий = НСтр("ru = 'Обновление настроек вариантов отчетов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.66";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОперацииПодготовкиКРаботеСАкцизами";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("4c502d2e-d859-4419-a763-99293137cdad");
	Обработчик.Комментарий = НСтр("ru = 'Операции подготовки к работе с акцизами'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.67";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.НачальноеЗаполнение = Ложь;
	Обработчик.Процедура = "УчетПартийУСН.ВключитьИспользованиеСтарогоРегистра";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("6ba8d303-ec43-4c6b-bb26-ec3b76252031");
	Обработчик.Комментарий = НСтр("ru = 'Установка константы для использования устаревшего учета по партиям для КУДиР'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.67";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "Справочники.Лиды.ЗаполнитьЛидовПриПоявленииПовторныхЛидов";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("d1012526-cb72-4118-a7fe-2f32b34670f5");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение нового реквизита'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.67";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "Справочники.Лиды.ПоместитьЗавершенныеЛидыВКанбан";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("f1056830-65a7-4a84-ba53-040aeb8a3f65");
	Обработчик.Комментарий = НСтр("ru = 'Добавление завершенных лидов в канбан'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.67";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "Справочники.Лиды.ИзменитьФильтрЛидовПоРезультату";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("7fbc6518-8b9d-45cf-9651-7af34b769be0");
	Обработчик.Комментарий = НСтр("ru = 'Изменение фильтров в списке лидов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.78";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьКратностьСкидок";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("32ebde2f-18db-4190-a02a-b0040b0c0ab9");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение добавленных реквизитов скидок/наценок'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.82";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;           
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ПометитьНаУдалениеЗадачиВзносыИПДоходы";
	Обработчик.Комментарий = НСтр("ru = 'Пометить на удаление квартальные задачи взносы ИП ПСН и УСН Доходы.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.96";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьСлужебныеОпцииСостоянийЗаказов";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0d3a1c1a-6104-4ae3-92fd-66a795cce31c");
	Обработчик.Комментарий = НСтр("ru = 'Включить служебные опции команд состояний заказов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.173";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "Справочники.ВидыТарифовСтраховыхВзносовУНФ.ОписатьТарифы2025";
	Обработчик.Комментарий = НСтр("ru = 'Создать новые виды тарифов страховых взносов.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.173";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "РегистрыСведений.ТарифыСтраховыхВзносовУНФ.НачальноеЗаполнение";
	Обработчик.Комментарий = НСтр("ru = 'Установить новые тарифы страховых взносов'");
	
	#КонецОбласти
	
	#Область Обработчики_3_0_10
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.39";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьМакетыИПоляШаблоновЧека";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("1c641d92-690b-4ccc-8e31-ac3dcbcc271e");
	Обработчик.Комментарий = НСтр("ru = 'Обновление типового макета и полей шаблона в справочнике ""Хранилище шаблонов РМК""'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.44";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьСчетУчетаЛичныхСредствПредпринимателя";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("ff2fbd69-dd11-4c56-a7ed-2aefd772529b");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение счета учета личных средств предпринимателя.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.81";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "УчетАкцизовУНФ.ОбновитьСтавкиПоАлкогольнойПродукцииС01_05_2024";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("06e39a71-b177-4bac-a0b6-c63321d2e6b7");
	Обработчик.Комментарий = НСтр("ru = 'Обновление ставок акцизов алкогольной продукции с 01.05.2024'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.82";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьШаблоныСообщений";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("2c19d926-8ac9-4172-9922-8a3b4b538e97");
	Обработчик.Комментарий = НСтр(
		"ru = 'Обновить шаблоны сообщений для перехода на новый способ заполнения факсимиле в печатных формах.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.89";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ИнтеграцияОбменШтрихМ.АктуализироватьОпциюОбмена";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("e9c0e984-c11c-48c1-a2bc-ca56d456786a");
	Обработчик.Комментарий = НСтр("ru = 'Актуализация обмена Штрих-MPAY в зависимости от зарегистрированных касс'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.99";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьСлужебныеФункциональныеОпцииВозможностейПриложений";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("699a03f2-36b6-412a-9c20-a349b228c9a1");
	Обработчик.Комментарий = НСтр(
		"ru = 'Включить служебные функциональные опции возможностей приложений УНФ, Розница, Бизнес.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.104";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "СотрудникиУНФ.ЗаполнитьРазмерыВычетовНДФЛ";
	Обработчик.Комментарий = НСтр("ru = 'Установить размеры вычетов НДФЛ'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.112";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбъединитьДеревоСкидокИБонусов";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("bd3f8787-58d7-483e-a56f-3b4279513cdc");
	Обработчик.Комментарий = НСтр("ru = 'Объединение дерева скидок и начисления бонусов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.115";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗарегистрироватьИзмененияОбъектовСПредопределеннымиЭлементами";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("60e042d1-6e96-48cc-8a78-dc4e15d51ba7");
	Обработчик.Комментарий = НСтр("ru = 'Зарегистрировать изменения объектов с предопределенными элементами'");   
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.129";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьФункциональнуюОпциюУчетЦенПродажи";
	Обработчик.Комментарий = НСтр("ru = 'Установить значение функциональной опции учет цен продажи'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.135";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.СтавкиНДС.СоздатьСтавки_УСН2025";
	Обработчик.Комментарий = НСтр("ru = 'Создание 5% и 7% ставок НДС для использования в 2025 году'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.154";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "РегистрыСведений.МРОТ.НачальноеЗаполнение";
	Обработчик.Комментарий = НСтр("ru = 'Установить значение МРОТ для упр. учета'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.154";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "РегистрыСведений.ПредельнаяВеличинаБазыСтраховыхВзносовУНФ.УстановитьПредельнуюВеличинуБазыСтраховыхВзносов";
	Обработчик.Комментарий = НСтр("ru = 'Установить значение предельной величины базы страховых взносов для упр. учета'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.155";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "Справочники.КалендарьПодготовкиОтчетности.ЗагрузитьКалендарьПодготовкиОтчетности";
	Обработчик.Комментарий = НСтр("ru = 'Загрузить календарь подготовки отчетности на 2025 год'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "3.0.10.157"; 
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура           = "РегистрыСведений.РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСН.ЗаполнитьПоставляемыеДанные";
	Обработчик.НачальноеЗаполнение = Ложь; 

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия  = "3.0.10.166";
	Обработчик.Процедура = "РегистрыСведений.НастройкиУчетаУСН.ВключитьПризнаниеДоходаНаДатуОтчетаКомиссионера";
	Обработчик.Комментарий = НСтр("ru = 'Устанавливает порядок признания дохода УСН при осуществлении продаж через комиссионера по умолчанию.'");
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.171";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьСлужебнуюФункциональнуюОпциюИспользоватьСинхронизациюДанныхВПриложении";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("94f339ba-6b86-11eb-a3f7-b06ebf31a722");
	Обработчик.Комментарий = НСтр(
		"ru = 'Включить служебные функциональные опции возможностей приложений УНФ, Розница, Бизнес.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.171";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьСлужебнуюФункциональнуюОпциюОтображатьКомандуСменыПароля";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("967248ea-82cf-11e9-a3de-b06ebf31a722");
	Обработчик.Комментарий = НСтр(
		"ru = 'Включить служебную функциональныю опцию отображения команды смены пароля'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.171";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "Справочники.НастройкиПубликацииМЛК.ОбновитьПараметрыЗаданияВыполненияСинхронизации";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("90d8783e-9f3e-44ce-9c92-f23e98c4d17f");
	Обработчик.Комментарий = НСтр("ru = 'Обновление параметров задания синхронизации с 1С:Кабинет клиента.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.185";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "Справочники.ВидыТарифовСтраховыхВзносовУНФ.ОписатьТарифУчастникиТехнополиса";
	Обработчик.Комментарий = НСтр("ru = 'Создать новые виды тарифов страховых взносов.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.185";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "РегистрыСведений.ТарифыСтраховыхВзносовУНФ.НачальноеЗаполнение";
	Обработчик.Комментарий = НСтр("ru = 'Установить новые тарифы страховых взносов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.186";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "УчетАкцизовУНФ.ОбновитьСтавкиПоАкцизамС_01_01_2025";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("a4da2410-ccbe-429f-91c1-4de2fe2e6c28");
	Обработчик.Комментарий = НСтр("ru = 'Обновление ставок акцизов с 01.01.2025'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.187";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьСрокПоЗадаче6НДФЛ";
	Обработчик.Комментарий = НСтр("ru = 'Обновление срока годовой залачи 6-НДФЛ за 2025 год'");
		
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "3.0.10.192";
	Обработчик.Процедура           = "Справочники.ВидыНалогов.ЗаполнитьВидНалогаНДФЛ";    
	Обработчик.Комментарий = НСтр("ru = 'Заполнить вид налога НДФЛ.'");
	Обработчик.НачальноеЗаполнение  = Ложь;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.192";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьВидыНалоговПоНДФЛ_2025";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("214300d2-9510-4954-8d02-e950fc626a1f");
	Обработчик.Комментарий = НСтр("ru = 'Обработать виды налогов по НДФЛ по ставкам 2025 года.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.197";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьСлужебнуюВозможностьУправленияЗапасами";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("9d084259-1d24-47a8-bee4-426440c0e9c8");
	Обработчик.Комментарий = НСтр(
		"ru = 'Включить служебную функциональную опцию управления запасами в приложении'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.219";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "Справочники.КалендарьПодготовкиОтчетности.ЗагрузитьКалендарьПодготовкиОтчетности";
	Обработчик.Комментарий = НСтр("ru = 'Загрузить календарь подготовки отчетности на 2025 год'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "3.0.10.224";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура           = "ИнтеграцияБЗКБУНФ.ОбновитьНачисленияРКиСН";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("154cb282-c115-46e9-9e3f-ed2eb35ec5ce");
	Обработчик.Комментарий = НСтр("ru = 'Создать доли начислений Районный коэффициент и Северная надбавка'");
	Обработчик.НачальноеЗаполнение  = Ложь;
	
	#КонецОбласти
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПередОбновлениемИнформационнойБазы
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
	Возврат;
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПослеОбновленияИнформационнойБазы
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия, Знач ВыполненныеОбработчики,
	ВыводитьОписаниеОбновлений, Знач МонопольныйРежим) Экспорт
	
	Возврат;
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПриПодготовкеМакетаОписанияОбновлений
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	Возврат;
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковПереходаСДругойПрограммы
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
	Если СтрНачинаетсяС(Метаданные.Имя, "Розница") Тогда
		
		Обработчик = Обработчики.Добавить();
		Обработчик.ПредыдущееИмяКонфигурации = "Розница";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьСлужебныеФункциональныеОпцииВозможностейПриложений";
		
	Иначе
		
		Обработчик = Обработчики.Добавить();
		Обработчик.ПредыдущееИмяКонфигурации = "Розница";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновлениеРозницыДоУНФ";
		
		Обработчик = Обработчики.Добавить();
		Обработчик.ПредыдущееИмяКонфигурации = "РозницаБазовая";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновлениеРозницыДоУНФ";
		
	КонецЕсли;
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПриОпределенииНастроек
Процедура ПриОпределенииНастроекОбновленияИнформационнойБазы(Параметры) Экспорт
	
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.АвтоматическиеСкидки);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.Валюты);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыДокументовФизическихЛиц);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыДоходовПоСтраховымВзносамУНФ);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыЗаказНарядов);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыЗаказовПокупателей);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыНалогов);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыНачисленийИУдержаний);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыРабочегоВремени);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыЦен);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ДополнительныеУсловия);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ИсточникиПривлеченияПокупателей);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.КатегорииНоменклатуры);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.Кассы);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.КлассификаторЕдиницИзмерения);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.КодыДоходовНДФЛ);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.НаправленияДеятельности);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.Организации);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ПоказателиРасчетов);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ПочтовыеЯщики);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ПараметрыРасчетовДоставки);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ПричиныНеуспешногоЗавершенияРаботыСЛидом);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СегментыКонтрагентов);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СлужбыДоставки);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СостоянияЗаказовПокупателей);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СостоянияЗаказНарядов);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ПричиныОтменыЗаказа);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СостоянияЗаказовПоставщикам);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ПричиныОтменыЗаказовПоставщикам);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СостоянияЗаказовНаПроизводство);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СостоянияЗаказовНаПеремещение);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СостоянияЛидов);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СостоянияСобытий);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СтавкиНДС);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СтатьиДвиженияДенежныхСредств);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СтруктурныеЕдиницы);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СценарииПланирования);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ШаблоныЗаполненияГрафиковРабочегоВремени);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.ПланыСчетов.Управленческий);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.ПланыВидовХарактеристик.РеквизитыДляСписка);
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПриОпределенииРежимаОбновленияДанных
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПриЗавершенииПереходаСДругойПрограммы
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации,
	Параметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СлужебныеПервыйЗапуск_ОбщиеДанные

// (5.Общий) Заполняем справочник ОКУН
Процедура ЗагрузитьОКУН()
	
	Справочники.ОКУН.ЗагрузитьКлассификатор();
	Справочники.ОКУН.ПроставитьВидДеятельностиОКУН();
	
КонецПроцедуры

// (6.Общий) Заполняет РС КоэффициентДефлятор
//
Процедура ЗаполнитьКоэффициентДефлятор()
	
	// переписываем сразу весь набор
	Набор = РегистрыСведений.КоэффициентДефлятор.СоздатьНаборЗаписей();
	
	Запись = Набор.Добавить();
	Запись.Период = '20030101';
	Запись.Значение = 1;
	
	Запись = Набор.Добавить();
	Запись.Период = '20040101';
	Запись.Значение = 1.133;
	
	Запись = Набор.Добавить();
	Запись.Период = '20050101';
	Запись.Значение = 1.104;
	
	Запись = Набор.Добавить();
	Запись.Период = '20060101';
	Запись.Значение = 1.132;
	
	Запись = Набор.Добавить();
	Запись.Период = '20070101';
	Запись.Значение = 1.096;
	
	Запись = Набор.Добавить();
	Запись.Период = '20080101';
	Запись.Значение = 1.081;
	
	Запись = Набор.Добавить();
	Запись.Период = '20090101';
	Запись.Значение = 1.148;
	
	Запись = Набор.Добавить();
	Запись.Период = '20100101';
	Запись.Значение = 1.295;
	
	Запись = Набор.Добавить();
	Запись.Период = '20110101';
	Запись.Значение = 1.372;
	
	Запись = Набор.Добавить();
	Запись.Период = '20120101';
	Запись.Значение = 1.4942;
	
	Запись = Набор.Добавить();
	Запись.Период = '20130101';
	Запись.Значение = 1.569;
	
	Запись = Набор.Добавить();
	Запись.Период = '20140101';
	Запись.Значение = 1.672;
	
	Запись = Набор.Добавить();
	Запись.Период = '20150101';
	Запись.Значение = 1.798;
	
	Запись = Набор.Добавить();
	Запись.Период = '20160101';
	Запись.Значение = 1.798;
	
	Запись = Набор.Добавить();
	Запись.Период = '20180101';
	Запись.Значение = 1.868;
	
	Запись = Набор.Добавить();
	Запись.Период = '20190101';
	Запись.Значение = 1.915;
	
	Запись = Набор.Добавить();
	Запись.Период = '20200101';
	Запись.Значение = 2.005;
	
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПервогоЗапуска

// Процедура заполняет пустую ИБ общими данными
//
// К данным относятся неразделенные сведения, например, глобальные настройки сервиса
//
Процедура ПервыйЗапуск_ОбщиеДанные() Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		// 1. Заполним константу ИзвлекатьТекстыФайловНаСервере
		Константы.ИзвлекатьТекстыФайловНаСервере.Установить(Истина);
		Константы.ИспользоватьПроверкуКонтрагентов.Установить(Истина);
		
		Константы.ВыводитьСуммуБезСкидки.Установить(Перечисления.ВариантыВыводаСуммыБезСкидки.Печатать);

		// 2. Заполним календарь отчетности
		Справочники.КалендарьПодготовкиОтчетности.ЗагрузитьКалендарьПодготовкиОтчетности();
		
		// 3. Загружаем  тарифы страховых взносов с предельными величинами
		Справочники.ВидыТарифовСтраховыхВзносовУНФ.НачальноеЗаполнение();
		// Тарифы должны видеть новые данные в ВидыТарифовСтраховыхВзносовУНФ 
		ОбновитьПовторноИспользуемыеЗначения();
		РегистрыСведений.ТарифыСтраховыхВзносовУНФ.НачальноеЗаполнение();
		РегистрыСведений.ПредельнаяВеличинаБазыСтраховыхВзносовУНФ.УстановитьПредельнуюВеличинуБазыСтраховыхВзносов();
		
		// 4. Заполняем виды предпринимательской деятельности
		Справочники.ВидыПредпринимательскойДеятельности.ЗаполнитьВидыПредпринимательскойДеятельности();
		
		// 5. Заполняем справочник ОКУН
		ЗагрузитьОКУН();
		
		// 6. Заполняем регистр сведений КоэффициентДефлятор
		ЗаполнитьКоэффициентДефлятор();
		
		// 7. Заполняем регистр сведений МРОТ
		РегистрыСведений.МРОТ.НачальноеЗаполнение();
		
		// 8. Заполняем справочник Вычеты НДФЛ
		Справочники.ВычетыНДФЛ.НачальноеЗаполнение();
		
		// 9. Заполним регистр сведений НДФЛРазмерВычетов.
		СотрудникиУНФ.ЗаполнитьРазмерыВычетовНДФЛ();
		
		// 10. Отчетность
		Справочники.ПараметрыИсчисляемогоСтраховогоСтажа.НачальноеЗаполнение();
		Справочники.ОснованияДосрочногоНазначенияПенсии.НачальноеЗаполнение();
		Справочники.ТерриториальныеУсловияПФР.НачальноеЗаполнение();
		РегистрыСведений.ФиксированныеВзносыИП.УстановитьФиксированныеВзносыИП();
		Справочники.ОснованияДосрочногоНазначенияПенсииДляСЗВК.НачальноеЗаполнение();
		Справочники.ОснованияУвольнения.НачальноеЗаполнение(); 
		Справочники.КлассификаторЗанятийУНФ.НачальноеЗаполнение();
		Справочники.ПричиныУвольненияПФР.НачальноеЗаполнение();
		
		РегистрыСведений.РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСН.ЗаполнитьПоставляемыеДанные();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию(); 
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Ошибка выполнения обработчика ПервыйЗапуск_ОбщиеДанные()'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки);
		
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Процедура заполняет пустую ИБ данными пользователей
//
Процедура ПервыйЗапуск_РазделенныеДанные() Экспорт
	
	НачатьТранзакцию();
	
	Попытка

		ВозможностиПриложения.ЗаполнитьОсновныеДанныеВсехВидовПриложений();
		
		НеобходимоВыполнитьПервыйЗапуск = Не ОбщегоНазначения.РазделениеВключено()
			И Не ВидыПриложенийУНФ.УстановленРежимЗапускаКомбинированноеПриложение();

		Если НеобходимоВыполнитьПервыйЗапуск Тогда
			Если ОбщегоНазначенияУНФ.ЭтоУНФ() Тогда
				ВозможностиПриложения.УстановитьВидПриложенияУНФ(Неопределено);
			ИначеЕсли ОбщегоНазначенияУНФ.ЭтоРозница() Тогда
				ВозможностиПриложения.УстановитьВидПриложенияРозница(Неопределено);
			Иначе
				// Ничего делать не требуется.
			КонецЕсли;
		КонецЕсли;
		
		//УстановитьКонстантуПодключаемоеОборудование(Неопределено);
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Ошибка выполнения обработчика ПервыйЗапуск_РазделенныеДанные()'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки);
		
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры // ПервыйЗапуск()

#КонецОбласти

#Область ОбработчикиПереходаСДругихПрограмм

// Обработчики перехода с розницы на УНФ
Процедура ОбновлениеРозницыДоУНФ() Экспорт
	
	ВозможностиПриложения.ОбновлениеРозницыДоУНФ();
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_3_0_9

Процедура ЗаполнитьСтатусыСчетовФактурПоДокументамПередачиМеждуОрганизациями(ПараметрыОбработчика) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ПередачаТоваровМеждуОрганизациями") Тогда
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.СтатусыДокументов.ЗаполнитьСтатусыСчетовФактурПоДокументамПередачиМеждуОрганизациями(ПараметрыОбработчика);
	
КонецПроцедуры

Процедура ЗаполнитьНаименованиеСокращенноеОрганизаций(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 100
	|	Организации.Ссылка КАК Организация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ПометкаУдаления = ЛОЖЬ
	|	И ДЛИНАСТРОКИ(Организации.НаименованиеСокращенное) = 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	Иначе
		Параметры.ОбработкаЗавершена = Ложь;
	КонецЕсли;
		
	Выборка = РезультатЗапроса.Выбрать();
	
	КлассификаторОПФ = РегламентированныеДанныеПовтИсп.КлассификаторОрганизационноПравовыхФорм();
	
	Пока Выборка.Следующий() Цикл
		Организация = Выборка.Организация;
		НаименованиеСокращенное = СформироватьСокращенноеНаименование(КлассификаторОПФ, Организация.НаименованиеПолное);
		ОрганизацияОбъект = Организация.ПолучитьОбъект();
		
		Попытка
			ОрганизацияОбъект.Заблокировать();
			ОрганизацияОбъект.НаименованиеСокращенное = НаименованиеСокращенное;
			ЗаполнитьИсториюНаименований(ОрганизацияОбъект, КлассификаторОПФ);
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОрганизацияОбъект);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка выполнения обработчика заполнения сокращенного наименования организации'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , ОрганизацияОбъект, ПодробноеПредставлениеОшибки);
			
			Параметры.ОбработкаЗавершена = Ложь;
			Возврат;
			
		КонецПопытки;
	КонецЦикла;
	
	НаименованиеПолное = Перечисления.ВидыНаименованийДляПечатиДокументов.Полное;
	Константы.ВидНаименованияОрганизацииДляПечатиДокументов.Установить(НаименованиеПолное);
	
КонецПроцедуры

Процедура ЗаполнитьИсториюНаименований(ОрганизацияОбъект, КлассификаторОПФ)
	Для Каждого СтрокаИстории Из ОрганизацияОбъект.ИсторияНаименований Цикл
		Если ПустаяСтрока(СтрокаИстории.НаименованиеСокращенное) Тогда
			СтрокаИстории.НаименованиеСокращенное = СформироватьСокращенноеНаименование(КлассификаторОПФ, 
				ОрганизацияОбъект.НаименованиеПолное);
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

Функция СформироватьСокращенноеНаименование(КлассификаторОПФ, Знач НаименованиеПолное)

	ОрганизационноПравоваяФорма = ВыделитьИзНаименованияОПФ(КлассификаторОПФ, НаименованиеПолное);
	Шаблон = "%1 %2";
	Если ОрганизационноПравоваяФорма.КраткаяФорма = "ИП" Тогда
		ШаблонНаименования = Шаблон;
	Иначе
		ШаблонНаименования = "%1 ""%2""";
	КонецЕсли;
	
	НаименованиеСокращенное = СтрШаблон(ШаблонНаименования,
		ОрганизационноПравоваяФорма.КраткаяФорма, ОрганизационноПравоваяФорма.НаименованиеБезОПФ);
	
	Возврат НаименованиеСокращенное;
	
КонецФункции

Функция ВыделитьИзНаименованияОПФ(КлассификаторОПФ, Знач НаименованиеОрганизации)

	Результат = Новый Структура("НаименованиеБезОПФ, КраткаяФорма, ПолнаяФорма", НаименованиеОрганизации, "", "");
	МассивСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(НаименованиеОрганизации);

	Для Каждого Слово Из МассивСлов Цикл
		Для Каждого ДанныеОПФ Из КлассификаторОПФ Цикл
			Если СледуетВыделитьКомпонентыНаименования(Слово, ДанныеОПФ) Тогда
				Результат.КраткаяФорма = ДанныеОПФ.КраткаяФорма;
				Результат.ПолнаяФорма = ДанныеОПФ.ПолнаяФорма;
				НаименованиеБезОПФ = СокрЛП(СтрЗаменить(НаименованиеОрганизации, Слово, ""));
				Результат.НаименованиеБезОПФ = СтроковыеФункцииКлиентСервер.СократитьДвойныеКавычки(НаименованиеБезОПФ);
				Возврат Результат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Для Каждого ДанныеОПФ Из КлассификаторОПФ Цикл
		ПозицияВНаименовании = СтрНайти(ВРег(НаименованиеОрганизации), ВРег(ДанныеОПФ.ПолнаяФорма)); 
		Если ПозицияВНаименовании <> 0 Тогда
			ДлинаПолнойФормы = СтрДлина(ДанныеОПФ.ПолнаяФорма);
			Результат.КраткаяФорма = ДанныеОПФ.КраткаяФорма;
			Результат.ПолнаяФорма = ДанныеОПФ.ПолнаяФорма;
			ОПФВНазвании = Сред(НаименованиеОрганизации, ПозицияВНаименовании, ДлинаПолнойФормы);
			НаименованиеБезОПФ = СокрЛП(СтрЗаменить(НаименованиеОрганизации, ОПФВНазвании, ""));
			Результат.НаименованиеБезОПФ = СтроковыеФункцииКлиентСервер.СократитьДвойныеКавычки(НаименованиеБезОПФ);
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция СледуетВыделитьКомпонентыНаименования(Слово, ДанныеОПФ)

	Если ВРег(СокрЛП(Слово)) = ВРег(ДанныеОПФ.ПолнаяФорма) Тогда
		Возврат Истина;
	КонецЕсли;

	Если Не ПустаяСтрока(ДанныеОПФ.КраткаяФорма) И ВРег(СокрЛП(Слово)) = ВРег(ДанныеОПФ.КраткаяФорма) Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

Процедура ПереместитьШаблоныЧекаККМВНовыйСправочникИЗаменитьВКассахККМ(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 300
		|	ХранилищеШаблонов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ХранилищеШаблонов КАК ХранилищеШаблонов
		|ГДЕ
		|	ХранилищеШаблонов.ТипШаблона = ЗНАЧЕНИЕ(Перечисление.ТипыШаблонов.ЧекККМ)
		|	И ХранилищеШаблонов.УдалитьШаблонЧекаРМК = ЗНАЧЕНИЕ(Справочник.ХранилищеШаблоновРМК.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ЗаменитьВКассахККМШаблоныЧековНаНовые(Параметры);
	Иначе
		ПереместитьШаблоныЧекаККМВНовыйСправочник(РезультатЗапроса);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПереместитьШаблоныЧекаККМВНовыйСправочник(РезультатЗапроса)
	
	ТипыУсловий = Новый Соответствие;
	ТипыУсловий.Вставить(Перечисления.УсловиеВыводаСекцииШаблона.ВидДисконтнойКарты,
		Перечисления.УсловиеВыводаСекцииШаблонаРМК.ВидДисконтнойКарты);
	ТипыУсловий.Вставить(Перечисления.УсловиеВыводаСекцииШаблона.Сумма,
		Перечисления.УсловиеВыводаСекцииШаблонаРМК.Сумма);
	ТипыУсловий.Вставить(Перечисления.УсловиеВыводаСекцииШаблона.СуммаДоСкидок,
		Перечисления.УсловиеВыводаСекцииШаблонаРМК.СуммаДоСкидок);
	ТипыУсловий.Вставить(Перечисления.УсловиеВыводаСекцииШаблона.СуммаАвтоматическойСкидки,
		Перечисления.УсловиеВыводаСекцииШаблонаРМК.СуммаАвтоматическойСкидки);
	ТипыУсловий.Вставить(Перечисления.УсловиеВыводаСекцииШаблона.СуммаРучнойСкидки,
		Перечисления.УсловиеВыводаСекцииШаблонаРМК.СуммаРучнойСкидки);
	ТипыУсловий.Вставить(Перечисления.УсловиеВыводаСекцииШаблона.СуммаОплатыБонусами,
		Перечисления.УсловиеВыводаСекцииШаблонаРМК.СуммаОплатыБонусами);
	ТипыУсловий.Вставить(Перечисления.УсловиеВыводаСекцииШаблона.СуммаВсехСкидок,
		Перечисления.УсловиеВыводаСекцииШаблонаРМК.СуммаВсехСкидок);
	ТипыУсловий.Вставить(Перечисления.УсловиеВыводаСекцииШаблона.НачисленоБонусов,
		Перечисления.УсловиеВыводаСекцииШаблонаРМК.НачисленоБонусов);
	ТипыУсловий.Вставить(Перечисления.УсловиеВыводаСекцииШаблона.ПокупательИдентифицирован,
		Перечисления.УсловиеВыводаСекцииШаблонаРМК.ПокупательИдентифицирован);
	ТипыУсловий.Вставить(Перечисления.УсловиеВыводаСекцииШаблона.ВыдаетсяПромокодНаСкидку,
		Перечисления.УсловиеВыводаСекцииШаблонаРМК.ВыдаетсяПромокодНаСкидку);
	
	ВидыСравнения = Новый Соответствие;
	ВидыСравнения.Вставить(Перечисления.ВидСравненияЗначений.Больше,
		Перечисления.ВидСравненияЗначенийРМК.Больше);
	ВидыСравнения.Вставить(Перечисления.ВидСравненияЗначений.БольшеИлиРавно,
		Перечисления.ВидСравненияЗначенийРМК.БольшеИлиРавно);
	ВидыСравнения.Вставить(Перечисления.ВидСравненияЗначений.Меньше,
		Перечисления.ВидСравненияЗначенийРМК.Меньше);
	ВидыСравнения.Вставить(Перечисления.ВидСравненияЗначений.МеньшеИлиРавно,
		Перечисления.ВидСравненияЗначенийРМК.МеньшеИлиРавно);
	ВидыСравнения.Вставить(Перечисления.ВидСравненияЗначений.Равно,
		Перечисления.ВидСравненияЗначенийРМК.Равно);
	ВидыСравнения.Вставить(Перечисления.ВидСравненияЗначений.НеРавно,
		Перечисления.ВидСравненияЗначенийРМК.НеРавно);
	ВидыСравнения.Вставить(Перечисления.ВидСравненияЗначений.ВСписке,
		Перечисления.ВидСравненияЗначенийРМК.ВСписке);
	ВидыСравнения.Вставить(Перечисления.ВидСравненияЗначений.ВИнтервале,
		Перечисления.ВидСравненияЗначенийРМК.ВИнтервале);
	ВидыСравнения.Вставить(Перечисления.ВидСравненияЗначений.ВИнтервалеВключая,
		Перечисления.ВидСравненияЗначенийРМК.ВИнтервалеВключая);
	ВидыСравнения.Вставить(Перечисления.ВидСравненияЗначений.ВИнтервалеВключаяЛево,
		Перечисления.ВидСравненияЗначенийРМК.ВИнтервалеВключаяЛево);
	ВидыСравнения.Вставить(Перечисления.ВидСравненияЗначений.ВИнтервалеВключаяПраво,
		Перечисления.ВидСравненияЗначенийРМК.ВИнтервалеВключаяПраво);
	
	Выборка = РезультатЗапроса.Выбрать();
	НачатьТранзакцию();
	Попытка
		Пока Выборка.Следующий() Цикл
			СтароеХранилищеШаблоновОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СтароеХранилищеШаблоновОбъект.Заблокировать();
			СтруктураШаблона = СтароеХранилищеШаблоновОбъект.Шаблон.Получить();
			СКД = СтароеХранилищеШаблоновОбъект.СхемаКомпоновкиДанных.Получить();
			
			НовоеХранилищеШаблоновРМКОбъект = Справочники.ХранилищеШаблоновРМК.СоздатьЭлемент();
			НовоеХранилищеШаблоновРМКОбъект.Наименование = СтароеХранилищеШаблоновОбъект.Наименование;
			НовоеХранилищеШаблоновРМКОбъект.ПометкаУдаления = СтароеХранилищеШаблоновОбъект.ПометкаУдаления;
			НовоеХранилищеШаблоновРМКОбъект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СКД);
			Для Каждого ОписаниеУсловия Из СтароеХранилищеШаблоновОбъект.Условия Цикл
				НовыйТипУсловий   = ТипыУсловий.Получить(ОписаниеУсловия.ТипУсловия);
				НовыйВидСравнения = ВидыСравнения.Получить(ОписаниеУсловия.ВидСравнения);
				Если НовыйТипУсловий = Неопределено ИЛИ НовыйВидСравнения = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				НовоеОписаниеУсловия = НовоеХранилищеШаблоновРМКОбъект.Условия.Добавить();
				НовоеОписаниеУсловия.Идентификатор     = ОписаниеУсловия.Идентификатор;
				НовоеОписаниеУсловия.ТипУсловия        = НовыйТипУсловий;
				НовоеОписаниеУсловия.ВидСравнения      = НовыйВидСравнения;
				НовоеОписаниеУсловия.ЗначениеСравнения = ОписаниеУсловия.ЗначениеСравнения;
			КонецЦикла;
			
			Если ТипЗнч(СтруктураШаблона) = Тип("Структура")
				И СтруктураШаблона.Свойство("ТаблицаУсловий") Тогда
				
				СтруктураШаблона.ТаблицаУсловий = НовоеХранилищеШаблоновРМКОбъект.Условия.Выгрузить(,
					"Идентификатор, ТипУсловия, ВидСравнения, ЗначениеСравнения");
			КонецЕсли;
			НовоеХранилищеШаблоновРМКОбъект.Шаблон = Новый ХранилищеЗначения(СтруктураШаблона);
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеХранилищеШаблоновРМКОбъект);
			
			СтароеХранилищеШаблоновОбъект.УдалитьШаблонЧекаРМК = НовоеХранилищеШаблоновРМКОбъект.Ссылка;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СтароеХранилищеШаблоновОбъект);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаменитьВКассахККМШаблоныЧековНаНовые(Параметры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 300
		|	КассыККМ.Ссылка КАК Ссылка,
		|	КассыККМ.УдалитьШаблонЧекаПродажи КАК УдалитьШаблонЧекаПродажи,
		|	КассыККМ.УдалитьШаблонЧекаВозврата КАК УдалитьШаблонЧекаВозврата
		|ПОМЕСТИТЬ КассыККМНеОбработанные
		|ИЗ
		|	Справочник.КассыККМ КАК КассыККМ
		|ГДЕ
		|	(КассыККМ.УдалитьШаблонЧекаПродажи <> ЗНАЧЕНИЕ(Справочник.ХранилищеШаблонов.ПустаяСсылка)
		|				И КассыККМ.ШаблонЧекаПродажи = ЗНАЧЕНИЕ(Справочник.ХранилищеШаблоновРМК.ПустаяСсылка)
		|				И КассыККМ.УдалитьШаблонЧекаПродажи.ТипШаблона = ЗНАЧЕНИЕ(Перечисление.ТипыШаблонов.ЧекККМ)
		|			ИЛИ КассыККМ.УдалитьШаблонЧекаВозврата <> ЗНАЧЕНИЕ(Справочник.ХранилищеШаблонов.ПустаяСсылка)
		|				И КассыККМ.ШаблонЧекаВозврата = ЗНАЧЕНИЕ(Справочник.ХранилищеШаблоновРМК.ПустаяСсылка)
		|				И КассыККМ.УдалитьШаблонЧекаВозврата.ТипШаблона = ЗНАЧЕНИЕ(Перечисление.ТипыШаблонов.ЧекККМ))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КассыККМНеОбработанные.Ссылка КАК Ссылка,
		|	ЕСТЬNULL(ХранилищеШаблоновЧекаПродажи.УдалитьШаблонЧекаРМК, ЗНАЧЕНИЕ(Справочник.ХранилищеШаблоновРМК.ПустаяСсылка)) КАК ШаблонЧекаПродажи,
		|	ЕСТЬNULL(ХранилищеШаблоновЧекаВозврата.УдалитьШаблонЧекаРМК, ЗНАЧЕНИЕ(Справочник.ХранилищеШаблоновРМК.ПустаяСсылка)) КАК ШаблонЧекаВозврата
		|ИЗ
		|	КассыККМНеОбработанные КАК КассыККМНеОбработанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХранилищеШаблонов КАК ХранилищеШаблоновЧекаПродажи
		|		ПО КассыККМНеОбработанные.УдалитьШаблонЧекаПродажи = ХранилищеШаблоновЧекаПродажи.Ссылка
		|			И (ХранилищеШаблоновЧекаПродажи.ТипШаблона = ЗНАЧЕНИЕ(Перечисление.ТипыШаблонов.ЧекККМ))
		|			И (НЕ ХранилищеШаблоновЧекаПродажи.УдалитьШаблонЧекаРМК = ЗНАЧЕНИЕ(Справочник.ХранилищеШаблоновРМК.ПустаяСсылка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХранилищеШаблонов КАК ХранилищеШаблоновЧекаВозврата
		|		ПО КассыККМНеОбработанные.УдалитьШаблонЧекаВозврата = ХранилищеШаблоновЧекаВозврата.Ссылка
		|			И (ХранилищеШаблоновЧекаВозврата.ТипШаблона = ЗНАЧЕНИЕ(Перечисление.ТипыШаблонов.ЧекККМ))
		|			И (НЕ ХранилищеШаблоновЧекаВозврата.УдалитьШаблонЧекаРМК = ЗНАЧЕНИЕ(Справочник.ХранилищеШаблоновРМК.ПустаяСсылка))";
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
	КассыККМНеОбработанные=ПакетРезультатовЗапроса[0].Выгрузить();
	КассыККМНаОбработку=ПакетРезультатовЗапроса[1];
	
	Если КассыККМНеОбработанные[0].Количество = 0 Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Выборка = КассыККМНаОбработку.Выбрать();
	НачатьТранзакцию();
	Попытка
		Пока Выборка.Следующий() Цикл
			КассаККМОбъект = Выборка.Ссылка.ПолучитьОбъект();
			КассаККМОбъект.Заблокировать();
			КассаККМОбъект.ШаблонЧекаПродажи  = Выборка.ШаблонЧекаПродажи;
			КассаККМОбъект.ШаблонЧекаВозврата = Выборка.ШаблонЧекаВозврата;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(КассаККМОбъект);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
КонецПроцедуры

Процедура ЗаполнитьПараметрыСчетаРасчетыССамозанятыми(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	НачатьТранзакцию();
	Попытка
		РасчетыССамозанятыми = ПланыСчетов.Управленческий.РасчетыССамозанятыми.ПолучитьОбъект();
		РасчетыССамозанятыми.Заблокировать();
		РасчетыССамозанятыми.Наименование = НСтр("ru='Расчеты с самозанятыми по реестрам выплат'");
		РасчетыССамозанятыми.Родитель = ПланыСчетов.Управленческий.РасчетыСРазнымиДебиторамиИКредиторами;
		РасчетыССамозанятыми.Вид = ВидСчета.Пассивный;
		РасчетыССамозанятыми.ТипСчета = Перечисления.ТипыСчетов.Кредиторы;
		РасчетыССамозанятыми.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(РасчетыССамозанятыми);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Фоновое обновление заполнение параметров счета ""Расчеты с самозанятыми""'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
		
		Параметры.ОбработкаЗавершена = Ложь;
		Возврат;
		
	КонецПопытки;
	Параметры.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура ОбновитьОтчеты_3_0_9(ПараметрыОбработчика) Экспорт
	
	ОтчетыКОбновлению = Новый Массив;
	
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.РасчетыПоПрочимОперациям);
	
	ОтчетыУНФ.ОбновитьОтчетыВыборочно(ОтчетыКОбновлению);
	
	ПараметрыОбработчика.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура ОперацииПодготовкиКРаботеСАкцизами(Параметры) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Параметры.ОбработкаЗавершена = Ложь;
		Продажи_Акцизы = ПланыСчетов.Управленческий.Продажи_Акцизы.ПолучитьОбъект();
		Продажи_Акцизы.Наименование = НСтр("ru='Продажи акцизы'");
		Продажи_Акцизы.Родитель = ПланыСчетов.Управленческий.Продажи;
		Продажи_Акцизы.Вид = ВидСчета.Активный;
		Продажи_Акцизы.ТипСчета = Перечисления.ТипыСчетов.Кредиторы;
		Продажи_Акцизы.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Продажи_Акцизы);
		
		АкцизыПоОплаченнымМатериальнымЦенностям = ПланыСчетов.Управленческий.АкцизыПоОплаченнымМатериальнымЦенностям.ПолучитьОбъект();
		АкцизыПоОплаченнымМатериальнымЦенностям.Наименование = НСтр("ru='Акцизы по оплаченным материальным ценностям'");
		АкцизыПоОплаченнымМатериальнымЦенностям.Родитель = ПланыСчетов.Управленческий.НДСПоПриобретеннымЦенностям;
		АкцизыПоОплаченнымМатериальнымЦенностям.Вид = ВидСчета.Активный;
		АкцизыПоОплаченнымМатериальнымЦенностям.ТипСчета = Перечисления.ТипыСчетов.Дебиторы;
		АкцизыПоОплаченнымМатериальнымЦенностям.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(АкцизыПоОплаченнымМатериальнымЦенностям);
		
		Киловатт = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("214");
		Если Не ЗначениеЗаполнено(Киловатт) Тогда
			Киловатт = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
			Киловатт.Наименование = НСтр("ru = 'кВт'");
			Киловатт.МеждународноеСокращение = НСтр("ru = 'KWT'");
			Киловатт.Код = НСтр("ru = '214'");
			Киловатт.НаименованиеПолное = НСтр("ru = 'Киловатт'");
			Киловатт.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.Мощность;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Киловатт);
		КонецЕсли;
		
		ЛошадинаяСила = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("251");
		Если Не ЗначениеЗаполнено(ЛошадинаяСила) Тогда
			ЛошадинаяСила = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
			ЛошадинаяСила.Наименование = НСтр("ru = 'л. с'");
			ЛошадинаяСила.Код = НСтр("ru = '251'");
			ЛошадинаяСила.НаименованиеПолное = НСтр("ru = 'Лошадиная сила'");
			ЛошадинаяСила.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.Мощность;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ЛошадинаяСила);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
		Параметры.ОбработкаЗавершена = Истина;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка подготовки к работе с акцизами'",
		ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
		
		ОтменитьТранзакцию();
		Параметры.ОбработкаЗавершена = Ложь;
		
	КонецПопытки
	
КонецПроцедуры

Процедура ОбновитьВидыНалоговПоНДФЛ(ПараметрыОбработчика) Экспорт
	
	ЕстьОшибки = Ложь;
	
	НачатьТранзакцию();
	
	Попытка
		
		КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
		
		ЭлементНДФЛСотрудники = Справочники.ВидыНалогов.НДФЛСотрудники.ПолучитьОбъект();
		ЭлементНДФЛСотрудники.Наименование = НСтр("ru = 'НДФЛ исчисленный налоговым агентом'",
		КодОсновногоЯзыка);
		ЭлементНДФЛСотрудники.Код = "00-000008";  
		ЭлементНДФЛСотрудники.КодБК = "18210102010011000110";   	
		ЭлементНДФЛСотрудники.ВидНалога = Перечисления.ВидыНалогов.НДФЛ;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементНДФЛСотрудники);
		
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины = Справочники.ВидыНалогов.НДФЛДоходыСвышеПредельнойВеличины.ПолучитьОбъект();
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины.Наименование = НСтр("ru = 'НДФЛ с доходов свыше предельной величины, исчисленный налоговым агентом'",
		КодОсновногоЯзыка);
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины.Код = "00-000017";
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины.ВидНалога = Перечисления.ВидыНалогов.НДФЛ_ДоходыСвышеПредельнойВеличины;
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины.КодБК = "18210102080011000110";   
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементНДФЛСотрудникиСвышеПредельнойВеличины); 	
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ИмяСобытия = НСтр("ru = 'Выполнение обработчика обновления видов налогов по НДФЛ'", 
		ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		ЕстьОшибки = Истина;
		
	КонецПопытки;
	
	ПараметрыОбработчика.ОбработкаЗавершена = НЕ ЕстьОшибки;
	
КонецПроцедуры

Процедура УстановитьКратностьСкидок(ПараметрыОбработчика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Первые 500
		|	АвтоматическиеСкидки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.АвтоматическиеСкидки КАК АвтоматическиеСкидки
		|ГДЕ
		|	АвтоматическиеСкидки.КратноКоличествуУсловий = 0";

	Выборка = Запрос.Выполнить().Выбрать();
	НачатьТранзакцию();
	Попытка
		Пока Выборка.Следующий() Цикл
			СкидкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СкидкаОбъект.КратноКоличествуУсловий = 1;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СкидкаОбъект);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	Если Выборка.Количество() < 500 Тогда
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПометитьНаУдалениеЗадачиВзносыИПДоходы() Экспорт
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;
	
	Справочники.КалендарьПодготовкиОтчетности.ЗагрузитьКалендарьПодготовкиОтчетности();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаписиКалендаряПодготовкиОтчетности.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.СистемыНалогообложенияОрганизаций КАК СистемыНалогообложенияОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗаписиКалендаряПодготовкиОтчетности КАК ЗаписиКалендаряПодготовкиОтчетности
	|		ПО СистемыНалогообложенияОрганизаций.Организация = ЗаписиКалендаряПодготовкиОтчетности.Организация
	|ГДЕ
	|	ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.Задача В(&МассивЗадачВзносыИП)
	|	И ГОД(ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.ДатаОкончанияСобытия) >= 2023
	|	И (ЕСТЬNULL(СистемыНалогообложенияОрганизаций.ПлательщикУСН, ЛОЖЬ)
	|				И СистемыНалогообложенияОрганизаций.ОбъектНалогообложения = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовНалогообложения.Доходы)
	|			ИЛИ СистемыНалогообложенияОрганизаций.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.ОсобыйПорядок)
	|				И ЕСТЬNULL(СистемыНалогообложенияОрганизаций.ПрименяетсяПатент, ЛОЖЬ))
	|	И ВЫБОР
	|			КОГДА ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.Задача = ЗНАЧЕНИЕ(Справочник.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыИП)
	|					И ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.УпрощенныйЗачетФиксированныхВзносов = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			КОГДА ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.Задача = ЗНАЧЕНИЕ(Справочник.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыПриДоходахСвыше300ТР)
	|					И ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.УпрощенныйЗачетФиксированныхВзносов = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			КОГДА ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.Задача = ЗНАЧЕНИЕ(Справочник.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыЗаСотрудников)
	|					И ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.ДатаОкончанияСобытия = &ДатаОкончанияСтраховыеВзносыЗаСотрудников
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ЗаписиКалендаряПодготовкиОтчетности.ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаписиКалендаряПодготовкиОтчетности.Ссылка
	|ИЗ
	|	Справочник.ЗаписиКалендаряПодготовкиОтчетности КАК ЗаписиКалендаряПодготовкиОтчетности
	|ГДЕ
	|	ГОД(ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.ДатаОкончанияСобытия) >= 2023
	|	И ВЫБОР
	|			КОГДА ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.Задача = ЗНАЧЕНИЕ(Справочник.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыЗаСотрудников)
	|					И ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.ДатаОкончанияСобытия = &ДатаОкончанияСтраховыеВзносыЗаСотрудников
	|				ТОГДА ИСТИНА
	|			КОГДА ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.Задача = ЗНАЧЕНИЕ(Справочник.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыИП)
	|					И ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.ДатаОкончанияСобытия = &ДатаОкончанияСтраховыеВзносыИП
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ЗаписиКалендаряПодготовкиОтчетности.ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КалендарьПодготовкиОтчетности.Ссылка
	|ИЗ
	|	Справочник.КалендарьПодготовкиОтчетности КАК КалендарьПодготовкиОтчетности
	|ГДЕ
	|	(КалендарьПодготовкиОтчетности.Задача = ЗНАЧЕНИЕ(Справочник.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыЗаСотрудников)
	|				И КалендарьПодготовкиОтчетности.ДатаОкончанияСобытия = &ДатаОкончанияСтраховыеВзносыЗаСотрудников
	|			ИЛИ КалендарьПодготовкиОтчетности.Задача = ЗНАЧЕНИЕ(Справочник.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыИП)
	|				И КалендарьПодготовкиОтчетности.ДатаОкончанияСобытия = &ДатаОкончанияСтраховыеВзносыИП)
	|	И КалендарьПодготовкиОтчетности.ПометкаУдаления = ЛОЖЬ";
	
	МассивЗадачВзносыИП = 	Новый Массив;
	МассивЗадачВзносыИП.Добавить(Справочники.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыИП); 
	МассивЗадачВзносыИП.Добавить(Справочники.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыПриДоходахСвыше300ТР);
	
	Запрос.УстановитьПараметр("МассивЗадачВзносыИП", МассивЗадачВзносыИП); 
	Запрос.УстановитьПараметр("ДатаОкончанияСтраховыеВзносыЗаСотрудников", '20240326');
	Запрос.УстановитьПараметр("ДатаОкончанияСтраховыеВзносыИП", '20250109');
	
	Попытка
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			
			ЗадачаКалендаря = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ЗадачаКалендаря.УстановитьПометкуУдаления(Истина);  
 		
		КонецЦикла; 
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ИмяСобытия = НСтр("ru = 'Выполнение обработчика ПометитьНаУдалениеЗадачиВзносыИПДоходы'", 
		ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура УстановитьСлужебныеОпцииСостоянийЗаказов() Экспорт
	
	Если НЕ Константы.ИспользоватьВидыЗаказовПокупателей.Получить() 
		И НЕ Константы.НеИспользоватьВидыЗаказовПокупателей.Получить() Тогда
		Константы.НеИспользоватьВидыЗаказовПокупателей.Установить(Истина);
	КонецЕсли;
	
	Если НЕ Константы.ИспользоватьВидыЗаказНарядов.Получить() 
		И НЕ Константы.НеИспользоватьВидыЗаказНарядов.Получить() Тогда
		Константы.НеИспользоватьВидыЗаказНарядов.Установить(Истина);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Обработчики_3_0_10

// Процедура - Установить служебные функциональные опции возможностей приложений
//	
//	Предназначена для заполнения служебных опций при обновлении с 3.0.9 на 3.0.10
//	
Процедура УстановитьСлужебныеФункциональныеОпцииВозможностейПриложений() Экспорт
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока( ВидыПриложенийСервер.ИмяТекущегоВидаПриложения() ) Тогда
		ВозможностиПриложения.УстановитьВидПриложенияПустое(Неопределено);
		Константы.ТребуетсяКонтрольДоговоровКонтрагентовВДенежныхДокументах.Установить(Истина);
		Возврат;
	КонецЕсли;
	
	ЭтоБизнесПриложение = ВозможностиПриложения.ЭтоБизнесПриложение();
	ЭтоРозница = ВозможностиПриложения.ЭтоРозница();

	Константы.ПереносАдресатовЗавершен.Установить(Истина);
	Константы.ПереносКонтактовВАдресатыЗавершен.Установить(Истина);
	Константы.ПереносКонтактовЛидовВАдресатыЗавершен.Установить(Истина);
	Константы.ПереносКонтрагентовВАдресатыЗавершен.Установить(Истина);
	Константы.ПереносЛидовВАдресатыЗавершен.Установить(Истина);
	Константы.ПереносФизическихЛицВАдресатыЗавершен.Установить(Истина);
	
	Если ЭтоБизнесПриложение Тогда
		
	Иначе
	
		Константы.ИспользоватьАвансовыеОтчеты.Установить(Истина);
		Константы.ИспользоватьГоловнуюОрганизацию.Установить(Истина);
		Константы.ИспользоватьДоставкуВЗаказеПокупателя.Установить(Истина);
		Константы.ИспользоватьЗагрузкуДанныхИзБП3.Установить(Истина);
		Константы.ИспользоватьЗагрузкуДанныхИзИнтернетМагазина.Установить(Истина);
		Константы.ИспользоватьЗагрузкуДанныхИзРТ23.Установить(Истина);
		Константы.ИспользоватьЗагрузкуДанныхИзУТ103.Установить(Истина);
		Константы.ИспользоватьИнтеграцииСистемыВзаимодействия.Установить(Истина);
		Константы.ИспользоватьИсториюРеквизитов.Установить(Истина);
		Константы.ИспользоватьКассы.Установить(Истина);
		Константы.ИспользоватьКатегорииНоменклатуры.Установить(Истина);
		Константы.ИспользоватьКомплектации.Установить(Истина);
		Константы.ИспользоватьКонтактыКонтрагентов.Установить(Истина);
		Константы.ИспользоватьНастройкуФильтровПравойПанели.Установить(Истина);
		Константы.ИспользоватьНастройкуФормы.Установить(Истина);
		Константы.ИспользоватьПодсистемуКаналыПродаж.Установить(Истина);
		Константы.ИспользоватьПодсистемуТорговыеПредложения.Установить(Истина);
		Константы.ИспользоватьПроизводственныйКалендарь.Установить(Истина);
		Константы.ИспользоватьРаботуСНовостями.Установить(Истина);
		Константы.ИспользоватьРабочиеПроцессы.Установить(Истина);
		Константы.ИспользоватьСвязанныеДокументы.Установить(Истина);
		Константы.ИспользоватьСегментыКонтрагентов.Установить(Истина);
		Константы.ИспользоватьСогласияНаОбработкуПерсональныхДанных.Установить(Истина);
		Константы.ИспользоватьСопутствующиеТовары.Установить(Истина);
		Константы.ИспользоватьСправочникПользователи.Установить(Истина);
		Константы.ИспользоватьСправочникСотрудники.Установить(Истина);
		Константы.ИспользоватьСтруктурныеЕдиницы.Установить(Истина);
		Константы.ИспользоватьСчетаНаОплату.Установить(Истина);
		Константы.ИспользоватьСчетаФактуры.Установить(Истина);
		Константы.ИспользоватьТегиКонтрагентов.Установить(Истина);
		Константы.ИспользоватьТипыНоменклатуры.Установить(Истина);
		Константы.ИспользоватьУстановкуЦен.Установить(Истина);
		Константы.ИспользоватьЧастичныеОплаты.Установить(Истина);
		Константы.ИспользоватьЧастичныеОтгрузки.Установить(Истина);
		Константы.ИспользоватьШтрихкоды.Установить(Истина);
		Константы.ОтображатьВводНаОсновании.Установить(Истина);
		Константы.ОтображатьВзаиморасчеты.Установить(Истина);
		Константы.ОтображатьВсеСправочникиОсновнойРаздел.Установить(Истина);
		Константы.ОтображатьДополнительныеНаименованияВСправочниках.Установить(Истина);
		Константы.ОтображатьКартинкиНоменклатуры.Установить(Истина);
		Константы.ОтображатьОтчетыВФормеНоменклатуры.Установить(Истина);
		Константы.ОтображатьПодсказкиРазделовЕБВ.Установить(Истина);
		Константы.ОтображатьРазделПомощь.Установить(Истина);
		Константы.ОтображатьРеквизитыЗакупкиПроизводстваВНоменклатуре.Установить(Истина);
		Константы.ОтображатьРеквизитыНалогообложения.Установить(Истина);
		Константы.ОтображатьСодержаниеДокументаВСписке.Установить(Истина);
		Константы.ОтображатьСтраницаПродуктаНаСайте1С.Установить(Истина);
		Константы.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование.Установить(Истина);
		Константы.ИспользоватьОтчетыВыполненияЗаказов.Установить(Истина);
		Константы.ИспользоватьСервисыИнтеграций.Установить(Истина);
		Константы.ИспользоватьСервисыДоставки.Установить(Истина);
		Константы.ИспользоватьСинхронизациюСОблаком.Установить(Истина);
		Константы.ОтображатьСпискиДенежныхДокументов.Установить(Истина);
		Константы.ИспользоватьЗакрытиеМесяца.Установить(Истина); 
		Константы.ФункциональнаяОпцияИспользоватьСинхронизациюДанныхВПриложении.Установить(Истина);

		Если НЕ ЭтоРозница Тогда
			Константы.ИспользоватьАктыВыполненныхРабот.Установить(Истина);
			Константы.ОтображатьВыборВидаБизнеса.Установить(Истина);
		КонецЕсли;

		Если ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеОтчетыИОбработки") Тогда
			Константы.ОтображатьДополнительныеОбработки.Установить(Истина);
		КонецЕсли;

		Если ПолучитьФункциональнуюОпцию("РаботаВМоделиСервисаБТС") Тогда
			Константы.ОтображатьКомандуОплатаСервиса.Установить(Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	ВключенаПодсистемаУслуги = Константы.ИспользоватьПодсистемуУслуги.Получить();
	ВключенаПодсистемаРаботы = Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы.Получить();
	Если ВключенаПодсистемаРаботы И НЕ ВключенаПодсистемаУслуги Тогда
		Константы.ОтображатьПодсистемуРаботы.Установить(Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьМакетыИПоляШаблоновЧека(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХранилищеШаблоновРМК.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ХранилищеШаблоновРМК КАК ХранилищеШаблоновРМК
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	Выборка = РезультатЗапроса.Выбрать();
	НачатьТранзакцию();
	Попытка
		Пока Выборка.Следующий() Цикл
			ШаблонЧекаСсылка = Выборка.Ссылка;
			ШаблонЧекаОбъект = ШаблонЧекаСсылка.ПолучитьОбъект();
			
			ШаблонЧекаОбъект.Заблокировать();
			
			// Обновление макета
			СКД = Новый СхемаКомпоновкиДанных;
			ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьМакетШаблонаЧека(СКД);
			ШаблонЧекаОбъект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СКД);
			
			// Обновление полей шаблона
			ИзмененыСтрокиШаблона = Ложь;
			ДанныеШаблона = Неопределено;
			Шаблон = Неопределено;
			ВычисляемыеСтрокиШаблона = Новый Массив;
			
			Если ЗначениеЗаполнено(ШаблонЧекаОбъект.Шаблон) Тогда
				ДанныеШаблона = ШаблонЧекаОбъект.Шаблон.Получить();
			КонецЕсли;
			Если ТипЗнч(ДанныеШаблона) = Тип("Структура")
				И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеШаблона, "Шаблон") Тогда
				
				Шаблон = ДанныеШаблона.Шаблон;
			КонецЕсли;
			Если ТипЗнч(Шаблон) = Тип("ДеревоЗначений") Тогда
				ИмяКолонкиВычислять = "Вычислять";
				ИмяКолонкиЭлемент = "Элемент";
				ИмяКолонкиЗаголовок = "Заголовок";
				ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
				Если Шаблон.Колонки.Найти(ИмяКолонкиВычислять) = Неопределено Тогда
					Шаблон.Колонки.Добавить(ИмяКолонкиВычислять, Новый ОписаниеТипов("Булево"));
				КонецЕсли;
				Если Шаблон.Колонки.Найти(ИмяКолонкиЭлемент) = Неопределено Тогда
					Шаблон.Колонки.Добавить(ИмяКолонкиЭлемент, ОписаниеТипаСтрока);
				КонецЕсли;
				Если Шаблон.Колонки.Найти(ИмяКолонкиЗаголовок) = Неопределено Тогда
					Шаблон.Колонки.Добавить(ИмяКолонкиЗаголовок, ОписаниеТипаСтрока);
				КонецЕсли;
				Если Шаблон.Строки.Количество() Тогда
					ПараметрыОтбора = Новый Структура;
					ПараметрыОтбора.Вставить(ИмяКолонкиВычислять, Истина);
					ПараметрыОтбора.Вставить("ИмяКолонки", "Текст");
					ВычисляемыеСтрокиШаблона = Шаблон.Строки.НайтиСтроки(ПараметрыОтбора, Истина);
				КонецЕсли;
			КонецЕсли;
			
			Для каждого СтрокаШаблона Из ВычисляемыеСтрокиШаблона Цикл
				Если СтрокаШаблона.Элемент = "СтруктурнаяЕдиница" Тогда
					СтрокаШаблона.Элемент = "ТорговыйОбъект";
					СтрокаШаблона.Заголовок = НСтр("ru = 'Торговый объект'", КодОсновногоЯзыка);
					ИзмененыСтрокиШаблона = Истина;
				ИначеЕсли СтрокаШаблона.Элемент = "Наименование" Тогда
					СтрокаШаблона.Элемент = "НоменклатураНаименование";
					СтрокаШаблона.Заголовок = НСтр("ru = 'Номенклатура.Наименование'", КодОсновногоЯзыка);
					ИзмененыСтрокиШаблона = Истина;
				Иначе
					// Действие не требуется
				КонецЕсли;
			КонецЦикла;
			
			Если ИзмененыСтрокиШаблона Тогда
				ДанныеШаблона.Шаблон = Шаблон;
				ШаблонЧекаОбъект.Шаблон = Новый ХранилищеЗначения(ДанныеШаблона);
			КонецЕсли;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонЧекаОбъект, Ложь, Ложь);
			
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
		
	Параметры.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура ЗаполнитьСчетУчетаЛичныхСредствПредпринимателя() Экспорт
	
	НачатьТранзакцию();
	Попытка
		ВыборкаОрганизации = Справочники.Организации.Выбрать();
		Пока ВыборкаОрганизации.Следующий() Цикл
			ОрганизацияОбъект = ВыборкаОрганизации.ПолучитьОбъект();
			ОрганизацияОбъект.СчетУчетаЛичныхСредствПредпринимателя =
				ПредопределенноеЗначение("ПланСчетов.Управленческий.НераспределеннаяПрибыль");
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОрганизацияОбъект);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Заполнение счета учета личных средств предпринимателя.'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
		
		Возврат;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьШаблоныСообщений(Параметры) Экспорт
	
	ИдентификаторыДляЗамены = ИдентификаторыДляЗамены();
	СписокКлючей = Новый Массив;
	Для каждого Элемент Из ИдентификаторыДляЗамены Цикл
		СписокКлючей.Добавить(Элемент.Ключ);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
	|	ШаблоныСообщенийПечатныеФормыИВложения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШаблоныСообщений.ПечатныеФормыИВложения КАК ШаблоныСообщенийПечатныеФормыИВложения
	|ГДЕ
	|	ШаблоныСообщенийПечатныеФормыИВложения.Идентификатор В(&Идентификаторы)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("Идентификаторы", СписокКлючей);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	Иначе
		Параметры.ОбработкаЗавершена = Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭлементСправочника = Выборка.Ссылка;
		ШаблоныОбъект = ЭлементСправочника.ПолучитьОбъект();
		
		Для каждого СтрокаТаблицы Из ШаблоныОбъект.ПечатныеФормыИВложения Цикл
			Если Не СписокКлючей.Найти(СтрокаТаблицы.Идентификатор) = Неопределено Тогда
				СтрокаТаблицы.Идентификатор = ИдентификаторыДляЗамены[СтрокаТаблицы.Идентификатор];
			КонецЕсли;
		КонецЦикла;
		
		ШаблоныОбъект.ПодписьИПечать = Истина;
		ШаблоныОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ИдентификаторыДляЗамены()
	
	Результат = Новый Соответствие;
	Результат.Вставить("831ABE39889AD90E6D1105E79B65A9B1", "6941AF414CF37058D91087B192D6B914");
	Результат.Вставить("6AD90997A1723D015ACF186E58F93703", "42E493BC869A02EEAF72B4B72FCDFC4A");
	Результат.Вставить("87C7C7B7A382BA5510EAF52D9C26B296", "FBE89FE13A439DE4538B8CA0E1C1574B");
	Результат.Вставить("51D28AF4105D9B3B7D61F5B604FEE738", "8A4F7A2571528CD9DC6048B4B88A117D");
	Результат.Вставить("9D0162F57BFF09AAA9A6020BF1B901D8", "25B772A2AAE6C12AC0B66E2B4594EA75");
	Результат.Вставить("4662701781FA83213FA93D40114AC763", "DE1FBB05B1B04285D8E05DDE5596048C");
	Результат.Вставить("3E3FC90DB533A6CF482B55EE4ADF5A35", "18ADB8B6078B01C6583DA62834C6D756");
	Результат.Вставить("E892DF95DF3E28C5840C64A6C87F1894", "1EFC059F980AEF2878BE1818DF950DFA");
	Результат.Вставить("AC20335F51C60ECFCC5A8246D1407672", "2732F07232DE2801BD0714C4429630BC");
	Результат.Вставить("574AF1FA45236501D7A8830D73CF5191", "094573DBEF7AEF801FC770BB3BD90065");
	Результат.Вставить("FEB75B283217A11104A177A94F3793DA", "BEA3461F492F85B47B55F8E2C9CA0C6B");
	Результат.Вставить("67F7DC46A9682A3B91A963244ABA5A4E", "543D06C355703A8564C6CC6524EF1593");
	Результат.Вставить("9B5E9B294BFB26644C1F831F76B788AA", "7F085AFD8DF587591D975F0E230EB297");
	Результат.Вставить("9BE396AA9681E192F0FA6A36A5ED3AE2", "E82F3CC2CFA9D0A802C2577661009D00");
	Результат.Вставить("9DB570BEC4BE948F85358CB3E272C976", "F5C4901AD89222C374E7799870C8C2D6");
	Результат.Вставить("95692864C1B9B848D2696CF012198472", "728ED7B4CC432D9113640A5EAAF31AE2");
	Результат.Вставить("69749A46561E3021BF239ACC9C8D8FCB", "6444CF3977EDE4332AB2B709A9954185");
	Результат.Вставить("505225C820A048A5763024504E45957F", "07691C8060031E8CDD5BDFEA5C8E31D8");
	Результат.Вставить("AAC4E86581C746353D2C65F639BC0175", "DB5D071244AC04CF5D7FB19C93718F7C");
	Результат.Вставить("9441807C6D2755FEE93B917CBFE56796", "16560876FDA7DFAABED126DA3FC3C76C");
	Результат.Вставить("175B60869D8DD82B33BC764130FEC41D", "EE0C1E8D47FD67BFBAA36D50FDD0C90A");
	Возврат Результат;
	
КонецФункции

Процедура ОбъединитьДеревоСкидокИБонусов(ПараметрыОбработчика) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АвтоматическиеСкидки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.АвтоматическиеСкидки КАК АвтоматическиеСкидки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БонусныеПрограммы КАК БонусныеПрограммы
	|		ПО АвтоматическиеСкидки.БонуснаяПрограмма = БонусныеПрограммы.Ссылка
	|ГДЕ
	|	АвтоматическиеСкидки.Действует";
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьБонусныеПрограммы") Тогда
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		Возврат;
	ИначеЕсли РезультатЗапроса.Пустой() Тогда
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	КорневоеПравилоСкидок = Константы.ВариантыСовместногоПримененияСкидокНаценок.Получить();
	КорневоеПравилоБонусов = Константы.Удалить_ВариантыСовместногоПримененияНачисленийБонусов.Получить();
	Блокировка = Новый БлокировкаДанных();
	ЭлементБлокировки = Блокировка.Добавить("Справочник.АвтоматическиеСкидки");
	ЭлементБлокировки = Блокировка.Добавить("Константа.ВариантыСовместногоПримененияСкидокНаценок");
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		Константы.ВариантыСовместногоПримененияСкидокНаценок.Установить(Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Умножение);

		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтоматическиеСкидки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.АвтоматическиеСкидки КАК АвтоматическиеСкидки
		|		Внутреннее СОЕДИНЕНИЕ Справочник.БонусныеПрограммы КАК БонусныеПрограммы
		|		ПО АвтоматическиеСкидки.БонуснаяПрограмма = БонусныеПрограммы.Ссылка
		|где
		|	АвтоматическиеСкидки.Родитель = Значение(Справочник.АвтоматическиеСкидки.ПустаяСсылка)
		|	И НЕ АвтоматическиеСкидки.СпособПредоставления = ЗНАЧЕНИЕ(Перечисление.СпособыПредоставленияСкидокНаценок.Округление)
		|	И БонусныеПрограммы.УдалитьНачислятьБонусыДоСкидок";
		КорневыеБонусы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		Если КорневыеБонусы.Количество() > 0 Тогда
			КорневаяГруппаБонусовДоСкидок = Справочники.АвтоматическиеСкидки.СоздатьГруппу();
			КорневаяГруппаБонусовДоСкидок.Наименование = НСтр("ru = 'Бонусы до скидок'");
			КорневаяГруппаБонусовДоСкидок.ЭтоПравилоНачисленияБонусов = Истина;
			КорневаяГруппаБонусовДоСкидок.УдалитьРеквизитДопУпорядочивания = 1;
			КорневаяГруппаБонусовДоСкидок.ВариантСовместногоПрименения = КорневоеПравилоБонусов;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(КорневаяГруппаБонусовДоСкидок);
	
			Для Каждого КорневоеНачисление Из КорневыеБонусы Цикл
				ПравилоНачисленияБонусов = КорневоеНачисление.ПолучитьОбъект();
				ПравилоНачисленияБонусов.Родитель = КорневаяГруппаБонусовДоСкидок.Ссылка;
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПравилоНачисленияБонусов);
			КонецЦикла;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтоматическиеСкидки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.АвтоматическиеСкидки КАК АвтоматическиеСкидки
		|ГДЕ
		|	АвтоматическиеСкидки.Родитель = ЗНАЧЕНИЕ(Справочник.АвтоматическиеСкидки.ПустаяСсылка)
		|	И НЕ АвтоматическиеСкидки.ЭтоПравилоНачисленияБонусов
		|	И НЕ АвтоматическиеСкидки.СпособПредоставления = ЗНАЧЕНИЕ(Перечисление.СпособыПредоставленияСкидокНаценок.Округление)";
		КорневыеСкидки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		Если КорневыеСкидки.Количество() > 0 Тогда
			КорневаяГруппаСкидок = Справочники.АвтоматическиеСкидки.СоздатьГруппу();
			КорневаяГруппаСкидок.Наименование = НСтр("ru = 'Автоматические скидки'");
			КорневаяГруппаСкидок.УдалитьРеквизитДопУпорядочивания = 2;
			КорневаяГруппаСкидок.ВариантСовместногоПрименения = КорневоеПравилоСкидок;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(КорневаяГруппаСкидок);
			Для Каждого КорневаяСкидка Из КорневыеСкидки Цикл
				Скидка = КорневаяСкидка.ПолучитьОбъект();
				Скидка.Родитель = КорневаяГруппаСкидок.Ссылка;
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Скидка);
			КонецЦикла;
		КонецЕсли;
		 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтоматическиеСкидки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.АвтоматическиеСкидки КАК АвтоматическиеСкидки
		|		Внутреннее СОЕДИНЕНИЕ Справочник.БонусныеПрограммы КАК БонусныеПрограммы
		|		ПО АвтоматическиеСкидки.БонуснаяПрограмма = БонусныеПрограммы.Ссылка
		|где
		|	АвтоматическиеСкидки.Родитель = Значение(Справочник.АвтоматическиеСкидки.ПустаяСсылка)
		|	И НЕ АвтоматическиеСкидки.СпособПредоставления = ЗНАЧЕНИЕ(Перечисление.СпособыПредоставленияСкидокНаценок.Округление)
		|	И НЕ БонусныеПрограммы.УдалитьНачислятьБонусыДоСкидок";
		КорневыеБонусы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		Если КорневыеБонусы.Количество() > 0 Тогда
			КорневаяГруппаБонусовПослеСкидок = Справочники.АвтоматическиеСкидки.СоздатьГруппу();
			КорневаяГруппаБонусовПослеСкидок.Наименование = НСтр("ru = 'Бонусы после скидок'");
			КорневаяГруппаБонусовПослеСкидок.ЭтоПравилоНачисленияБонусов = Истина;
			КорневаяГруппаБонусовПослеСкидок.УдалитьРеквизитДопУпорядочивания = 3;
			КорневаяГруппаБонусовПослеСкидок.ВариантСовместногоПрименения = КорневоеПравилоБонусов;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(КорневаяГруппаБонусовПослеСкидок);
	
			Для Каждого КорневоеНачисление Из КорневыеБонусы Цикл
				ПравилоНачисленияБонусов = КорневоеНачисление.ПолучитьОбъект();
				ПравилоНачисленияБонусов.Родитель = КорневаяГруппаБонусовПослеСкидок.Ссылка;
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПравилоНачисленияБонусов);
			КонецЦикла;
		КонецЕсли;

		ЗафиксироватьТранзакцию();
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
	Исключение
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗарегистрироватьИзмененияОбъектовСПредопределеннымиЭлементами(ПараметрыОбработчика) Экспорт
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АвтономнаяРабота.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.АвтономнаяРабота КАК АвтономнаяРабота
	|ГДЕ
	|	НЕ АвтономнаяРабота.ЭтотУзел
	|	И НЕ АвтономнаяРабота.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Полный.Ссылка
	|ИЗ
	|	ПланОбмена.Полный КАК Полный
	|ГДЕ
	|	НЕ Полный.ЭтотУзел
	|	И НЕ Полный.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СОтборами.Ссылка
	|ИЗ
	|	ПланОбмена.СОтборами КАК СОтборами
	|ГДЕ
	|	НЕ СОтборами.ЭтотУзел
	|	И НЕ СОтборами.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Ссылка, Метаданные.ПланыВидовХарактеристик.ОбъектыАдресацииЗадач);
		ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Ссылка, Метаданные.Справочники.РолиИсполнителей);
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьФункциональнуюОпциюУчетЦенПродажи() Экспорт
		
	ЭтоБизнесПриложение = ВозможностиПриложения.ЭтоБизнесПриложение();
	Если НЕ ЭтоБизнесПриложение Тогда 
		
		МенеджерКонстанты = Константы.ФункциональнаяОпцияУчетЦенПродажи.СоздатьМенеджерЗначения();
		МенеджерКонстанты.Значение = Ложь;  
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерКонстанты);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура УстановитьСлужебнуюФункциональнуюОпциюИспользоватьСинхронизациюДанныхВПриложении() Экспорт
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;   
	
 	ЭтоБизнесПриложение = ВозможностиПриложения.ЭтоБизнесПриложение();
	ЭтоРозница = Константы.ФункциональнаяОпцияУчетРозничныхПродаж.Получить();
	
	Если ЭтоБизнесПриложение И ЭтоРозница Тогда
		Константы.ФункциональнаяОпцияИспользоватьСинхронизациюДанныхВПриложении.Установить(Истина);
	КонецЕсли;
	
КонецПроцедуры  

Процедура УстановитьСлужебнуюФункциональнуюОпциюОтображатьКомандуСменыПароля() Экспорт
	
 	ЭтоБизнесПриложение = ВозможностиПриложения.ЭтоБизнесПриложение();
	
	Если ЭтоБизнесПриложение Тогда
		Константы.ФункциональнаяОпцияОтображатьКомандуСменыПароля.Установить(Ложь); 
	Иначе
		Константы.ФункциональнаяОпцияОтображатьКомандуСменыПароля.Установить(Истина); 
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьВидыНалоговПоНДФЛ_2025(ПараметрыОбработчика) Экспорт
		
	ЕстьОшибки = Ложь;  
	
	РегистрыСведений.ЗначенияКБК.ЗагрузитьЗначенияКБК();

	НачатьТранзакцию();
	
	Попытка
		
		КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
		
		// НДФЛ    
		
		ЭлементНДФЛСотрудники = Справочники.ВидыНалогов.НДФЛСотрудники.ПолучитьОбъект();
		ЭлементНДФЛСотрудники.Наименование = НСтр("ru = 'НДФЛ исчисленный налоговым агентом'",
		КодОсновногоЯзыка);
		ЭлементНДФЛСотрудники.Код = "00-000008";        
		ЭлементНДФЛСотрудники.КодБК = "18210102010011000110";
		ЭлементНДФЛСотрудники.ВидНалога = Перечисления.ВидыНалогов.НДФЛ; 
		Справочники.ВидыНалогов.ЗаполнитьСчетаУчета(ЭлементНДФЛСотрудники);
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементНДФЛСотрудники);
		
		// 15%
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины = Справочники.ВидыНалогов.НДФЛДоходыСвышеПредельнойВеличины.ПолучитьОбъект();
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины.Наименование = НСтр("ru = 'НДФЛ исчисленный налоговым агентом (15%)'",
		КодОсновногоЯзыка);
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины.Код = "00-000017";   
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины.КодБК = "18210102080011000110";
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины.ВидНалога = Перечисления.ВидыНалогов.НДФЛ; 
		Справочники.ВидыНалогов.ЗаполнитьСчетаУчета(ЭлементНДФЛСотрудникиСвышеПредельнойВеличины);
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементНДФЛСотрудникиСвышеПредельнойВеличины);
		
		// 18%
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины18 = Справочники.ВидыНалогов.НДФЛДоходыСвышеПредельнойВеличины18.ПолучитьОбъект();
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины18.Наименование = НСтр("ru = 'НДФЛ исчисленный налоговым агентом (18%)'",
		КодОсновногоЯзыка);
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины18.Код = "00-000026";    
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины18.КодБК = "18210102150011000110";
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины18.ВидНалога = Перечисления.ВидыНалогов.НДФЛ; 
		Справочники.ВидыНалогов.ЗаполнитьСчетаУчета(ЭлементНДФЛСотрудникиСвышеПредельнойВеличины18);
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементНДФЛСотрудникиСвышеПредельнойВеличины18);

		// 20%
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины20 = Справочники.ВидыНалогов.НДФЛДоходыСвышеПредельнойВеличины20.ПолучитьОбъект();
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины20.ИмяПредопределенныхДанных = "НДФЛДоходыСвышеПредельнойВеличины20";
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины20.Наименование = НСтр("ru = 'НДФЛ исчисленный налоговым агентом (20%)'",
		КодОсновногоЯзыка);
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины20.Код = "00-000027";
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины20.КодБК = "18210102160011000110";
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины20.ВидНалога = Перечисления.ВидыНалогов.НДФЛ;  
		Справочники.ВидыНалогов.ЗаполнитьСчетаУчета(ЭлементНДФЛСотрудникиСвышеПредельнойВеличины20);
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементНДФЛСотрудникиСвышеПредельнойВеличины20);
		
		// 22%
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины22 = Справочники.ВидыНалогов.НДФЛДоходыСвышеПредельнойВеличины22.ПолучитьОбъект();
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины22.ИмяПредопределенныхДанных = "НДФЛДоходыСвышеПредельнойВеличины22";
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины22.Наименование = НСтр("ru = 'НДФЛ исчисленный налоговым агентом (22%)'",
		КодОсновногоЯзыка);
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины22.Код = "00-000028"; 
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины22.КодБК = "18210102170011000110";
		ЭлементНДФЛСотрудникиСвышеПредельнойВеличины22.ВидНалога = Перечисления.ВидыНалогов.НДФЛ; 
		Справочники.ВидыНалогов.ЗаполнитьСчетаУчета(ЭлементНДФЛСотрудникиСвышеПредельнойВеличины22);
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементНДФЛСотрудникиСвышеПредельнойВеличины22);
		
		// Конец НДФЛ   	
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ИмяСобытия = НСтр("ru = 'Выполнение обработчика обновления видов налогов по НДФЛ'", 
		ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		ЕстьОшибки = Истина;
		
	КонецПопытки;
	
	ПараметрыОбработчика.ОбработкаЗавершена = НЕ ЕстьОшибки;
	
КонецПроцедуры


Процедура ОбновитьСрокПоЗадаче6НДФЛ() Экспорт
	
	Справочники.КалендарьПодготовкиОтчетности.ОбновитьСрокВЗадачеКалендаря(
	Справочники.ЗадачиКалендаряПодготовкиОтчетности.Форма6НДФЛ, Дата("20260128"), Дата("20260225")); 
	
КонецПроцедуры

Процедура УстановитьСлужебнуюВозможностьУправленияЗапасами() Экспорт
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;
	
 	ЭтоБизнесПриложение = ВозможностиПриложения.ЭтоБизнесПриложение();
	ИспользуютсяВозможностиЗапасов = Константы.ИспользоватьПодсистемуСклад.Получить() ИЛИ Константы.ИспользоватьПодсистемуЗакупки.Получить();
	
	Если ЭтоБизнесПриложение И ИспользуютсяВозможностиЗапасов Тогда
		Константы.ИспользоватьУправлениеЗапасами.Установить(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
