#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МоментОткрытияФормы = ТекущаяДатаСеанса();
	ЗагрузитьНастройкиИнтеграции();
	
	СформироватьСписокОрганизаций();
	СформироватьСписокРазделовУчета();
	
	Если Не ВосстановитьТекущиеНастройкиОтражения() Тогда
		Заголовок = НСтр("ru = 'Бухгалтерия: Начальная настройка'");
		
		Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
			Если ДоступныеОрганизации.Количество() = 1 Тогда
				ДоступныеОрганизации[0].Пометка = Истина;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Заголовок = НСтр("ru = 'Бухгалтерия: Настройки'");
	КонецЕсли;
	
	СформироватьЭлементыУправленияОрганизаций();
	СформироватьЭлементыУправленияРазделовУчета();
	
	Для Каждого СтрокаОрганизации Из ДоступныеОрганизации Цикл
		ПроверитьЗаполнениеОбязательныхРеквизитовОрганизацииПриНеобходимости(СтрокаОрганизации.КлючСтроки);
		УстановитьОформлениеЭлементовОрганизации(СтрокаОрганизации.КлючСтроки);
	КонецЦикла;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
		Элементы.ДекорацияЗаголовокОрганизации.Заголовок = НСтр("ru = 'Организации'");
	Иначе
		Элементы.ДекорацияЗаголовокОрганизации.Заголовок = НСтр("ru = 'Организация'");
	КонецЕсли;
	
	Если ОтражениеВключено Тогда
		Заголовок = НСтр("ru = 'Бухгалтерия: Настройки'");
		
		Элементы.КомандаОтразитьДокументы.Видимость = Ложь;
		Элементы.КомандаНачатьРаботу.Видимость = Ложь;
		Элементы.КомандаОрганизацииВыбраны.Видимость = Ложь;
		Элементы.КомандаСохранитьНастройки.Видимость = Истина;          
		Элементы.ГруппаОтражениеВключено.Видимость = Истина;           
		
		Элементы.ГруппаИнформация.Видимость = Ложь;
		Элементы.ГруппаПоздравление.Видимость = Ложь;
		Элементы.ГруппаНастройкиОтраженияВторойЭтап.Видимость = Истина;
		
		КэшДатаНачалаОтражения = ДатаНачалаОтражения;
		КэшДоступныеОрганизации.Загрузить(ДоступныеОрганизации.Выгрузить());
		КэшРазделыУчета.Загрузить(РазделыУчета.Выгрузить());
		
	Иначе
		Заголовок = НСтр("ru = 'Бухгалтерия: Начальная настройка'");
		
		Элементы.КомандаОтразитьДокументы.Видимость = Истина;
		Элементы.КомандаНачатьРаботу.Видимость = Истина;
		Элементы.КомандаОрганизацииВыбраны.Видимость = Ложь;
		Элементы.КомандаСохранитьНастройки.Видимость = Истина;   
		Элементы.ГруппаОтражениеВключено.Видимость = Ложь;     
		Элементы.ГруппаКомандаНачать.Доступность = Ложь;

		Элементы.ГруппаИнформация.Видимость = Истина;
		Элементы.ГруппаПоздравление.Видимость = Истина;
		Элементы.ГруппаНастройкиОтраженияВторойЭтап.Видимость = Ложь;
		
		ДатаНачалаОтражения = ТекущаяДатаСеанса();  
	КонецЕсли;
	
	ПриИзмененииДатыНачалаОтраженияНаСервере();     
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(ТекущаяНастройка) Тогда
		ОбновитьСостояниеУчетнойПолитикиОрганизацийПриОткрытии();
	КонецЕсли;
	
	Если ОтражениеВключено Тогда
		ПолучитьПакетСопоставленияОбработан();
		Элементы.ГруппаНастройкиОтраженияВторойЭтап.ТекущаяСтраница = Элементы.СтраницаОжидание;
		Элементы.ПодстраницыОжидания.ТекущаяСтраница = Элементы.СтраницаПолученияСопоставления;
	Иначе
		Если ЗначениеЗаполнено(НомерОбласти) Тогда
			ПолучитьНастройкиБухгалтерии(Истина);
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ГруппаКомандаНачать.Доступность = ДоступностьГруппыКомандНачалаРаботы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СовместноеИспользование.ЗакрытаФормаНастройкиУчетнойПолитикиОрганизации" Тогда
		ИдентификаторОрганизации = Параметр.Получить("ИдентификаторОрганизации");
		КлючОрганизации = ДоступныеОрганизации.НайтиСтроки(Новый Структура("ПубличныйИдентификатор", ИдентификаторОрганизации))[0].КлючСтроки;
		
		УстановитьОформлениеЭлементовОрганизации(КлючОрганизации, Истина);
		ПолучитьСостояниеУчетнойПолитикиОрганизаций(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КлючОрганизации));
	ИначеЕсли ИмяСобытия = "СовместноеИспользование.ЗакрытаФормаНастройкиСистемыНалогобложенияОрганизации" Тогда
		ИдентификаторОрганизации = Параметр.Получить("ИдентификаторОрганизации");
		КлючОрганизации = ДоступныеОрганизации.НайтиСтроки(Новый Структура("ПубличныйИдентификатор", ИдентификаторОрганизации))[0].КлючСтроки;
		
		УстановитьОформлениеЭлементовОрганизации(КлючОрганизации, Истина);
		ПолучитьСостояниеУчетнойПолитикиОрганизаций(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КлючОрганизации));
	ИначеЕсли ИмяСобытия = "СовместноеИспользование.ЗакрытПомощникСопоставленияОбъектов" Тогда
		Если Элементы.ГруппаНастройкиОтраженияВторойЭтап.Видимость Тогда
			Если Элементы.ГруппаНастройкиОтраженияВторойЭтап.ТекущаяСтраница = Элементы.СтраницаТребуетсяСопоставление Тогда
				Элементы.ГруппаНастройкиОтраженияВторойЭтап.ТекущаяСтраница = Элементы.СтраницаПараметрыДокументов;
			КонецЕсли;
			Если Элементы.ГруппаНастройкиОтраженияВторойЭтап.ТекущаяСтраница = Элементы.СтраницаУспех Тогда   
				ОткрытьФорму("Обработка.ОтражениеДокументовВБухгалтерии.Форма.РазделБухгалтерия");	
				Закрыть();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если СтрНачинаетсяС(НавигационнаяСсылкаФорматированнойСтроки, "НастройкаУчетнойПолитики_") Тогда
		СтандартнаяОбработка = Ложь;
		
		КлючОрганизации = СтрРазделить(НавигационнаяСсылкаФорматированнойСтроки, "_")[1];
		СтрокаОрганизации = ДоступныеОрганизации.НайтиСтроки(Новый Структура("КлючСтроки", КлючОрганизации))[0];
		
		ШаблонСсылки = "СовместноеИспользование/НастройкиУчетнойПолитикиОрганизации?uuid=%1&period=%2";
		
		СовместноеИспользованиеКлиент.ПерейтиПоНавигационнойСсылкеВнешнегоПриложения(
			СтрШаблон(ШаблонСсылки, СтрокаОрганизации.ПубличныйИдентификатор, Формат(ДатаНачалаОтражения, "ДФ=yyyy-MM-dd")),
			"БухгалтерияПредприятия");
		
	ИначеЕсли СтрНачинаетсяС(НавигационнаяСсылкаФорматированнойСтроки, "НастройкаСистемыНалогообложения_") Тогда
		СтандартнаяОбработка = Ложь;
		
		КлючОрганизации = СтрРазделить(НавигационнаяСсылкаФорматированнойСтроки, "_")[1];
		СтрокаОрганизации = ДоступныеОрганизации.НайтиСтроки(Новый Структура("КлючСтроки", КлючОрганизации))[0];
		
		ШаблонСсылки = "СовместноеИспользование/НастройкиСистемыНалогобложенияОрганизации?uuid=%1";
		
		СовместноеИспользованиеКлиент.ПерейтиПоНавигационнойСсылкеВнешнегоПриложения(
			СтрШаблон(ШаблонСсылки, СтрокаОрганизации.ПубличныйИдентификатор),
			"БухгалтерияПредприятия");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтражениеВключеноПриИзменении(Элемент)
	
	Если ОтражениеВключено Тогда
		Элементы.ДекорацияОжиданиеИспользоватьОтражение.Видимость = Истина;
		Элементы.ОтражениеВключено.Доступность = Ложь;
		
		ПодключитьОбработчикОжидания("ВключитьМеханизмОтраженияДокументов", 0.1, Истина);
	Иначе
		Если Не ТекущаяНастройка.Пустая() Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения(
				"ВопросОтражениеВключеноЗавершение",
				ЭтотОбъект);
			
			ТекстВопроса = НСтр("ru = 'Это отключит процесс отражения и удалит сделанные настройки. Продолжить?'");
			ПоказатьВопрос(ОписаниеОповещения,
				ТекстВопроса,
				РежимДиалогаВопрос.ДаНет, 0);
		КонецЕсли;  
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаОтраженияПриИзменении(Элемент)
	
	Элементы.ГруппаКалендарьДатаНачалаОтражения.Скрыть();

	ПриИзмененииДатыНачалаОтраженияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ФлажокРазделаУчетаПриИзменении(Элемент)
	
	Если Не СтрНачинаетсяС(Элемент.Имя, "Раздел_") Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторРаздела = СтрРазделить(Элемент.Имя, "_")[1];
	
	СтрокиРазделыУчета = РазделыУчета.НайтиСтроки(Новый Структура("Идентификатор", ИдентификаторРаздела));
	
	Элементы["ДекорацияНадписьРазделУчета_" + ИдентификаторРаздела].Доступность = СтрокиРазделыУчета[0].Пометка;
	Элементы["КомандаВидыДокументов_" + ИдентификаторРаздела].Доступность = СтрокиРазделыУчета[0].Пометка;   

	ФлажокРазделаУчетаПриИзмененииНаСервере(СтрокиРазделыУчета[0].Идентификатор, СтрокиРазделыУчета[0].ПоВсемДокументам, СтрокиРазделыУчета[0].Пометка);
	
КонецПроцедуры

  &НаСервере
Процедура ФлажокРазделаУчетаПриИзмененииНаСервере(ИдентификаторРаздела, ПоВсемДокументам, Пометка)
	
	ВыборВидовДокументов = ПодготовитьВыборВидовДокументовПоРазделу(ИдентификаторРаздела);
	СписокВыбора = ВыборВидовДокументов.СписокВыбора;
	Если ПоВсемДокументам Тогда
		Для Каждого Элемент Из СписокВыбора Цикл
			Элемент.Пометка = Пометка;
		КонецЦикла;
	КонецЕсли; 
	
	КоличествоКВыгрузке = ПодсчитатьКоличествоДокументовПоРазделу(СписокВыбора, ИдентификаторРаздела);     
	УстановитьСвойстваСтрокиРаздела(ИдентификаторРаздела, КоличествоКВыгрузке);    
	УстановитьСвойстваКомандыОтразитьДокументы();
	
КонецПроцедуры

&НаКлиенте
Процедура ФлажокОрганизацииПриИзменении(Элемент)
	
	Если Не СтрНачинаетсяС(Элемент.Имя, "Организация_") Тогда
		Возврат;
	КонецЕсли;
	
	КлючОрганизации = СтрРазделить(Элемент.Имя, "_")[1];
	
	Если Элементы.ГруппаНастройкиОтраженияВторойЭтап.Видимость Тогда
		ПроизвестиПолныйПересчетДокументовПоРазделам();
		УстановитьСвойстваКомандыОтразитьДокументы();   
		БылиИзменения = СравнитьКэшОрганизацийИРеквизиты(Истина);
		Если БылиИзменения Тогда
			Элементы.КомандаОрганизацииВыбраны.Видимость = Истина;    
			Элементы.КомандаОтразитьДокументы.Доступность = Ложь;
			Элементы.КомандаСохранитьНастройки.Доступность = Ложь;
		Иначе
			Элементы.КомандаОрганизацииВыбраны.Видимость = Ложь;  
			Элементы.КомандаОтразитьДокументы.Доступность = Истина;
			Элементы.КомандаСохранитьНастройки.Доступность = Истина;
		КонецЕсли;
	КонецЕсли;
	УстановитьОформлениеЭлементовОрганизации(КлючОрганизации, Ложь);

	Элементы.ГруппаКомандаНачать.Доступность = ДоступностьГруппыКомандНачалаРаботы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаНачатьРаботу(Команда)   
	
	Элементы.ГруппаКомандаНачать.Доступность = Ложь;   
	ИзменитьДоступностьФлажковОрганизаций(Ложь);
	Элементы.ГруппаДатаНачалаОтражения.Доступность = Ложь;   
	
	Элементы.ГруппаНастройкиОтраженияВторойЭтап.Видимость = Истина;
	Элементы.ГруппаНастройкиОтраженияВторойЭтап.ТекущаяСтраница = Элементы.СтраницаОжидание;
	Элементы.ПодстраницыОжидания.ТекущаяСтраница = Элементы.СтраницаНастройкиСоединения;
	
	// 1. Соединение с корреспондентом, запись настроек
	ВключитьМеханизмОтраженияДокументов();
	
КонецПроцедуры  

&НаКлиенте
Процедура КомандаОрганизацииВыбраны(Команда)

	// 1. Сохранить выбранные настройки.
	СохранитьВыбранныеНастройкиНаСервере();   
	
	// 2. Проброс и пометка организаций
	ВключитьОтражениеОрганизаций();    

	Элементы.КомандаОтразитьДокументы.Доступность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура КомандаОтразитьДокументы(Команда)
	
	// Проверка активности обмена
	ОбработкаОжиданияФоновогоОбменаПоСценарию();

КонецПроцедуры

&НаКлиенте
Процедура КомандаОтразитьДокументыНаСервере()
	
	// 1. Сохранить выбранные настройки.
	СохранитьВыбранныеНастройкиНаСервере();
	
	// 2. Начальная регистрация изменений.
	ВыполнитьРегистрациюИзмененийДляНачальнойВыгрузки();          
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьНастройки(Команда)
	
	СохранитьВыбранныеНастройкиНаСервере();  
	ВыполнитьРегистрациюИзмененийДляНачальнойВыгрузки();          
	
	ОткрытьФорму("Обработка.ОтражениеДокументовВБухгалтерии.Форма.РазделБухгалтерия");	
	Закрыть();
	
КонецПроцедуры    

&НаКлиенте
Процедура КомандаТехническиеНастройки(Команда)     
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Ключ", УзелОбмена);
	
	ОткрытьФорму("ПланОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.Форма.ФормаУзла",
		ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщийОбработчикКомандыОрганизации(Команда)
	
	Если Не СтрНачинаетсяС(Команда.Имя, "КомандаОрганизации_") Тогда
		Возврат;
	КонецЕсли;
	
	КлючОрганизации = СтрРазделить(Команда.Имя, "_")[1];
	
	СтрокаОрганизации = ДоступныеОрганизации.НайтиСтроки(Новый Структура("КлючСтроки", КлючОрганизации))[0];
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("КлючОрганизации", КлючОрганизации);
	
	ОткрытьФорму("Справочник.Организации.ФормаОбъекта",
		Новый Структура("Ключ", СтрокаОрганизации.Ссылка),
		ЭтотОбъект,
		,
		,
		,
		Новый ОписаниеОповещения("ОбщийОбработчикКомандыОрганизацииЗакрытие", ЭтотОбъект, ДополнительныеПараметры));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщийОбработчикКомандыВидыДокументов(Команда)
	
	Если Не СтрНачинаетсяС(Команда.Имя, "КомандаВидыДокументов_") Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторРаздела = СтрРазделить(Команда.Имя, "_")[1];
	
	СтрокиРазделы = РазделыУчета.НайтиСтроки(Новый Структура("Идентификатор", ИдентификаторРаздела));
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИдентификаторРаздела", ИдентификаторРаздела);
	ДополнительныеПараметры.Вставить("ИмяКоманды", Команда.Имя);
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("ПоВсемДокументам", НСтр("ru = 'Все документы'"), СтрокиРазделы[0].ПоВсемДокументам);
	СписокВыбора.Добавить("ВыбратьИзСписка", НСтр("ru = 'Выбрать из списка'"), Не СтрокиРазделы[0].ПоВсемДокументам);
	
	ПоказатьВыборИзМеню(
		Новый ОписаниеОповещения("ВыборИзМенюОтборПоВидамДокументовЗавершение", ЭтотОбъект, ДополнительныеПараметры),
		СписокВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПерейтиВСопоставление(Команда)
	ПерейтиВПомощникСопоставленияОбъектовБухгалтерии();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПерейтиВЖурналОпераций(Команда)    
	СсылкаДляПерехода = "e1cib/command/ОбщаяКоманда.ЖурналОпераций";   
	СовместноеИспользованиеКлиент.ПерейтиПоНавигационнойСсылкеВнешнегоПриложения(
		СсылкаДляПерехода,
		"БухгалтерияПредприятия",
		Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПерейтиВЖурналРегистрации(Команда)   

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДатаНачала", МоментОткрытияФормы);
	ПараметрыФормы.Вставить("ДатаОкончания", КонецДня(МоментОткрытияФормы));
	ПараметрыФормы.Вставить("Уровень", "Ошибка");
	ПараметрыФормы.Вставить("ЗапускатьНеВФоне", Истина);
	ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(ПараметрыФормы);  
	
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура КомандаПерейтиВПолныйИнтерфейс(Команда)
	СсылкаДляПерехода = "e1cib/command/Обработка.ПанельАдминистрированияБП.Команда.Интерфейс";   
	СовместноеИспользованиеКлиент.ПерейтиПоНавигационнойСсылкеВнешнегоПриложения(
		СсылкаДляПерехода,
		"БухгалтерияПредприятия",
		Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ОбменПоУзлуЗапланирован(Узел)
	
	УстановитьПривилегированныйРежим(Истина);
	ОбменЗапланирован = ОбменДаннымиВнутренняяПубликация.ПоУзлуЗапланированОбмен(Узел);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ОбменЗапланирован;
	
КонецФункции  

&НаКлиенте
Процедура ОбработкаОжиданияФоновогоОбменаПоСценарию()

	ОбменЗапланирован = ОбменПоУзлуЗапланирован(УзелОбмена);
	Если ОбменЗапланирован Тогда   
		Элементы.ГруппаНастройкиОтраженияВторойЭтап.ТекущаяСтраница = Элементы.СтраницаОжидание;
		Элементы.ПодстраницыОжидания.ТекущаяСтраница = Элементы.СтраницаОжиданиеФоновогоОбмена;  
		
		ПодключитьОбработчикОжидания("ОбработкаОжиданияФоновогоОбменаПоСценарию", 20, Истина);   
		Возврат;    
	Иначе  
		
		// 1 и 2 этапы отражения
		Элементы.ГруппаНастройкиОтраженияВторойЭтап.ТекущаяСтраница = Элементы.СтраницаОжидание;
		Элементы.ПодстраницыОжидания.ТекущаяСтраница = Элементы.СтраницаРегистрацияКОтправке;
		КомандаОтразитьДокументыНаСервере();
		
		// 3. Запуск обмена. 
		ДлительнаяОперация = Неопределено;
		Элементы.ГруппаНастройкиОтраженияВторойЭтап.ТекущаяСтраница = Элементы.СтраницаОжидание;
		Элементы.ПодстраницыОжидания.ТекущаяСтраница = Элементы.СтраницаОтправкаДокументов;
		ПодключитьОбработчикОжидания("НачатьСинхронизацию", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция СравнитьКэшИРеквизиты()    
	
	БылиДополняющиеИзменения = СравнитьКэшОрганизацийИРеквизиты();
	
	Для Каждого СтрокаРаздела Из РазделыУчета Цикл     
		СтрокиКэша = КэшРазделыУчета.НайтиСтроки(Новый Структура("Идентификатор", СтрокаРаздела.Идентификатор)); 
		Если СтрокиКэша.Количество() = 1 Тогда  
			СтрокаКэша = СтрокиКэша[0];
			Если СтрокаРаздела.Пометка И Не СтрокаКэша.Пометка Тогда
				БылиИзменения = Истина;
				БылиДополняющиеИзменения = Истина;
			ИначеЕсли Не СтрокаРаздела.Пометка И СтрокаКэша.Пометка Тогда
				БылиИзменения = Истина; 
			КонецЕсли;
		ИначеЕсли СтрокиКэша.Количество() = 0 Тогда  
			БылиИзменения = Истина;
			БылиДополняющиеИзменения = Истина;
		КонецЕсли;
	КонецЦикла;   
	
	Если ДатаНачалаОтражения < КэшДатаНачалаОтражения Тогда
		БылиИзменения = Истина;
		БылиДополняющиеИзменения = Истина;
	ИначеЕсли ДатаНачалаОтражения > КэшДатаНачалаОтражения Тогда
		БылиИзменения = Истина; 
	КонецЕсли;   
	
	Возврат БылиДополняющиеИзменения;
	
КонецФункции

&НаСервере
Функция СравнитьКэшОрганизацийИРеквизиты(ВсеИзменения = Ложь)    
	
	БылиИзменения = Ложь;
	БылиДополняющиеИзменения = Ложь;
	Для Каждого СтрокаОрганизации Из ДоступныеОрганизации Цикл     
		СтрокиКэша = КэшДоступныеОрганизации.НайтиСтроки(Новый Структура("КлючСтроки", СтрокаОрганизации.КлючСтроки)); 
		Если СтрокиКэша.Количество() = 1 Тогда  
			СтрокаКэша = СтрокиКэша[0];
			Если СтрокаОрганизации.Пометка И Не СтрокаКэша.Пометка Тогда
				БылиИзменения = Истина;
				БылиДополняющиеИзменения = Истина;
			ИначеЕсли Не СтрокаОрганизации.Пометка И СтрокаКэша.Пометка Тогда
				БылиИзменения = Истина; 
			КонецЕсли;    
		ИначеЕсли СтрокиКэша.Количество() = 0 Тогда  
			БылиИзменения = Истина;
			БылиДополняющиеИзменения = Истина;
		КонецЕсли;
	КонецЦикла;   

	Если ВсеИзменения Тогда
		Возврат БылиИзменения;
	Иначе
		Возврат БылиДополняющиеИзменения;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ДействияПриВключенииОтраженияДокументовНаСервере()
	
	Отказ = Ложь;
	
	// 1. Сохранить выбранные настройки.
	СохранитьВыбранныеНастройкиНаСервере();
	
	// 2. Планирование обмена.    
	ЗапросСценария = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СценарииОбменовДаннымиНастройкиОбмена.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СценарииОбменовДанными.НастройкиОбмена КАК СценарииОбменовДаннымиНастройкиОбмена
	|ГДЕ
	|	СценарииОбменовДаннымиНастройкиОбмена.УзелИнформационнойБазы = &УзелОбмена");
	ЗапросСценария.УстановитьПараметр("УзелОбмена", УзелОбмена);
	
	Результат = ЗапросСценария.Выполнить();
	Если Результат.Пустой() Тогда
		СценарийОбменаДанными = Справочники.СценарииОбменовДанными.СоздатьЭлемент();
		СценарийОбменаДанными.УстановитьНовыйКод();
		СценарийОбменаДанными.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Автоматическая синхронизация данных с %1'"), Строка(УзелОбмена));
		СценарийОбменаДанными.ИспользоватьРегламентноеЗадание = Истина;
			
		// Создаем регламентное задание.
		Расписание = Справочники.СценарииОбменовДанными.РасписаниеРегламентногоЗаданияПоУмолчанию();
		Справочники.СценарииОбменовДанными.ОбновитьДанныеРегламентногоЗадания(Отказ, Расписание, СценарийОбменаДанными);
		
		Если Не Отказ Тогда
			СтрокаНастройкиОбмена = СценарийОбменаДанными.НастройкиОбмена.Добавить();
			СтрокаНастройкиОбмена.ИдентификаторТранспорта = "SM";
			СтрокаНастройкиОбмена.ВыполняемоеДействие = Перечисления.ДействияПриОбмене.ВыгрузкаДанных;
			СтрокаНастройкиОбмена.УзелИнформационнойБазы = УзелОбмена;
			
			СтрокаНастройкиОбмена = СценарийОбменаДанными.НастройкиОбмена.Добавить();
			СтрокаНастройкиОбмена.ИдентификаторТранспорта = "SM";
			СтрокаНастройкиОбмена.ВыполняемоеДействие = Перечисления.ДействияПриОбмене.ЗагрузкаДанных;
			СтрокаНастройкиОбмена.УзелИнформационнойБазы = УзелОбмена;
			
			СценарийОбменаДанными.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
 Процедура ДействияПриНачалеРаботыПослеСохраненияНастроекНаКлиенте()     

	Элементы.ГруппаНастройкиОтраженияВторойЭтап.Видимость = Истина;
	Элементы.ГруппаНастройкиОтраженияВторойЭтап.ТекущаяСтраница = Элементы.СтраницаОжидание;
	Элементы.ПодстраницыОжидания.ТекущаяСтраница = Элементы.СтраницаОтправкаОрганизаций;
	 
	// 1. Получение настроек бухгалтерии для оценки пустоты  
	 ПолучитьНастройкиБухгалтерии();
	 
КонецПроцедуры      

&НаКлиенте
Процедура ВключитьОтражениеОрганизаций()   
	
	КлючиОрганизацийДляОтправки = Новый Массив;
	КлючиОтмеченныхОрганизаций = Новый Массив;
	МассивОрганизацийДляОтправки = Новый Массив;
	Для Каждого СтрокаОрганизации Из ДоступныеОрганизации.НайтиСтроки(Новый Структура("Пометка", Истина)) Цикл
		КлючиОтмеченныхОрганизаций.Добавить(СтрокаОрганизации.КлючСтроки);
		Если ПустаяСтрока(СтрокаОрганизации.ПубличныйИдентификатор) Тогда
			КлючиОрганизацийДляОтправки.Добавить(СтрокаОрганизации.КлючСтроки);
			МассивОрганизацийДляОтправки.Добавить(СтрокаОрганизации.Ссылка);
		КонецЕсли; 
		УстановитьОформлениеЭлементовОрганизации(СтрокаОрганизации.КлючСтроки, Истина);       
	КонецЦикла;    
	
	Если КлючиОрганизацийДляОтправки.Количество() > 0 Тогда 
		ДлительнаяОперация = ДлительнаяОперацияВыгрузитьНесколькоОрганизаций(УзелОбмена, МассивОрганизацийДляОтправки, УникальныйИдентификатор);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("КлючиОрганизаций", КлючиОрганизацийДляОтправки);
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			ДлительнаяОперация,
			Новый ОписаниеОповещения("ВыгрузитьНесколькоОрганизацийЗавершение", ЭтотОбъект, ДополнительныеПараметры),
			ПараметрыОжидания);    
	Иначе
		ПолучитьСостояниеУчетнойПолитикиОрганизаций(КлючиОтмеченныхОрганизаций);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСинхронизациюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(КраткоеПредставлениеОшибки(Результат.ИнформацияОбОшибке));
		Возврат;
	КонецЕсли;
	
	СинхронизацияВыполнена = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Если СинхронизацияВыполнена Тогда
		ОткрытьФорму("Обработка.ОтражениеДокументовВБухгалтерии.Форма.РазделБухгалтерия");	
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьВыбранныеНастройкиНаСервере()
	
	НачатьТранзакцию();
	Попытка
		НастройкаОбъект = ТекущаяНастройка.ПолучитьОбъект();
		УзелОбъект = УзелОбмена.ПолучитьОбъект();
		
		НастройкаОбъект.ОтражениеВключено = ОтражениеВключено;
		
		НастройкаОбъект.ДатаНачалаОтражения = ДатаНачалаОтражения;
		УзелОбъект.ДатаНачалаВыгрузкиДокументов = ДатаНачалаОтражения;
		
		НастройкаОбъект.Организации.Очистить();
		УзелОбъект.Организации.Очистить();
		Для Каждого СтрокаОрганизация Из ДоступныеОрганизации Цикл
			Если Не СтрокаОрганизация.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = НастройкаОбъект.Организации.Добавить();
			НоваяСтрока.Организация = СтрокаОрганизация.Ссылка;
			
			НоваяСтрока = УзелОбъект.Организации.Добавить();
			НоваяСтрока.Организация = СтрокаОрганизация.Ссылка;
		КонецЦикла;
		УзелОбъект.ИспользоватьОтборПоОрганизациям = УзелОбъект.Организации.Количество() > 0;
		
		НастройкаОбъект.РазделыУчета.Очистить();
		НастройкаОбъект.ВидыДокументов.Очистить();
		
		УзелОбъект.ВидыДокументов.Очистить();
		ДоступныеВидыДокументов = СовместноеИспользование.СоответствиеВидовДокументовИРазделовУчета();
		
		Для Каждого СтрокаРаздел Из РазделыУчета.НайтиСтроки(Новый Структура("Пометка", Истина)) Цикл
			НоваяСтрокаРаздел = НастройкаОбъект.РазделыУчета.Добавить();
			НоваяСтрокаРаздел.Идентификатор = СтрокаРаздел.Идентификатор;
			
			Если Не СтрокаРаздел.ПоВсемДокументам Тогда
				СтрокиВидыДокументов = ВыбранныеВидыДокументов.НайтиСтроки(Новый Структура("РазделУчета", СтрокаРаздел.Идентификатор));
				Для Каждого СтрокаВидыДокументов Из СтрокиВидыДокументов Цикл
					// Настройка отражения.
					НоваяСтрока = НастройкаОбъект.ВидыДокументов.Добавить();
					НоваяСтрока.РазделУчета = СтрокаРаздел.Идентификатор;
					НоваяСтрока.ИдентификаторМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(СтрокаВидыДокументов.ПолноеИмяМетаданных);
					
					// Узел обмена.
					НоваяСтрока = УзелОбъект.ВидыДокументов.Добавить();
					НоваяСтрока.ИмяОбъектаМетаданных = СтрокаВидыДокументов.ИмяОбъекта;
					НоваяСтрока.Представление = СтрокаВидыДокументов.Представление;
				КонецЦикла;
			Иначе
				Для Каждого СтрокаВидыДокументов Из ДоступныеВидыДокументов.НайтиСтроки(Новый Структура("РазделУчета", СтрокаРаздел.Идентификатор)) Цикл
					// Узел обмена.
					НоваяСтрока = УзелОбъект.ВидыДокументов.Добавить();
					НоваяСтрока.ИмяОбъектаМетаданных = СтрокаВидыДокументов.ИмяОбъектаМетаданных;
					НоваяСтрока.Представление = СтрокаВидыДокументов.Представление;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		УзелОбъект.ИспользоватьОтборПоВидамДокументов = УзелОбъект.ВидыДокументов.Количество() > 0;
		
		УзелОбъект.ПравилаОтправкиДокументов = "АвтоматическаяСинхронизация";
		
		НастройкаОбъект.Записать();
		УзелОбъект.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	НастройкиСинхронизации = Новый Структура;
	НастройкиСинхронизации.Вставить("ПравилаОтправкиСправочников", "СинхронизироватьПоНеобходимости");
	НастройкиСинхронизации.Вставить("ПравилаОтправкиДокументов", "АвтоматическаяСинхронизация");
	
	УстановитьПривилегированныйРежим(Истина);
	ОписаниеПодключения = СовместноеИспользованиеИнтеграция.НовоеПодключениеКСервису();
	УстановитьПривилегированныйРежим(Ложь);
	
	Результат = СовместноеИспользованиеИнтеграция.УстановитьНастройкиСовместногоИспользования(ОписаниеПодключения, ТекущаяНастройка, НастройкиСинхронизации);
	
	ОписаниеПодключения.ЗавершитьСеанс = Истина;
	СовместноеИспользованиеИнтеграция.ВерсияИнтерфейса(ОписаниеПодключения);
	
	Если Результат <> Истина Тогда
		ВызватьИсключение НСтр("ru = 'Настройки отражения в бухгалтерии не сохранены.'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРегистрациюИзмененийДляНачальнойВыгрузки()       
	
	СоставПлана = Новый Массив;
	Для Каждого ЭлементСостава Из Метаданные.ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.Состав Цикл
		СоставПлана.Добавить(ЭлементСостава.Метаданные);
	КонецЦикла;

	МассивДокументов = Новый Массив;
	Для Каждого СтрокаДокумента Из ДокументыКВыгрузке Цикл   
		МетаданныеДокумента = СтрокаДокумента.Ссылка.Метаданные();   
		Если СоставПлана.Найти(МетаданныеДокумента) <> Неопределено Тогда
			МассивДокументов.Добавить(СтрокаДокумента.Ссылка);
		КонецЕсли;
	КонецЦикла;   
	Если МассивДокументов.Количество() > 0 Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, МассивДокументов);
		ДокументыКВыгрузке.Очистить();  
	КонецЕсли;
	АктуализироватьКэши();
	ПроизвестиПолныйПересчетДокументовПоРазделам();
	УстановитьСвойстваКомандыОтразитьДокументы(); 
	
КонецПроцедуры    

&НаСервере
Процедура АктуализироватьКэши()
	КэшДатаНачалаОтражения = ДатаНачалаОтражения;
	КэшДоступныеОрганизации.Загрузить(ДоступныеОрганизации.Выгрузить());
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеЭлементовОрганизации(КлючОрганизации, ДлительнаяОперация = Ложь)
	
	ДанныеПоОрганизации = ДоступныеОрганизации.НайтиСтроки(Новый Структура("КлючСтроки", КлючОрганизации))[0];
	
	ИмяФлажка = "Организация_" + КлючОрганизации;
	ЭлементФлажок = Элементы[ИмяФлажка];
	ЭлементНадпись = Элементы["ДекорацияНадписьСтатусОрганизация_" + КлючОрганизации];
	ЭлементКартинка = Элементы["ДекорацияКартинкаСтатусОрганизация_" + КлючОрганизации];

	ЭлементКнопка = Элементы["КомандаОрганизации_" + КлючОрганизации];
	Если ДанныеПоОрганизации.Пометка И Не ДлительнаяОперация Тогда
		ЭлементКнопка.Шрифт = ШрифтыСтиля.ВажнаяНадписьШрифт;
	Иначе
		ЭлементКнопка.Шрифт = ШрифтыСтиля.ОбычныйШрифтТекста;
	КонецЕсли;
	
	ЭлементНадпись.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
	
	Если ДлительнаяОперация Тогда
		ЭлементФлажок.Доступность = Ложь;
		
		ЭлементНадпись.Заголовок = НСтр("ru = 'Проверка настроек...'");
		ЭлементНадпись.Видимость = Истина;
		
		ЭлементКартинка.Видимость = Истина;
		ЭлементКартинка.Картинка = БиблиотекаКартинок.ДлительнаяОперация16;
	Иначе
		ЭлементФлажок.Доступность = Истина;
		
		Если ДанныеПоОрганизации.ЕстьНезаполненныеРеквизиты Тогда
			ЭлементНадпись.Заголовок = ДанныеПоОрганизации.ОшибкиПроверкиЗаполнения;
			ЭлементНадпись.ЦветТекста = ЦветаСтиля.НезаполненныйРеквизит;
			ЭлементНадпись.Видимость = Истина;
			
			ЭлементКартинка.Картинка = БиблиотекаКартинок.РазделУчетаСПредупреждениями;
			ЭлементКартинка.Видимость = Истина;
			Возврат;
		Иначе
			ЭлементНадпись.Заголовок = "";
			ЭлементНадпись.Видимость = Ложь;
			
			ЭлементКартинка.Картинка = БиблиотекаКартинок.РазделУчетаБезПредупреждений;
			ЭлементКартинка.Видимость = Ложь;
		КонецЕсли;
		
		Если Элементы.ГруппаНастройкиОтраженияВторойЭтап.Видимость Тогда
			Если ДанныеПоОрганизации.Пометка Тогда
 				ЭлементКартинка.Видимость = Истина;    
				
				Если ДанныеПоОрганизации.ОшибкаВыгрузки Тогда
					ЭлементКартинка.Картинка = БиблиотекаКартинок.РазделУчетаСПредупреждениями;
					ЭлементНадпись.Заголовок = НСтр("ru = 'Не удалось сравнить сведения'");
					ЭлементНадпись.Видимость = Истина;
				ИначеЕсли ДанныеПоОрганизации.БылЗапросПолитики
					И Не ДанныеПоОрганизации.УчетнаяПолитикаСуществует
					И Не ДанныеПоОрганизации.СистемаНалогообложенияСуществует Тогда
					ЭлементКартинка.Картинка = БиблиотекаКартинок.РазделУчетаСПредупреждениями;
					
					ЭлементНадпись.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
						НСтр("ru = 'Необходимо настроить <a href=""НастройкаУчетнойПолитики_%1"
							">учетную политику</a> и <a href=""НастройкаСистемыНалогообложения_%1"
							">систему налогобложения</a>'"),
						КлючОрганизации);
					ЭлементНадпись.Видимость = Истина;
				ИначеЕсли ДанныеПоОрганизации.БылЗапросПолитики
					И Не ДанныеПоОрганизации.УчетнаяПолитикаСуществует Тогда
					ЭлементКартинка.Картинка = БиблиотекаКартинок.РазделУчетаСПредупреждениями;
					
					ЭлементНадпись.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
						НСтр("ru = 'Необходимо настроить <a href=""НастройкаУчетнойПолитики_%1"">учетную политику</a>'"),
						КлючОрганизации);
					ЭлементНадпись.Видимость = Истина;
				ИначеЕсли ДанныеПоОрганизации.БылЗапросПолитики
					И Не ДанныеПоОрганизации.СистемаНалогообложенияСуществует Тогда
					ЭлементКартинка.Картинка = БиблиотекаКартинок.РазделУчетаСПредупреждениями;
					
					ЭлементНадпись.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
						НСтр("ru = 'Необходимо настроить <a href=""НастройкаСистемыНалогообложения_%1"">систему налогобложения</a>'"),
						КлючОрганизации);
					ЭлементНадпись.Видимость = Истина;
				ИначеЕсли ДанныеПоОрганизации.БылЗапросПолитики Тогда
					ЭлементКартинка.Картинка = БиблиотекаКартинок.РазделУчетаБезПредупреждений;
					ЭлементКартинка.Видимость = Истина;
					
					ЭлементНадпись.Видимость = Ложь;
				Иначе
					ЭлементКартинка.Видимость = Ложь;
				    ЭлементНадпись.Видимость = Ложь;
				КонецЕсли;
			ИначеЕсли ДанныеПоОрганизации.ОшибкаВыгрузки Тогда
 				ЭлементНадпись.Заголовок = НСтр("ru = 'Не удалось сравнить сведения'");
				ЭлементНадпись.ЦветТекста = ЦветаСтиля.НезаполненныйРеквизит;
				ЭлементНадпись.Видимость = Истина;
				
				ЭлементКартинка.Видимость = Истина;    
				ЭлементКартинка.Картинка = БиблиотекаКартинок.РазделУчетаСПредупреждениями;
			Иначе
				ЭлементКартинка.Видимость = Ложь;
				ЭлементНадпись.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьОтражениеОрганизацийЗавершение(КлючиОрганизаций, Успешно = Истина, СообщениеОбОшибке = "")

	Для Каждого КлючОрганизации Из КлючиОрганизаций Цикл 
		СтрокиОрганизации = ДоступныеОрганизации.НайтиСтроки(Новый Структура("КлючСтроки", КлючОрганизации));
		СтрокиОрганизации[0].Пометка = Успешно;   
		СтрокиОрганизации[0].ОшибкаВыгрузки = Ложь;
		Если Не Успешно Тогда    
			СтрокиОрганизации[0].ОшибкаВыгрузки = Истина;
			Если ОтражениеВключено Тогда
				ОтражениеВключено = Ложь;
				ОтключитьМеханизмОтраженияДокументовНаСервере();
			КонецЕсли;
		КонецЕсли;  
		УстановитьОформлениеЭлементовОрганизации(КлючОрганизации);
	КонецЦикла;
	
	Если Не Успешно Тогда    
		Элементы.ГруппаНастройкиОтраженияВторойЭтап.Видимость = Истина;
		Элементы.ГруппаНастройкиОтраженияВторойЭтап.ТекущаяСтраница = Элементы.СтраницаНеудача;
		Элементы.ГруппаКомандаНачать.Доступность = Истина;                
		ИзменитьДоступностьФлажковОрганизаций(Истина);
		Элементы.ГруппаДатаНачалаОтражения.Доступность = Истина;   
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСостояниеУчетнойПолитикиОрганизаций(КлючиОрганизаций, ТолькоПолучениеСведений = Ложь)
	
	ПубличныеИдентификаторы = Новый Массив;
	Для Каждого СтрокаОрганизации Из ДоступныеОрганизации Цикл
		Если КлючиОрганизаций.Найти(СтрокаОрганизации.КлючСтроки) <> Неопределено Тогда
			ПубличныеИдентификаторы.Добавить(СтрокаОрганизации.ПубличныйИдентификатор);   
			СтрокаОрганизации.БылЗапросПолитики = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ДлительнаяОперация = ДлительнаяОперацияУчетнаяПолитикаОрганизации(
		ПубличныеИдентификаторы,
		ДатаНачалаОтражения,
		УникальныйИдентификатор);
		
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("КлючиОрганизаций", КлючиОрганизаций);
	ДополнительныеПараметры.Вставить("ТолькоПолучениеСведений", ТолькоПолучениеСведений);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ДлительнаяОперация,
		Новый ОписаниеОповещения("ПолучитьУчетнуюПолитикуОрганизацииЗавершение", ЭтотОбъект, ДополнительныеПараметры),
		ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьНесколькоОрганизацийЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда        
		ВключитьОтражениеОрганизацийЗавершение(ДополнительныеПараметры.КлючиОрганизаций, Ложь);
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда     
		ОбщегоНазначенияКлиент.СообщитьПользователю(КраткоеПредставлениеОшибки(Результат.ИнформацияОбОшибке));
		ВключитьОтражениеОрганизацийЗавершение(ДополнительныеПараметры.КлючиОрганизаций, Ложь, КраткоеПредставлениеОшибки(Результат.ИнформацияОбОшибке));
		Возврат;
	КонецЕсли;
	
	РезультатВыгрузки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Если РезультатВыгрузки.Отказ Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатВыгрузки.СообщениеОбОшибке);
		ВключитьОтражениеОрганизацийЗавершение(ДополнительныеПараметры.КлючиОрганизаций, Ложь);  
		ОтразитьЭлементыВторогоЭтапа(Истина);
		Возврат;
	КонецЕсли;
	
	МассивСсылок = Новый Массив;
	Для Каждого КлючОрганизации Из ДополнительныеПараметры.КлючиОрганизаций Цикл 
		СтрокиОрганизации = ДоступныеОрганизации.НайтиСтроки(Новый Структура("КлючСтроки", КлючОрганизации)); 
		МассивСсылок.Добавить(СтрокиОрганизации[0].Ссылка);
	КонецЦикла;
	Идентификаторы = ПубличныеИдентификаторыОрганизаций(УзелОбмена, МассивСсылок);
	
	Для Каждого КлючОрганизации Из ДополнительныеПараметры.КлючиОрганизаций Цикл 
		СтрокиОрганизации = ДоступныеОрганизации.НайтиСтроки(Новый Структура("КлючСтроки", КлючОрганизации)); 
		СтрокиОрганизации[0].ПубличныйИдентификатор = Идентификаторы.Получить(СтрокиОрганизации[0].Ссылка);   
	КонецЦикла;
	
	ПолучитьСостояниеУчетнойПолитикиОрганизаций(ДополнительныеПараметры.КлючиОрганизаций);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьУчетнуюПолитикуОрганизацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	КлючиОрганизаций = ДополнительныеПараметры.КлючиОрганизаций;
	
	Если Результат = Неопределено Тогда
		ВключитьОтражениеОрганизацийЗавершение(КлючиОрганизаций, Ложь);
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(КраткоеПредставлениеОшибки(Результат.ИнформацияОбОшибке));
		ВключитьОтражениеОрганизацийЗавершение(КлючиОрганизаций, Ложь, КраткоеПредставлениеОшибки(Результат.ИнформацияОбОшибке));
		Возврат;
	КонецЕсли;
	
	СостояниеУчетнойПолитики = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);

	ЕстьОшибкаПередачи = Ложь;
	Для Каждого КлючОрганизации Из КлючиОрганизаций Цикл
		СтрокиОрганизации = ДоступныеОрганизации.НайтиСтроки(Новый Структура("КлючСтроки", КлючОрганизации));   
		СостояниеНастройки = СостояниеУчетнойПолитики.Получить(СтрокиОрганизации[0].ПубличныйИдентификатор);
		Если СостояниеНастройки <> Неопределено Тогда
			СтрокиОрганизации[0].УчетнаяПолитикаСуществует = СостояниеНастройки.Получить("УчетнаяПолитика").Получить("Существует");
			СтрокиОрганизации[0].СистемаНалогообложенияСуществует = СостояниеНастройки.Получить("СистемаНалогообложения").Получить("Существует");
		Иначе
			СтрокиОрганизации[0].ОшибкаВыгрузки = Истина;
			СтрокиОрганизации[0].УчетнаяПолитикаСуществует = Ложь;
			СтрокиОрганизации[0].СистемаНалогообложенияСуществует = Ложь;  
			ЕстьОшибкаПередачи = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого КлючОрганизации Из КлючиОрганизаций Цикл
		УстановитьОформлениеЭлементовОрганизации(КлючОрганизации);
	КонецЦикла;      
	
	Если ДополнительныеПараметры.ТолькоПолучениеСведений Тогда   
		Возврат;
	КонецЕсли;
	
	ОтразитьЭлементыВторогоЭтапа(ЕстьОшибкаПередачи);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОтразитьЭлементыВторогоЭтапа(ЕстьОшибкаПередачи)

	Элементы.ГруппаКомандаНачать.Доступность = Истина;    
	ИзменитьДоступностьФлажковОрганизаций(Истина);
	Элементы.ГруппаДатаНачалаОтражения.Доступность = Истина;   
	Элементы.КомандаСохранитьНастройки.Доступность = Истина;    
	Элементы.ГруппаНастройкиОтраженияВторойЭтап.ТекущаяСтраница = Элементы.СтраницаПараметрыДокументов;
	
	Если ЕстьОшибкаПередачи  Тогда
		Элементы.ГруппаНастройкиОтраженияВторойЭтап.Видимость = Ложь;
	Иначе
		Элементы.ГруппаНастройкиОтраженияВторойЭтап.Видимость = Истина;
		Элементы.ГруппаОтражениеВключено.Видимость = Истина;
		Элементы.КомандаОтразитьДокументы.КнопкаПоУмолчанию = Истина;
		Элементы.ГруппаИнформация.Видимость = Ложь;   
		Элементы.КомандаНачатьРаботу.Видимость = Ложь;    
		Элементы.КомандаОрганизацииВыбраны.Видимость = Ложь;    

		ПроизвестиПолныйПересчетДокументовПоРазделам();   
		УстановитьСвойстваКомандыОтразитьДокументы(); 
		АктуализироватьКэши();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыборИзМенюОтборПоВидамДокументовЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиРазделы = РазделыУчета.НайтиСтроки(Новый Структура("Идентификатор", ДополнительныеПараметры.ИдентификаторРаздела));
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ОтметкаВидовДокументовПоРазделуЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ВыборВидовДокументов = ПодготовитьВыборВидовДокументовПоРазделу(ДополнительныеПараметры.ИдентификаторРаздела);
	Если ВыбранныйЭлемент.Значение = "ПоВсемДокументам" Тогда
		СтрокиРазделы[0].ПоВсемДокументам = Истина;
		
		СписокВыбора = ВыборВидовДокументов.СписокВыбора;
		Для Каждого Элемент Из СписокВыбора Цикл
			Элемент.Пометка = Истина;
		КонецЦикла;
		ВыполнитьОбработкуОповещения(ОбработкаВыбора, ВыборВидовДокументов.СписокВыбора);
	ИначеЕсли ВыбранныйЭлемент.Значение = "ВыбратьИзСписка" Тогда
		СтрокиРазделы[0].ПоВсемДокументам = Ложь;
		
		ВыборВидовДокументов.СписокВыбора.ПоказатьОтметкуЭлементов(
			ОбработкаВыбора,
			ВыборВидовДокументов.Заголовок);
	КонецЕсли;  
		
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаВидовДокументовПоРазделуЗавершение(СписокВыбора, ДополнительныеПараметры) Экспорт
	
	Если СписокВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("РазделУчета", ДополнительныеПараметры.ИдентификаторРаздела);
	Для Каждого СтрокаВыбранные Из ВыбранныеВидыДокументов.НайтиСтроки(Отбор) Цикл
		ВыбранныеВидыДокументов.Удалить(СтрокаВыбранные);
	КонецЦикла;
	
	Для Каждого Элемент Из СписокВыбора Цикл
		Если Элемент.Пометка Тогда
			НоваяСтрока = ВыбранныеВидыДокументов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	УстановитьСвойстваКомандыВидыДокументов(ДополнительныеПараметры.ИмяКоманды, ДополнительныеПараметры.ИдентификаторРаздела);

	КоличествоКВыгрузке = ПодсчитатьКоличествоДокументовПоРазделу(СписокВыбора, ДополнительныеПараметры.ИдентификаторРаздела);  
	УстановитьСвойстваСтрокиРаздела(ДополнительныеПараметры.ИдентификаторРаздела, КоличествоКВыгрузке);   
	УстановитьСвойстваКомандыОтразитьДокументы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьМеханизмОтраженияДокументов()
	
	Если Не ЗначениеЗаполнено(НомерОбласти) Тогда
		ОбработчикВыбора = Новый ОписаниеОповещения("ВыборПриложенияБухгалтерииЗавершение", ЭтотОбъект);
	
		СписокВыбора = Новый СписокЗначений;
		Для Каждого ОписаниеПриложения Из ПриложенияБухгалтерии Цикл
			ПредставлениеПриложения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 (%2)'"),
				ОписаниеПриложения.Наименование,
				Формат(ОписаниеПриложения.Код, "ЧГ=0"));
			СписокВыбора.Добавить(ОписаниеПриложения.Код, ПредставлениеПриложения);
		КонецЦикла;
		
		Если СписокВыбора.Количество() = 0 Тогда
			ПоказатьПредупреждение(
				Новый ОписаниеОповещения("ПредупреждениеНетДоступныхПриложенийБухгалтерииЗавершение", ЭтотОбъект),
				НСтр("ru = 'Нет доступных приложений бухгалтерии.'"));
		ИначеЕсли СписокВыбора.Количество() = 1 Тогда
			ВыполнитьОбработкуОповещения(ОбработчикВыбора, СписокВыбора[0]);
		Иначе
			СписокВыбора.ПоказатьВыборЭлемента(ОбработчикВыбора, НСтр("ru = 'Приложение бухгалтерии'"));
		КонецЕсли;
	Иначе
		ПослеВыбораПриложенияБухгалтерии();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредупреждениеНетДоступныхПриложенийБухгалтерииЗавершение(ДополнительныеПараметры) Экспорт
	
	ВключитьМеханизмОтраженияДокументовЗавершение(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПриложенияБухгалтерииЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		ВключитьМеханизмОтраженияДокументовЗавершение(Ложь);
		Возврат;
	КонецЕсли;
	
	НомерОбласти = ВыбранныйЭлемент.Значение;
	
	СтрокиПриложения = ПриложенияБухгалтерии.НайтиСтроки(Новый Структура("Код", НомерОбласти));
	
	ОписаниеПриложения = Новый Структура("Код,АдресПриложения,Наименование");
	ЗаполнитьЗначенияСвойств(ОписаниеПриложения, СтрокиПриложения[0]);
	
	УстановитьПараметрыПодключенияКБухгалтерииНаСервере(ОписаниеПриложения);
	
	ПослеВыбораПриложенияБухгалтерии();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПриложенияБухгалтерии()
	
	Если УзелОбмена.Пустая() Тогда
		ДлительнаяОперация = ДлительнаяОперацияНастройкиПодключенияКПриложениюВСервисе(НомерОбласти, УникальныйИдентификатор);
	
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			ДлительнаяОперация,
			Новый ОписаниеОповещения("ПолучитьНастройкиПодключенияКПриложениюВСервисеЗавершение", ЭтотОбъект),
			ПараметрыОжидания);
	Иначе
		Если НастройкаСинхронизацииЗавершена Тогда
			ВключитьМеханизмОтраженияДокументовЗавершение();
		Иначе
			ДлительнаяОперация = ДлительнаяОперацияСохранитьНачальныеНастройкиСинхронизации(ТекущаяНастройка);
	
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
			
			ДлительныеОперацииКлиент.ОжидатьЗавершение(
				ДлительнаяОперация,
				Новый ОписаниеОповещения("СохранитьНачальныеНастройкиСинхронизацииЗавершение", ЭтотОбъект),
				ПараметрыОжидания);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПараметрыПодключенияКБухгалтерииНаСервере(ОписаниеПриложения)

	РегистрыСведений.НастройкиИнтеграцииСБухгалтерией.УстановитьПараметрыПодключенияКБухгалтерии(ОписаниеПриложения);

КонецПроцедуры

&НаКлиенте
Процедура ВключитьМеханизмОтраженияДокументовЗавершение(Успешно = Истина, СообщениеОбОшибке = "")
	
	Элементы.ДекорацияОжиданиеИспользоватьОтражение.Видимость = Ложь;
	Элементы.ОтражениеВключено.Доступность = Истина;
	
	ОтражениеВключено = Успешно;
	Если ОтражениеВключено Тогда 
		ДействияПриВключенииОтраженияДокументовНаСервере();  
		ДействияПриНачалеРаботыПослеСохраненияНастроекНаКлиенте();  
		
		Элементы.ГруппаНастройкиОтраженияПервыйЭтап.Доступность = Истина; 
	Иначе
		Элементы.ГруппаНастройкиОтраженияПервыйЭтап.Доступность = Ложь; 
	
		Элементы.ГруппаКомандаНачать.Доступность = Истина;   
		Элементы.ГруппаНастройкиОтраженияВторойЭтап.Видимость = Истина;
		Элементы.ГруппаНастройкиОтраженияВторойЭтап.ТекущаяСтраница = Элементы.СтраницаНеудача;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьМеханизмОтраженияДокументов()
	
	ОтключитьМеханизмОтраженияДокументовНаСервере();

	Элементы.ГруппаНастройкиОтраженияВторойЭтап.Видимость = Ложь;      
	ОтмеченныеСтроки = ДоступныеОрганизации.НайтиСтроки(Новый Структура("Пометка", Истина));
	Если ОтмеченныеСтроки.Количество() = 0 Тогда
		Элементы.ГруппаКомандаНачать.Видимость = Ложь;
	КонецЕсли;   
	Оповестить("ОтражениеОтключено");
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьМеханизмОтраженияДокументовНаСервере()
	
	НачатьТранзакцию();
	Попытка
		НастройкаОбъект = ТекущаяНастройка.ПолучитьОбъект();
		НастройкаОбъект.ОтражениеВключено = Ложь;   
		НастройкаОбъект.Организации.Очистить();
		НастройкаОбъект.ВидыДокументов.Очистить();
		НастройкаОбъект.ДатаНачалаОтражения = Неопределено;
		НастройкаОбъект.ДатаПоследнегоОбновленияУниверсальная = Неопределено;
		
		УзелОбъект = УзелОбмена.ПолучитьОбъект();
		УзелОбъект.ПравилаОтправкиСправочников = "СинхронизироватьПоНеобходимости";
		УзелОбъект.ПравилаОтправкиДокументов = "ИнтерактивнаяСинхронизация";
		
		НастройкаОбъект.Записать();
		УзелОбъект.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНастройкиБухгалтерии(ТолькоПолучениеСведений = Ложь)
	
	ДлительнаяОперация = ДлительнаяОперацияПолучитьНастройкиПриложения(УникальныйИдентификатор);
		
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДополнительныеПараметры = Новый Структура; 
	ДополнительныеПараметры.Вставить("ТолькоПолучениеСведений", ТолькоПолучениеСведений);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ДлительнаяОперация,
		Новый ОписаниеОповещения("ПолучитьНастройкиБухгалтерииЗавершение", ЭтотОбъект, ДополнительныеПараметры),
		ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНастройкиБухгалтерииЗавершение(Результат, ДополнительныеПараметры) Экспорт    
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(КраткоеПредставлениеОшибки(Результат.ИнформацияОбОшибке));
		Элементы.ГруппаНастройкиОтраженияВторойЭтап.Видимость = Истина;
		Элементы.ГруппаНастройкиОтраженияВторойЭтап.ТекущаяСтраница = Элементы.СтраницаНеудача;
		Элементы.ГруппаКомандаНачать.Доступность = Истина;                
		ИзменитьДоступностьФлажковОрганизаций(Истина);
		Элементы.ГруппаДатаНачалаОтражения.Доступность = Истина;   
		Возврат;
	КонецЕсли;
	
	НастройкиБухгалтерии = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);    
	Если НастройкиБухгалтерии <> Неопределено Тогда
		НачалоРаботы = НастройкиБухгалтерии.Получить("НачалоРаботы"); 
		КоличествоОрганизаций = НастройкиБухгалтерии.Получить("КоличествоОрганизаций"); 
		БухгалтерияПуста = НачалоРаботы ИЛИ КоличествоОрганизаций = 0;    
	Иначе
		БухгалтерияПуста = Истина;
	КонецЕсли;
		
	Если БухгалтерияПуста Тогда    
		Элементы.ГруппаПредупреждениеБухгалтерияПуста.Видимость = Истина;
		Элементы.ГруппаПредупреждениеТребуетсяПолныйИнтерфейсВертикальная.Видимость = Ложь;
		Элементы.ДекорацияКартинкаИнформация.Высота = 0;
	Иначе
		Элементы.ГруппаПредупреждениеБухгалтерияНеПуста.Видимость = Истина;
		Элементы.ГруппаПредупреждениеТребуетсяПолныйИнтерфейсВертикальная.Видимость = Истина;
		Элементы.ДекорацияКартинкаИнформация.Высота = 3;
	КонецЕсли;    
	Если ДополнительныеПараметры.ТолькоПолучениеСведений Тогда   
		Возврат;
	КонецЕсли;
	
	// 2. Проброс и пометка организаций  
	ВключитьОтражениеОрганизаций();
	
КонецПроцедуры


#Область НастройкиПодключенияКПриложениюВСервисе

&НаСервереБезКонтекста
Функция ДлительнаяОперацияНастройкиПодключенияКПриложениюВСервисе(НомерОбласти, ИдентификаторФормы)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"Обработки.ОтражениеДокументовВБухгалтерии.НастройкиПодключенияКПриложениюВСервисе",
		НомерОбласти);
	
КонецФункции

&НаКлиенте
Процедура ПолучитьНастройкиПодключенияКПриложениюВСервисеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ВключитьМеханизмОтраженияДокументовЗавершение(Ложь);
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(КраткоеПредставлениеОшибки(Результат.ИнформацияОбОшибке));
		ВключитьМеханизмОтраженияДокументовЗавершение(Ложь, КраткоеПредставлениеОшибки(Результат.ИнформацияОбОшибке));
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ДлительнаяОперацияПроверитьПодключениеККорреспонденту(Результат.АдресРезультата, УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ДлительнаяОперация,
		Новый ОписаниеОповещения("ПроверитьПодключениеККорреспондентуЗавершение", ЭтотОбъект),
		ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаПодключенияККорреспонденту

&НаСервереБезКонтекста
Функция ДлительнаяОперацияПроверитьПодключениеККорреспонденту(АдресВХранилище, ИдентификаторФормы)
	
	НастройкиПодключенияВСервисе = ПолучитьИзВременногоХранилища(АдресВХранилище);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"Обработки.ОтражениеДокументовВБухгалтерии.ПроверитьПодключениеККорреспонденту",
		НастройкиПодключенияВСервисе);
	
КонецФункции

&НаКлиенте
Процедура ПроверитьПодключениеККорреспондентуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ВключитьМеханизмОтраженияДокументовЗавершение(Ложь);
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(КраткоеПредставлениеОшибки(Результат.ИнформацияОбОшибке));
		ВключитьМеханизмОтраженияДокументовЗавершение(Ложь, КраткоеПредставлениеОшибки(Результат.ИнформацияОбОшибке));
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ДлительнаяОперацияСохранитьНастройкиПодключения(Результат.АдресРезультата, УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ДлительнаяОперация,
		Новый ОписаниеОповещения("СохранитьНастройкиПодключенияЗавершение", ЭтотОбъект),
		ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СохранениеНастроекПодключения

&НаСервереБезКонтекста
Функция ДлительнаяОперацияСохранитьНастройкиПодключения(АдресВХранилище, ИдентификаторФормы)
	
	СтруктураНастроек = ПолучитьИзВременногоХранилища(АдресВХранилище);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"Обработки.ОтражениеДокументовВБухгалтерии.СохранитьНастройкиПодключения",
		СтруктураНастроек);
	
КонецФункции

&НаКлиенте
Процедура СохранитьНастройкиПодключенияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ВключитьМеханизмОтраженияДокументовЗавершение(Ложь);
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(КраткоеПредставлениеОшибки(Результат.ИнформацияОбОшибке));
		ВключитьМеханизмОтраженияДокументовЗавершение(Ложь, КраткоеПредставлениеОшибки(Результат.ИнформацияОбОшибке));
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Если Не ЗначениеЗаполнено(РезультатВыполнения) Тогда
		ВключитьМеханизмОтраженияДокументовЗавершение(Ложь);
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.НастройкиПодключенияСохранены Тогда
		УзелОбмена = РезультатВыполнения.УзелОбмена;
		ЗаписатьУзелОбменаВНастройкиНаСервере();
		
		ДлительнаяОперация = ДлительнаяОперацияСохранитьНачальныеНастройкиСинхронизации(ТекущаяНастройка);
	
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			ДлительнаяОперация,
			Новый ОписаниеОповещения("СохранитьНачальныеНастройкиСинхронизацииЗавершение", ЭтотОбъект),
			ПараметрыОжидания);
	Иначе
		ВключитьМеханизмОтраженияДокументовЗавершение(Ложь, РезультатВыполнения.СообщениеОбОшибке);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СохранитьНачальныеНастройкиСинхронизации

&НаСервереБезКонтекста
Функция ДлительнаяОперацияСохранитьНачальныеНастройкиСинхронизации(НастройкаСсылка)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"Обработки.ОтражениеДокументовВБухгалтерии.СохранитьНачальныеНастройкиСинхронизации",
		НастройкаСсылка);

КонецФункции

&НаКлиенте
Процедура СохранитьНачальныеНастройкиСинхронизацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ВключитьМеханизмОтраженияДокументовЗавершение(Ложь);
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(КраткоеПредставлениеОшибки(Результат.ИнформацияОбОшибке));
		ВключитьМеханизмОтраженияДокументовЗавершение(Ложь, КраткоеПредставлениеОшибки(Результат.ИнформацияОбОшибке));
		Возврат;
	КонецЕсли;
	
	НастройкаСинхронизацииЗавершена = Истина;
	
	ВключитьМеханизмОтраженияДокументовЗавершение();
	
КонецПроцедуры

#КонецОбласти

#Область ВыполнитьСинхронизациюОрганизаций

&НаСервереБезКонтекста
Функция ДлительнаяОперацияВыгрузитьНесколькоОрганизаций(УзелОбмена, МассивОрганизаций, ИдентификаторФормы)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"Обработки.ОтражениеДокументовВБухгалтерии.ВыполнитьНачальнуюВыгрузкуНесколькихОрганизаций",
		УзелОбмена,
		МассивОрганизаций);
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьНачальнуюСинхронизациюОрганизацийЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	//
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеУчетнойПолитикиОрганизации

&НаСервереБезКонтекста
Функция ДлительнаяОперацияУчетнаяПолитикаОрганизации(ПубличныеИдентификаторы, Период, ИдентификаторФормы)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	УстановитьПривилегированныйРежим(Истина);
	ОписаниеПодключения = СовместноеИспользованиеИнтеграция.НовоеПодключениеКСервису();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"Обработки.ОтражениеДокументовВБухгалтерии.СостояниеУчетнойПолитикиОрганизации",
		ПубличныеИдентификаторы,
		Период);
	
КонецФункции

#КонецОбласти


#Область ПолучениеНастроекБухгалтерии

&НаСервереБезКонтекста
Функция ДлительнаяОперацияПолучитьНастройкиПриложения(ИдентификаторФормы)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	УстановитьПривилегированныйРежим(Истина);
	ОписаниеПодключения = СовместноеИспользованиеИнтеграция.НовоеПодключениеКСервису();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"Обработки.ОтражениеДокументовВБухгалтерии.ПолучитьНастройкиПриложения");
	
	КонецФункции  
	
&НаСервереБезКонтекста
Функция ДлительнаяОперацияПолучитьНастройкиСовместногоИспользования(НастройкаСсылка, ИдентификаторФормы)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"Обработки.ОтражениеДокументовВБухгалтерии.ПолучитьНастройкиСовместногоИспользования",
		НастройкаСсылка);
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ЗаписатьУзелОбменаВНастройкиНаСервере()
	
	Если ТекущаяНастройка.Пустая() Тогда
		НоваяНастройка = Справочники.НастройкиОтраженияДокументовВБухгалтерии.СоздатьЭлемент();
		НоваяНастройка.Код = Строка(Новый УникальныйИдентификатор);
		НоваяНастройка.УзелОбмена = УзелОбмена;
		НоваяНастройка.ПользовательДляИнтеграции = Пользователи.ТекущийПользователь();
		НоваяНастройка.Записать();
		
		ТекущаяНастройка = Справочники.НастройкиОтраженияДокументовВБухгалтерии.ТекущаяНастройка();
	Иначе
		НастройкаОбъект = ТекущаяНастройка.ПолучитьОбъект();
		НастройкаОбъект.УзелОбмена = УзелОбмена;
		НастройкаОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДатыНачалаОтраженияНаСервере()
	
	Если ЗначениеЗаполнено(ДатаНачалаОтражения) Тогда
		Элементы.ГруппаКалендарьДатаНачалаОтражения.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветГиперссылки;
		Элементы.ГруппаКалендарьДатаНачалаОтражения.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'С %1'"),
			Формат(ДатаНачалаОтражения, "ДЛФ=DD"));
		Элементы.ДекорацияКартинкаДатаНачалаОтражения.Картинка = БиблиотекаКартинок.РазделУчетаБезПредупреждений;
		
		Элементы.ГруппаРазделыУчета.Доступность = Истина;
		Элементы.ГруппаКомандыФормы.Доступность = Истина;    
		
		Если Элементы.ГруппаНастройкиОтраженияВторойЭтап.Видимость Тогда
			ПроизвестиПолныйПересчетДокументовПоРазделам();
			УстановитьСвойстваКомандыОтразитьДокументы();
		КонецЕсли;
		
	Иначе
		Элементы.ГруппаКалендарьДатаНачалаОтражения.ЦветТекстаЗаголовка = ЦветаСтиля.РезультатПредупреждениеЦвет;
		Элементы.ГруппаКалендарьДатаНачалаОтражения.Заголовок = НСтр("ru = 'Не указана'");
		
		Элементы.ДекорацияКартинкаДатаНачалаОтражения.Картинка = БиблиотекаКартинок.РазделУчетаСПредупреждениями;
		
		Элементы.ГруппаРазделыУчета.Доступность = Ложь;
		Элементы.ГруппаКомандыФормы.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроизвестиПолныйПересчетДокументовПоРазделам()

	Для Каждого СтрокаРазделы Из РазделыУчета Цикл
		Если Не СтрокаРазделы.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ВыборВидовДокументов = ПодготовитьВыборВидовДокументовПоРазделу(СтрокаРазделы.Идентификатор);
		СписокВыбора = ВыборВидовДокументов.СписокВыбора;
		Если СтрокаРазделы.ПоВсемДокументам Тогда
			Для Каждого Элемент Из СписокВыбора Цикл
				Элемент.Пометка = Истина;
			КонецЦикла;
		КонецЕсли;
		
		КоличествоКВыгрузке = ПодсчитатьКоличествоДокументовПоРазделу(СписокВыбора, СтрокаРазделы.Идентификатор);     
		УстановитьСвойстваСтрокиРаздела(СтрокаРазделы.Идентификатор, КоличествоКВыгрузке);     
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиИнтеграции()
	
	ДоступныеПриложения = РегистрыСведений.НастройкиИнтеграцииСБухгалтерией.ДоступныеПриложенияБухгалтерии();
	НастройкаИнтеграции = РегистрыСведений.НастройкиИнтеграцииСБухгалтерией.ТекущаяНастройка();
	
	НомерОбласти = НастройкаИнтеграции.НомерОбласти;
	
	Если ЗначениеЗаполнено(НомерОбласти) Тогда
		СтрокаПриложение = ДоступныеПриложения.Найти(НомерОбласти, "Код");
		Если СтрокаПриложение = Неопределено Тогда
			// Приложение бухгалтерии, указанное в настройках интеграции, недоступно пользователю.
			Элементы.ГруппаОтражениеВключено.Доступность = Ложь;
			Элементы.ГруппаНастройкиОтраженияПервыйЭтап.Доступность = Ложь;
		Иначе
			НоваяСтрока = ПриложенияБухгалтерии.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПриложение);
		КонецЕсли;
	Иначе
		ПриложенияБухгалтерии.Загрузить(РегистрыСведений.НастройкиИнтеграцииСБухгалтерией.ДоступныеПриложенияБухгалтерии());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВосстановитьТекущиеНастройкиОтражения()
	
	ТекущаяНастройка = Справочники.НастройкиОтраженияДокументовВБухгалтерии.ТекущаяНастройка();
	
	Если Не ТекущаяНастройка.Пустая() Тогда
		ОписаниеНастройки = Справочники.НастройкиОтраженияДокументовВБухгалтерии.ОписаниеНастройки(ТекущаяНастройка);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ОписаниеНастройки, "ДатаНачалаОтражения,УзелОбмена,ОтражениеВключено");
		
		НастройкаСинхронизацииЗавершена = ОбменДаннымиСервер.НастройкаСинхронизацииЗавершена(УзелОбмена);
		
		ВосстановитьНастройкиОрганизаций(ОписаниеНастройки);
		ВосстановитьНастройкиРазделовУчета(ОписаниеНастройки);
		ВосстановитьНастройкиВидовДокументов(ОписаниеНастройки);
	КонецЕсли;
	
	Возврат Не ТекущаяНастройка.Пустая();
	
КонецФункции

&НаСервере
Процедура СформироватьСписокОрганизаций()
	
	ДоступныеОрганизации.Очистить();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организации.Наименование");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаОрганизации = ДоступныеОрганизации.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОрганизации, Выборка);
		
		СтрокаОрганизации.КлючСтроки = СтрЗаменить(XMLСтрока(Выборка.Ссылка), "-", "");
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЭлементыУправленияОрганизаций()
	
	Для Инд = 0 По ДоступныеОрганизации.Количество() - 1 Цикл
		СтрокаОрганизации = ДоступныеОрганизации[Инд];
		
		ДобавитьЭлементыУправленияОрганизации(Инд);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеОбязательныхРеквизитовОрганизацииПриНеобходимости(КлючСтроки)
	
	СтрокаОрганизации = ДоступныеОрганизации.НайтиСтроки(Новый Структура("КлючСтроки", КлючСтроки))[0];
	
	ОшибкиПроверкиЗаполнения = Новый Массив;
	Если СтрокаОрганизации.Пометка
		И Не ЗначениеЗаполнено(СтрокаОрганизации.ПубличныйИдентификатор) Тогда
		Обработки.ОтражениеДокументовВБухгалтерии.ПолучитьОписаниеОрганизации(СтрокаОрганизации.Ссылка, ОшибкиПроверкиЗаполнения);
	КонецЕсли;
	
	Если ОшибкиПроверкиЗаполнения.Количество() > 0 Тогда
		СтрокаОрганизации.ЕстьНезаполненныеРеквизиты = Истина;
		СтрокаОрганизации.ОшибкиПроверкиЗаполнения = СтрСоединить(ОшибкиПроверкиЗаполнения, Символы.ПС);
	Иначе
		СтрокаОрганизации.ЕстьНезаполненныеРеквизиты = Ложь;
		СтрокаОрганизации.ОшибкиПроверкиЗаполнения = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщийОбработчикКомандыОрганизацииЗакрытие(Результат, ДополнительныеПараметры) Экспорт
	
	ПослеЗакрытияКарточкиОрганизацииНаСервере(ДополнительныеПараметры.КлючОрганизации);
	
	Элементы.ГруппаКомандаНачать.Доступность = ДоступностьГруппыКомандНачалаРаботы();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗакрытияКарточкиОрганизацииНаСервере(КлючСтроки)
	
	СтрокаОрганизации = ДоступныеОрганизации.НайтиСтроки(Новый Структура("КлючСтроки", КлючСтроки))[0];
	
	ПроверитьЗаполнениеОбязательныхРеквизитовОрганизацииПриНеобходимости(СтрокаОрганизации.КлючСтроки);
	УстановитьОформлениеЭлементовОрганизации(СтрокаОрганизации.КлючСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеУчетнойПолитикиОрганизацийПриОткрытии()
	
	КлючиОрганизаций = Новый Массив;
	Для Каждого СтрокаОрганизации Из ДоступныеОрганизации.НайтиСтроки(Новый Структура("Пометка", Истина)) Цикл
		КлючиОрганизаций.Добавить(СтрокаОрганизации.КлючСтроки);
	КонецЦикла;
	
	Если КлючиОрганизаций.Количество() > 0 Тогда
	    ПолучитьСостояниеУчетнойПолитикиОрганизаций(КлючиОрганизаций, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыУправленияОрганизации(Индекс)
	
	СтрокаОрганизации = ДоступныеОрганизации[Индекс];
	
	КлючСтроки = СтрокаОрганизации.КлючСтроки;
	Представление = СтрокаОрганизации.Наименование;
	
	ГруппаРодитель = Элементы.Добавить(
		"ГруппаОрганизация_" + КлючСтроки,
		Тип("ГруппаФормы"),
		Элементы.ГруппаОрганизации);
	ГруппаРодитель.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаРодитель.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаРодитель.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаРодитель.ОтображатьЗаголовок = Ложь;
	ГруппаРодитель.ЦветФона = ЦветаСтиля.ЦветФонаШапкиТаблицы;
	ГруппаРодитель.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
	ГруппаРодитель.РастягиватьПоГоризонтали = Истина;
	
	НоваяКоманда = Команды.Добавить("КомандаОрганизации_" + КлючСтроки);
	НоваяКоманда.Заголовок = Представление;
	НоваяКоманда.Действие = "ОбщийОбработчикКомандыОрганизации";
	
	ЭлементФлажок = Элементы.Добавить(
		"Организация_" + КлючСтроки,
		Тип("ПолеФормы"),
		ГруппаРодитель);
	ЭлементФлажок.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементФлажок.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементФлажок.ПутьКДанным = СтрШаблон("ДоступныеОрганизации[%1].Пометка", Формат(Индекс, "ЧГ=0"));
	ЭлементФлажок.УстановитьДействие("ПриИзменении", "ФлажокОрганизацииПриИзменении");
	
	ЭлементКнопка = Элементы.Добавить(
		НоваяКоманда.Имя,
		Тип("КнопкаФормы"),
		ГруппаРодитель);
	ЭлементКнопка.Вид = ВидКнопкиФормы.Гиперссылка;
	ЭлементКнопка.Заголовок = Представление;
	ЭлементКнопка.ИмяКоманды = НоваяКоманда.Имя;
	ЭлементКнопка.Шрифт = ШрифтыСтиля.ОбычныйШрифтТекста;
	
	ЭлементНадпись = Элементы.Добавить(
		"ДекорацияНадписьВыравниваниеОрганизация_" + КлючСтроки,
		Тип("ДекорацияФормы"),
		ГруппаРодитель);
	ЭлементНадпись.Вид = ВидДекорацииФормы.Надпись;
	ЭлементНадпись.АвтоМаксимальнаяШирина = Ложь;
	ЭлементНадпись.РастягиватьПоГоризонтали = Истина;
	
	ЭлементНадпись = Элементы.Добавить(
		"ДекорацияНадписьСтатусОрганизация_" + КлючСтроки,
		Тип("ДекорацияФормы"),
		ГруппаРодитель);
	ЭлементНадпись.Вид = ВидДекорацииФормы.Надпись;
	ЭлементНадпись.АвтоМаксимальнаяШирина = Ложь;
	ЭлементНадпись.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	ЭлементНадпись.Заголовок = "";
	
	ЭлементКартинка = Элементы.Добавить(
		"ДекорацияКартинкаСтатусОрганизация_" + КлючСтроки,
		Тип("ДекорацияФормы"),
		ГруппаРодитель);
	ЭлементКартинка.Вид = ВидДекорацииФормы.Картинка;
	ЭлементКартинка.Картинка = БиблиотекаКартинок.РазделУчетаБезПредупреждений;
	
	ЭлементКартинка.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокРазделовУчета()
	
	ДоступныеРазделы = СовместноеИспользование.ДоступныеРазделыУчета();
	
	Для Каждого ОписаниеРаздела Из ДоступныеРазделы Цикл
		СтрокаРазделы = РазделыУчета.Добавить();
		СтрокаРазделы.Идентификатор = ОписаниеРаздела.Идентификатор;
		СтрокаРазделы.Пометка = Истина;
		СтрокаРазделы.ПоВсемДокументам = Истина;
		СтрокаРазделы.Представление = ОписаниеРаздела.Представление;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЭлементыУправленияРазделовУчета()
	
	Для Инд = 0 По РазделыУчета.Количество() - 1 Цикл
		ДобавитьЭлементыУправленияРазделаУчета(Инд);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыУправленияРазделаУчета(Индекс)
	
	СтрокаРазделы = РазделыУчета[Индекс];
	
	ИдентификаторРаздела = СтрокаРазделы.Идентификатор;
	Представление = СтрокаРазделы.Представление;
	Пометка = СтрокаРазделы.Пометка;
	Количество = СтрокаРазделы.Количество;
	
	ГруппаРодитель = Элементы.Добавить(
		"ГруппаРазделУчета_" + ИдентификаторРаздела,
		Тип("ГруппаФормы"),
		Элементы.ГруппаРазделыУчета);
	ГруппаРодитель.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаРодитель.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	ГруппаРодитель.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаРодитель.ОтображатьЗаголовок = Ложь;
	ГруппаРодитель.ЦветФона = ЦветаСтиля.ЦветФонаШапкиТаблицы;
	ГруппаРодитель.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
	ГруппаРодитель.РастягиватьПоГоризонтали = Истина;
	
	ЭлементФлажок = Элементы.Добавить(
		"Раздел_" + ИдентификаторРаздела,
		Тип("ПолеФормы"),
		ГруппаРодитель);
	ЭлементФлажок.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементФлажок.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементФлажок.ПутьКДанным = СтрШаблон("РазделыУчета[%1].Пометка", Формат(Индекс, "ЧГ=0"));
	ЭлементФлажок.УстановитьДействие("ПриИзменении", "ФлажокРазделаУчетаПриИзменении");
	
	ЭлементНадпись = Элементы.Добавить(
		"ДекорацияНадписьРазделУчета_" + ИдентификаторРаздела,
		Тип("ДекорацияФормы"),
		ГруппаРодитель);   
		
	Если ЗначениеЗаполнено(Количество) Тогда
		ЭлементНадпись.Заголовок = Представление + " (отразить: " + Количество + ")";
	Иначе
		ЭлементНадпись.Заголовок = Представление;
	КонецЕсли;
		
	ЭлементНадпись.Шрифт = ШрифтыСтиля.ОбычныйШрифтТекста;
	ЭлементНадпись.Вид = ВидДекорацииФормы.Надпись;
	ЭлементНадпись.АвтоМаксимальнаяШирина = Ложь;
	ЭлементНадпись.РастягиватьПоГоризонтали = Истина;
	
	ЭлементНадпись.Доступность = Пометка;
	
	НоваяКоманда = Команды.Добавить("КомандаВидыДокументов_" + ИдентификаторРаздела);
	НоваяКоманда.Действие = "ОбщийОбработчикКомандыВидыДокументов";
	
	УстановитьСвойстваКомандыВидыДокументов(НоваяКоманда.Имя, ИдентификаторРаздела);
	
	ЭлементКнопка = Элементы.Добавить(
		НоваяКоманда.Имя,
		Тип("КнопкаФормы"),
		ГруппаРодитель);
	ЭлементКнопка.Вид = ВидКнопкиФормы.Гиперссылка;
	ЭлементКнопка.ИмяКоманды = НоваяКоманда.Имя;
	
	ЭлементКнопка.Доступность = Пометка;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваКомандыВидыДокументов(ИмяКоманды, ИдентификаторРаздела)
	
	Команда = Команды.Найти(ИмяКоманды);
	
	Если Команда = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиРазделы = РазделыУчета.НайтиСтроки(Новый Структура("Идентификатор", ИдентификаторРаздела));
	
	Если СтрокиРазделы[0].ПоВсемДокументам Тогда
		Команда.Заголовок = НСтр("ru = 'Все документы'");
		Команда.Подсказка = "";
		Возврат;
	Иначе
		Команда.Заголовок = НСтр("ru = 'Документы не выбраны'");
		Команда.Подсказка = "";
	КонецЕсли;
	
	ДоступныеВидыДокументов = СовместноеИспользование.СоответствиеВидовДокументовИРазделовУчета();
	
	Отбор = Новый Структура("РазделУчета", ИдентификаторРаздела);
	
	КоличествоВсего = ДоступныеВидыДокументов.НайтиСтроки(Отбор).Количество();
	
	СтрокиВыбранные = ВыбранныеВидыДокументов.НайтиСтроки(Отбор);
	
	Если СтрокиВыбранные.Количество() > 0
		И СтрокиВыбранные.Количество() < КоличествоВсего Тогда
		СтрокиЗаголовок = Новый Массив;
		
		КоличествоДляОтображенияВЗаголовке = 2;
		
		Для Сч = 1 По Мин(КоличествоДляОтображенияВЗаголовке, СтрокиВыбранные.Количество()) Цикл
			СтрокиЗаголовок.Добавить(СтрокиВыбранные[Сч - 1].Представление);
		КонецЦикла;
		
		Команда.Заголовок = СтрСоединить(СтрокиЗаголовок, ", ");
		
		Если СтрокиВыбранные.Количество() > КоличествоДляОтображенияВЗаголовке Тогда
			Команда.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 (и еще %2)'"),
				Команда.Заголовок,
				Формат(СтрокиВыбранные.Количество() - КоличествоДляОтображенияВЗаголовке, "ЧГ=0"));
		КонецЕсли;
		
		СтрокиПодсказка = Новый Массив;
		Для Каждого СтрокаВыбранные Из СтрокиВыбранные Цикл
			СтрокиПодсказка.Добавить(СтрокаВыбранные.Представление);
		КонецЦикла;
		
		Команда.Подсказка = СтрСоединить(СтрокиПодсказка, ", ");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваСтрокиРаздела(ИдентификаторРаздела, Количество)
	
	ИмяЭлемента = "ДекорацияНадписьРазделУчета_" + ИдентификаторРаздела;
	ЭлементНадпись = Элементы.Найти(ИмяЭлемента);
	Если ЭлементНадпись = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиРазделы = РазделыУчета.НайтиСтроки(Новый Структура("Идентификатор", ИдентификаторРаздела));
	Представление = СтрокиРазделы[0].Представление;                           
	СтрокиРазделы[0].Количество = Количество;     
	БылиИзмененияНастроек = СравнитьКэшИРеквизиты();	
	Если БылиИзмененияНастроек И ЗначениеЗаполнено(Количество) Тогда
		ЭлементНадпись.Заголовок = Представление + " (отразить: " + Количество + ")";   
	Иначе
		ЭлементНадпись.Заголовок = Представление;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьСвойстваКомандыОтразитьДокументы()
	
	ИмяКоманды = "КомандаОтразитьДокументы";
	КомандаОтразить = Команды.Найти(ИмяКоманды);
	
	Если КомандаОтразить = Неопределено Тогда
		Возврат;
	КонецЕсли;     

	ИмяКоманды = "КомандаСохранитьНастройки";
	КомандаСохранить = Команды.Найти(ИмяКоманды);
	
	ОбщееКоличество = ПодсчитатьОбщееКоличествоДокументовПоРазделам();
	БылиИзмененияНастроек = СравнитьКэшИРеквизиты();	
	
	Если БылиИзмененияНастроек И ОбщееКоличество > 0 Тогда
		ТекстЗаголовка = НСтр("ru = 'Отразить документы сейчас (#1)'");     
		КомандаОтразить.Заголовок = СтрЗаменить(ТекстЗаголовка, "#1", Формат(ОбщееКоличество, "ЧЦ=10"));
		КомандаОтразить.Подсказка = "";
		Элементы.КомандаОтразитьДокументы.Видимость = Истина;

		ТекстЗаголовка = НСтр("ru = 'Сохранить и запланировать отражение (#1)'");     
		КомандаСохранить.Заголовок = СтрЗаменить(ТекстЗаголовка, "#1", Формат(ОбщееКоличество, "ЧЦ=10"));
	Иначе
		КомандаОтразить.Заголовок = НСтр("ru = 'Отразить документы сейчас'");
		КомандаСохранить.Заголовок = НСтр("ru = 'Сохранить настройки и выйти'");
		КомандаОтразить.Подсказка = "";
		Элементы.КомандаОтразитьДокументы.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиОрганизаций(ОписаниеНастройки)
	
	ТаблицаИдентификаторы = ПубличныеИдентификаторыОрганизаций(
		ОписаниеНастройки.УзелОбмена,
		ДоступныеОрганизации.Выгрузить(, "Ссылка").ВыгрузитьКолонку("Ссылка"));
	
	Для Каждого СтрокаОрганизации Из ДоступныеОрганизации Цикл
		СтрокаОрганизации.Пометка = (ОписаниеНастройки.Организации.Найти(СтрокаОрганизации.Ссылка) <> Неопределено);
		СтрокаОрганизации.ПубличныйИдентификатор = ТаблицаИдентификаторы.Получить(СтрокаОрганизации.Ссылка);
		
		Если Не ЗначениеЗаполнено(СтрокаОрганизации.ПубличныйИдентификатор) Тогда
			СтрокаОрганизации.Пометка = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПубличныеИдентификаторыОрганизаций(УзелОбмена, СписокСсылок)
	
	Результат = Новый Соответствие;
	
	ТаблицаИдентификаторы = СовместноеИспользование.ПубличныеИдентификаторыСинхронизируемыхОбъектов(УзелОбмена, СписокСсылок);
	
	Для Каждого СтрокаИдентификаторы Из ТаблицаИдентификаторы Цикл
		Результат.Вставить(СтрокаИдентификаторы.Ссылка, СтрокаИдентификаторы.Идентификатор);
	КонецЦикла;

	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ВосстановитьНастройкиРазделовУчета(ОписаниеНастройки)
	
	Для Каждого СтрокаРазделы Из РазделыУчета Цикл
		СтрокаРазделы.Пометка = (ОписаниеНастройки.РазделыУчета.Найти(СтрокаРазделы.Идентификатор) <> Неопределено);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиВидовДокументов(ОписаниеНастройки)
	
	ВыбранныеВидыДокументов.Очистить();
	
	ДоступныеВидыДокументов = СовместноеИспользование.СоответствиеВидовДокументовИРазделовУчета();
	
	Для Каждого СтрокаВидыДокументов Из ОписаниеНастройки.ВидыДокументов Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("РазделУчета", СтрокаВидыДокументов.РазделУчета);
		Отбор.Вставить("ПолноеИмяМетаданных", ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(СтрокаВидыДокументов.ИдентификаторМетаданных).ПолноеИмя());
		
		СтрокиДоступныеВиды = ДоступныеВидыДокументов.НайтиСтроки(Отбор);
		Если СтрокиДоступныеВиды.Количество() > 0 Тогда
			НоваяСтрока = ВыбранныеВидыДокументов.Добавить();
			НоваяСтрока.РазделУчета = СтрокиДоступныеВиды[0].РазделУчета;
			НоваяСтрока.ИмяОбъекта = СтрокиДоступныеВиды[0].ИмяОбъектаМетаданных;
			НоваяСтрока.Представление = СтрокиДоступныеВиды[0].Представление;
			НоваяСтрока.ПолноеИмяМетаданных = СтрокиДоступныеВиды[0].ПолноеИмяМетаданных;
		КонецЕсли;
		
		СтрокиРазделы = РазделыУчета.НайтиСтроки(Новый Структура("Идентификатор", СтрокаВидыДокументов.РазделУчета));
		Если СтрокиРазделы.Количество() > 0 Тогда
			СтрокиРазделы[0].ПоВсемДокументам = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьВыборВидовДокументовПоРазделу(ИдентификаторРаздела)
	
	ДоступныеРазделы = СовместноеИспользование.ДоступныеРазделыУчета();
	СтрокаРаздел = ДоступныеРазделы.Найти(ИдентификаторРаздела, "Идентификатор");
	
	Результат = Новый Структура;
	Результат.Вставить("СписокВыбора", Новый СписокЗначений);
	Результат.Вставить("Заголовок", СтрокаРаздел.Представление);
	
	ДоступныеВидыДокументов = СовместноеИспользование.СоответствиеВидовДокументовИРазделовУчета();
	
	Отбор = Новый Структура("РазделУчета", ИдентификаторРаздела);
	
	Для Каждого СтрокаВидыДокументов Из ДоступныеВидыДокументов.НайтиСтроки(Отбор) Цикл
		ОтборВыбранные = Новый Структура("РазделУчета,ИмяОбъекта");
		ОтборВыбранные.РазделУчета = СтрокаВидыДокументов.РазделУчета;
		ОтборВыбранные.ИмяОбъекта = СтрокаВидыДокументов.ИмяОбъектаМетаданных;
		
		СтрокиВыбранные = ВыбранныеВидыДокументов.НайтиСтроки(ОтборВыбранные);
		
		ЗначениеВыбора = Новый Структура("РазделУчета,ИмяОбъекта,ПолноеИмяМетаданных,Представление,ЕстьОрганизация,РазрешеноПроведение");
		ЗаполнитьЗначенияСвойств(ЗначениеВыбора, СтрокаВидыДокументов);
		ЗначениеВыбора.ИмяОбъекта = СтрокаВидыДокументов.ИмяОбъектаМетаданных;
		
		Результат.СписокВыбора.Добавить(
			ЗначениеВыбора,
			СтрокаВидыДокументов.Представление,
			СтрокиВыбранные.Количество() > 0);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПодсчитатьКоличествоДокументовПоРазделу(СписокВыбора, ИдентификаторРаздела)   

	СтрокиКэша = КэшРазделыУчета.НайтиСтроки(Новый Структура("Идентификатор",  ИдентификаторРаздела));
	Если СтрокиКэша.Количество() > 0 Тогда
		Если СтрокиКэша[0].Пометка Тогда    
			РазделБылВключен = Истина;
		Иначе
			РазделБылВключен = Ложь;
		КонецЕсли;
	Иначе
		РазделБылВключен = Ложь;
	КонецЕсли;

	БылиДополненияОрганизаций = СравнитьКэшОрганизацийИРеквизиты();

	СтрокиРаздела = ДокументыКВыгрузке.НайтиСтроки(Новый Структура("ИдентификаторРаздела", ИдентификаторРаздела));
	Для Каждого СтрокаРаздела Из СтрокиРаздела Цикл
		ДокументыКВыгрузке.Удалить(СтрокаРаздела);
	КонецЦикла;

	ТекстыЗапросов = Новый Массив;    
	
	Для Каждого ВидДокумента Из СписокВыбора Цикл   
		
		Если ВидДокумента.Пометка Тогда
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	Т.Ссылка КАК Ссылка,
			|	&ИдентификаторРаздела КАК ИдентификаторРаздела
			|ИЗ
			|	Документ.ПоступлениеВКассу КАК Т
			|ГДЕ
			|	Т.Дата >= &ДатаНачалаОтражения";
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.ПоступлениеВКассу", ВидДокумента.Значение.ПолноеИмяМетаданных);   
			
			Если ВидДокумента.Значение.ЕстьОрганизация Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	И Т.Организация В(&МассивОрганизаций)"; 
			КонецЕсли;
	
			Если ЗначениеЗаполнено(КэшДатаНачалаОтражения) И РазделБылВключен И НЕ БылиДополненияОрганизаций Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	И Т.Дата < &КэшДатаНачалаОтражения";
			КонецЕсли;       
			
			Если ВидДокумента.Значение.РазрешеноПроведение Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	И Т.Проведен";
			КонецЕсли;
	
			ТекстыЗапросов.Добавить(ТекстЗапроса);
		КонецЕсли;
	
	КонецЦикла;
	
	Разделитель = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|";
	
	ТекстЗапросаОбщий = СтрСоединить(ТекстыЗапросов, Разделитель);      
	
	КоличествоДокументов = 0;
	Если ЗначениеЗаполнено(ТекстЗапросаОбщий) Тогда
		Запрос = Новый Запрос(ТекстЗапросаОбщий);
		Запрос.УстановитьПараметр("ДатаНачалаОтражения", ДатаНачалаОтражения);     
		Запрос.УстановитьПараметр("КэшДатаНачалаОтражения", КэшДатаНачалаОтражения);     
		Запрос.УстановитьПараметр("ИдентификаторРаздела", ИдентификаторРаздела);     

		МассивОрганизаций = Новый Массив;
		Для Каждого СтрокаОрганизация Из ДоступныеОрганизации Цикл
			Если СтрокаОрганизация.Пометка Тогда
				МассивОрганизаций.Добавить(СтрокаОрганизация.Ссылка);
			КонецЕсли;  
		КонецЦикла;
		Запрос.УстановитьПараметр("МассивОрганизаций", МассивОрганизаций);
		Выборка = Запрос.Выполнить().Выбрать();     
	
		Пока Выборка.Следующий() Цикл 
			НоваяСтрока = ДокументыКВыгрузке.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
		КоличествоДокументов = Выборка.Количество();
	КонецЕсли;
	
	Возврат КоличествоДокументов;
	
КонецФункции

&НаСервере
Функция ПодсчитатьОбщееКоличествоДокументовПоРазделам()   
	Количество = РазделыУчета.Итог("Количество");
	Возврат Количество;
КонецФункции

&НаКлиенте
Процедура ПерейтиВПомощникСопоставленияОбъектовБухгалтерии()
	
	ШаблонСсылки = "СовместноеИспользование/ОткрытьПомощникСопоставленияОбъектов?node-id=%1";
	
	СовместноеИспользованиеКлиент.ПерейтиПоНавигационнойСсылкеВнешнегоПриложения(
		СтрШаблон(ШаблонСсылки, ИдентификаторЭтогоУзлаОбмена()),
		"БухгалтерияПредприятия");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИдентификаторЭтогоУзлаОбмена()
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.ЭтотУзел(), "Код");
	
КонецФункции

&НаКлиенте
Процедура НачатьСинхронизацию()
	
	НачатьСинхронизациюНаСервере();
	
	ОжидатьЗавершениеСинхронизацииДанных();
	
КонецПроцедуры

&НаСервере
Процедура НачатьСинхронизациюНаСервере(ВыполнитьОбновлениеДанных = Истина)

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Отражение документов'");
	ПараметрыВыполнения.ОжидатьЗавершение = 0;

	Если БухгалтерияПуста Тогда
		ИмяФункции = "Обработки.ОтражениеДокументовВБухгалтерии.ВыполнитьСценарийСинхронизацииДанных";
		УстановитьПривилегированныйРежим(Истина);
		ОписаниеСценария = Обработки.ОтражениеДокументовВБухгалтерии.ОсновнойСценарийСинхронизации(УзелОбмена);
		УстановитьПривилегированныйРежим(Ложь);
		ПараметрыФункции = ОписаниеСценария.Ссылка;    

		ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
			ПараметрыВыполнения,
			ИмяФункции,
			ПараметрыФункции);
	Иначе
		ИмяФункции = "Обработки.ОтражениеДокументовВБухгалтерии.ВыполнитьВыгрузкуЗарегистрированныхДанныхДляСопоставления";
		ПараметрыФункции = УзелОбмена;     
		
		ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
			ПараметрыВыполнения,
			ИмяФункции,
			ПараметрыФункции);
	КонецЕсли;
	
		
	Если ДлительнаяОперация.Статус = "Выполняется" Тогда
		Элементы.ГруппаНастройкиОтраженияВторойЭтап.ТекущаяСтраница = Элементы.СтраницаОжидание;   
		Элементы.ПодстраницыОжидания.ТекущаяСтраница = Элементы.СтраницаОтправкаДокументов;
	Иначе
		Если ДлительнаяОперация.Статус = "Выполнено" Тогда
			Элементы.ГруппаНастройкиОтраженияВторойЭтап.ТекущаяСтраница = Элементы.СтраницаУспех;
		ИначеЕсли ДлительнаяОперация.Статус = "Ошибка" Тогда
			ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ДлительнаяОперация.ИнформацияОбОшибке));
			Элементы.ГруппаНастройкиОтраженияВторойЭтап.ТекущаяСтраница = Элементы.СтраницаПараметрыДокументов;
		ИначеЕсли ДлительнаяОперация.Статус = "Отменено" Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Задание отменено.'"));
			Элементы.ГруппаНастройкиОтраженияВторойЭтап.ТекущаяСтраница = Элементы.СтраницаПараметрыДокументов;
		КонецЕсли;
		
		ДлительнаяОперация = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОжидатьЗавершениеСинхронизацииДанных()
	
	Если ЗначениеЗаполнено(ДлительнаяОперация) Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			ДлительнаяОперация,
			Новый ОписаниеОповещения("НачатьСинхронизациюЗавершение", ЭтотОбъект),
			ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура НачатьСинхронизациюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДлительнаяОперация = Неопределено;
	
	Если Результат = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Задание отменено.'"));
		Элементы.ГруппаНастройкиОтраженияВторойЭтап.ТекущаяСтраница = Элементы.СтраницаПараметрыДокументов;
		Возврат;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(КраткоеПредставлениеОшибки(Результат.ИнформацияОбОшибке));
		Элементы.ГруппаНастройкиОтраженияВторойЭтап.ТекущаяСтраница = Элементы.СтраницаНеудача;
		Возврат;  
	Иначе
		Элементы.ГруппаНастройкиОтраженияВторойЭтап.ТекущаяСтраница = Элементы.СтраницаУспех;
		Если БухгалтерияПуста Тогда    
			Элементы.ГруппаПредупреждениеБухгалтерияПуста.Видимость = Истина;
		Иначе
			Элементы.ГруппаПредупреждениеБухгалтерияНеПуста.Видимость = Истина;
		КонецЕсли;    
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПакетСопоставленияОбработан()    
	
	ДлительнаяОперация = ДлительнаяОперацияПолучитьНастройкиСовместногоИспользования(ТекущаяНастройка, УникальныйИдентификатор);
		
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДополнительныеПараметры = Новый Структура;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ДлительнаяОперация,
		Новый ОписаниеОповещения("ПолучитьНастройкиСовместногоИспользованияЗавершение", ЭтотОбъект, ДополнительныеПараметры),
		ПараметрыОжидания);
	
КонецФункции

&НаКлиенте
Процедура ПолучитьНастройкиСовместногоИспользованияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(КраткоеПредставлениеОшибки(Результат.ИнформацияОбОшибке));
		Возврат;
	КонецЕсли;
	
	Настройки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьАктивноеСообщение = Настройки.Получить("УзелОбмена").Получить("ПолученоСообщениеДляСопоставления");         
	
	Если ЕстьАктивноеСообщение Тогда
		Элементы.ГруппаНастройкиОтраженияВторойЭтап.ТекущаяСтраница = Элементы.СтраницаТребуетсяСопоставление;  
	Иначе
		Элементы.ГруппаНастройкиОтраженияВторойЭтап.ТекущаяСтраница = Элементы.СтраницаПараметрыДокументов;  
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Функция ДоступностьГруппыКомандНачалаРаботы()
	
	ЕстьВыбранныеОрганизации = Ложь;
	ЕстьНезаполненныеРеквизиты = Ложь;
	
	Для Каждого СтрокаОрганизации Из ДоступныеОрганизации Цикл
		Если СтрокаОрганизации.Пометка Тогда
			ЕстьВыбранныеОрганизации = Истина;
			ЕстьНезаполненныеРеквизиты = ЕстьНезаполненныеРеквизиты Или СтрокаОрганизации.ЕстьНезаполненныеРеквизиты;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьВыбранныеОрганизации И Не ЕстьНезаполненныеРеквизиты;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьДоступностьФлажковОрганизаций(ПараметрДоступность)       
	
	Для Каждого СтрокаОрганизации Из ДоступныеОрганизации Цикл
		ИмяФлажка = "Организация_" + СтрокаОрганизации.КлючСтроки;
		Элементы[ИмяФлажка].Доступность = ПараметрДоступность;
	КонецЦикла;
	
КонецПроцедуры  

&НаКлиенте
Процедура ВопросОтражениеВключеноЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда   
		ОтражениеВключено = Истина;
		Возврат;
	КонецЕсли; 
	
	Элементы.ДекорацияОжиданиеИспользоватьОтражение.Видимость = Истина;
	Элементы.ОтражениеВключено.Доступность = Ложь;
	
	Элементы.ДекорацияОжиданиеИспользоватьОтражение.Видимость = Ложь;
	Элементы.ОтражениеВключено.Доступность = Истина;
	Элементы.ГруппаНастройкиОтраженияПервыйЭтап.Доступность = Ложь;

	Элементы.ГруппаНастройкиОтраженияВторойЭтап.Доступность = Ложь;      
	Элементы.ГруппаКомандаНачать.Доступность = Ложь;
	
	ПодключитьОбработчикОжидания("ОтключитьМеханизмОтраженияДокументов", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти