
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВыборСклада") Тогда
		Заголовок = НСтр("ru = 'Выбор склада'");
		Элементы.СписокДанныеСтроки.Заголовок = НСтр("ru = 'Склады'");
		ОбщегоНазначенияРМКПереопределяемый.СформироватьЗапросСкладыДляРучногоВыбора(ЭтотОбъект);
	ИначеЕсли Параметры.Свойство("ВыборЯчейки") Тогда
		Заголовок = НСтр("ru = 'Выбор ячейки'");
		Элементы.СписокДанныеСтроки.Заголовок = НСтр("ru = 'Ячейки'");
		Склад = Параметры.Склад;
		ОбщегоНазначенияРМКПереопределяемый.СформироватьЗапросЯчейкиДляРучногоВыбора(ЭтотОбъект);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура СписокПродавцовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗафиксироватьВыбор();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ЗафиксироватьВыбор();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗафиксироватьВыбор()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Закрыть();
	Иначе
		
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("ДанныеСтроки", ТекущиеДанные.ДанныеСтроки);
		
		Закрыть(СтруктураСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти