#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если СостояниеПодключения = Перечисления.СостоянияРегистрацииКассовогоАппарата.НеПодключен Тогда
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьОбменСКассойMinikassir") Тогда
			Если Не ОбменСКассовымСерверомШтрихМ.ЕстьПодключенныеКассы() Тогда
				Константы.ИспользоватьОбменСКассойMinikassir.Установить(Ложь);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли