// @strict-types

#Область СлужебныеПроцедурыИФункции

#Область АсинхроннаяОперация

// Проверяет выполнение асинхронных операций в фоне.
// 
// Параметры:
//  АдресаРесурсовПоОрганизациям - Соответствие из КлючИЗначение:
//  * Ключ - ОпределяемыйТип.Организация
//  * Значение - Строка
//  
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
//
Функция ПроверитьВыполнениеАсинхронныхОперацииВФоне(Знач АдресаРесурсовПоОрганизациям) Экспорт
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(Новый УникальныйИдентификатор);
	
	ПараметрыПроверокОпераций = Новый Массив; // Массив из см. СервисОблачногоЭДО.НовыеПараметрыПроверкиВыполненияАсинхроннойОперации
	
	Для Каждого АдресРесурсаПоОрганизации Из АдресаРесурсовПоОрганизациям Цикл
		ПараметрыПроверки = СервисОблачногоЭДО.НовыеПараметрыПроверкиВыполненияАсинхроннойОперации();
		ПараметрыПроверки.Организация = АдресРесурсаПоОрганизации.Ключ;
		ПараметрыПроверки.АдресРесурса = АдресРесурсаПоОрганизации.Значение;
		ПараметрыПроверки.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
		ПараметрыПроверокОпераций.Добавить(ПараметрыПроверки);
	КонецЦикла;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"СервисОблачногоЭДО.ПроверитьВыполнениеАсинхронныхОпераций", ПараметрыПроверокОпераций);
	
КонецФункции

#КонецОбласти

#КонецОбласти
