
#Область СлужебныеПроцедурыИФункции

Процедура ЗаявкаКабинетСотрудникаПриЗаписиОбработчик(Источник) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.ДанныеЗаявокКабинетСотрудника.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, Источник);
	Запись.Заявка = Источник.Ссылка;
	Запись.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти
