
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТекСтрокаПолучатели = ПараметрыВыполненияКоманды.Источник.Элементы.Получатели.ТекущиеДанные;
	
	Если ТекСтрокаПолучатели = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭлектроннаяПочтаУНФКлиент.КонтактУжеСоздан(
		ТекСтрокаПолучатели.Контакт,
		НСтр("ru = 'Контакт уже создан.'"),
		ПараметрыВыполненияКоманды.Источник) Тогда
		Возврат;
	КонецЕсли;
	
	КИКонтактнойФормы = ПодготовитьКонтактнуюИнформациюПоДаннымКФ(ПараметрКоманды, ТекСтрокаПолучатели.КакСвязаться);
	Если КИКонтактнойФормы <> Неопределено Тогда
		ПараметрыФормы = ПараметрыФормыПоКФ(ПараметрКоманды, КИКонтактнойФормы, ТекСтрокаПолучатели.Контакт);
		ОткрытьФорму("Справочник.КонтактныеЛица.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник.Элементы.Получатели);
		Возврат;
	КонецЕсли;
	
	Если Не ЭлектроннаяПочтаУНФКлиент.АдресЭлектроннойПочтыЗаполнен(ПараметрыВыполненияКоманды.Источник, ТекСтрокаПолучатели.КакСвязаться) Тогда
		Возврат;
	КонецЕсли;

	ПараметрыФормы = ПараметрыФормыСозданияКонтакта(
	ПараметрКоманды,
	ТекСтрокаПолучатели.Контакт,
	ТекСтрокаПолучатели.КакСвязаться);
	
	ОткрытьФорму("Справочник.КонтактныеЛица.ФормаОбъекта",
	ПараметрыФормы,
	ПараметрыВыполненияКоманды.Источник.Элементы.Получатели);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПараметрыФормыПоКФ(ПараметрКоманды, КИКонтактнойФормы, Контакт)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("Контакт", Контакт);
	ИсточникПривлечения = ПолучитьЗначениеИсточникаПривлечения(ПараметрКоманды);
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура);
	ПараметрыФормы.ЗначенияЗаполнения.Вставить("ИсточникПривлечения", ИсточникПривлечения);
	ПараметрыФормы.Вставить("ДанныеИзКонтактнойФормы", КИКонтактнойФормы);
	Возврат ПараметрыФормы;
КонецФункции

&НаСервере
Функция ПодготовитьКонтактнуюИнформациюПоДаннымКФ(Событие, КакСвязаться)
	Возврат Справочники.КонтактныеФормыGoogle.ПодготовитьКонтактнуюИнформациюПоДаннымКФ(Событие, КакСвязаться);
КонецФункции

&НаСервере
Функция ПараметрыФормыСозданияКонтакта(ПараметрКоманды, Контакт, КакСвязаться)
	
	Результат = Новый Структура;
	Результат.Вставить("РежимВыбора", Истина);
	Результат.Вставить("ЗначенияЗаполнения", Новый Структура);
	
	ИсточникПривлечения = ПолучитьЗначениеИсточникаПривлечения(ПараметрКоманды);
	Результат.ЗначенияЗаполнения.Вставить("ИсточникПривлечения", ИсточникПривлечения);
	
	Если ТипЗнч(Контакт) = Тип("СправочникСсылка.Контрагенты") Тогда
		Результат.Вставить("Контрагент", Контакт);
		Возврат Результат;
	КонецЕсли;
	
	Результат.Вставить("КонтактКакСвязаться",Новый Структура);
	Результат.КонтактКакСвязаться.Вставить("Контакт", Контакт);
	Результат.КонтактКакСвязаться.Вставить("КакСвязаться", КакСвязаться);
	Результат.КонтактКакСвязаться.Вставить("ТипКИ", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьЗначениеИсточникаПривлечения(Событие)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Событие, "ИсточникПривлечения");
	
КонецФункции

#КонецОбласти
