#Область ПрограммныйИнтерфейс

// Возвращает представление лида с вариантом завершения "ПереведенВПокупателя"
// 
// Возвращаемое значение:
//  Строка - представление результата
//
Функция ПредставлениеРезультатаКачественногоЛида() Экспорт
	
	Возврат НСтр("ru = 'Качественный лид'");
	
КонецФункции

// Возвращает представление лида с вариантом завершения "НекачественныйЛид"
// 
// Возвращаемое значение:
//  Строка - представление результата
//
Функция ПредставлениеРезультатаНекачественногоЛида() Экспорт
	
	Возврат НСтр("ru = 'Некачественный лид'");
	
КонецФункции

// Возвращает представление незавершенного лида
// 
// Возвращаемое значение:
//  Строка - представление результата
//
Функция ПредставлениеРезультатаЛидаВРаботе() Экспорт
	
	Возврат НСтр("ru = 'В работе'");
	
КонецФункции

// Возвращает цвета областей под канбаном лидов, которые используются для переноса в них лидов
//
// Параметры:
//  ОттенокЦвета - Строка - "Зеленый", "Красный" или "Серый"
// 
// Возвращаемое значение:
//  Структура:
//   * ЦветРамки - Цвет - цвет рамки области
//   * ЦветТекста - Цвет - цвет текста области
//
Функция ЦветОбластиПодКанбаном(ОттенокЦвета = "") Экспорт
	
	Если ОттенокЦвета = "Зеленый" Тогда
		ЦветРамки = Новый Цвет(7, 178, 0);
		ЦветТекста = Новый Цвет(175, 212, 175);
	ИначеЕсли ОттенокЦвета = "Красный" Тогда
		ЦветРамки = Новый Цвет(255, 140, 140);
		ЦветТекста = Новый Цвет(230, 187, 187);
	Иначе
		ЦветРамки = Новый Цвет(160, 160, 160);
		ЦветТекста = Новый Цвет(190, 190, 190);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ЦветРамки", ЦветРамки);
	Результат.Вставить("ЦветТекста", ЦветТекста);
	
	Возврат Результат;
	
КонецФункции

// Последние выбранные варианты перевода лида с формы лида.
// 
// Возвращаемое значение:
//  Структура:
//   * КнопкаПереводаПервичногоЛида - Строка
//   * КнопкаПереводаПовторногоЛида - Строка
//
Функция АктивныеКнопкиПереводаЛидаИзХранилища() Экспорт
	
	Результат = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Справочники.Лиды", "АктивныеКнопкиПереводаЛида");
	
	Если Результат = Неопределено Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("КнопкаПереводаПервичногоЛида", "Покупатель");
		Результат.Вставить("КнопкаПереводаПовторногоЛида", "ЗаказПокупателя");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Сохранить последние выбранные варианты перевода лида с формы лида.
//
// Параметры:
//  АктивныеКнопкиПереводаЛида - Структура:
//   * КнопкаПереводаПервичногоЛида - Строка
//   * КнопкаПереводаПовторногоЛида - Строка
//
Процедура СохранитьАктивныеКнопкиПереводаЛидаВХранилище(АктивныеКнопкиПереводаЛида) Экспорт
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
	"Справочники.Лиды", "АктивныеКнопкиПереводаЛида", АктивныеКнопкиПереводаЛида);
	
КонецПроцедуры

#КонецОбласти