
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("АктуальнаяДатаСеанса", НачалоДня(ТекущаяДатаСеанса()));
	
	Если Параметры.Отбор.Свойство("Договор")
		И Параметры.Свойство("ДоговорКомиссии") И ЗначениеЗаполнено(Параметры.ДоговорКомиссии) Тогда
		Параметры.Отбор.Договор = Параметры.ДоговорКомиссии;
	КонецЕсли;
	
	Если Параметры.Свойство("СчетЗатрат") Тогда
		
		Если ЗначениеЗаполнено(Параметры.СчетЗатрат) Тогда
			
			Если Параметры.СчетЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Расходы
				И Параметры.СчетЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Доходы
				И Параметры.СчетЗатрат.ТипСчета <> Перечисления.ТипыСчетов.НезавершенноеПроизводство
				И Параметры.СчетЗатрат.ТипСчета <> Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда
				
				ОбщегоНазначения.СообщитьПользователю(НСтр(
					"ru = 'Для данного типа счета заказ покупателя не указывается.'"), , , , Отказ);
				
			КонецЕсли;
			
		Иначе
			
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не выбран счет.'"), , , , Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ВыбиратьЗаказНаряд")
		И Параметры.ВыбиратьЗаказНаряд Тогда
		Параметры.Отбор.Вставить("ВидОперации", Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд);
		АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru = 'Заказ-наряды'");
		ЭтотОбъект.ЭтоЗаказНаряд = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ВыбиратьЗаказПокупателя")
		И Параметры.ВыбиратьЗаказПокупателя Тогда
		Параметры.Отбор.Вставить("ВидОперации", Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу);
		АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru = 'Заказы покупателей'");
	КонецЕсли;
	
	Если Параметры.Свойство("ВидыОпераций") Тогда
		Если Параметры.ВидыОпераций[0] = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Заказ-наряды'");
			ЭтотОбъект.ЭтоЗаказНаряд = Истина;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ВидОперации",
			Параметры.ВидыОпераций, ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;
	
	Если Параметры.Свойство("ВозможнаПечатьЗаказаИзРМК") Тогда
		Элементы.ФормаПечатьЗаказаИзРМК.Видимость = Истина;
	КонецЕсли;
	
	СостоянияЗаказов.УстановитьУсловноеОформлениеОтмененногоЗаказа(
		Список.КомпоновщикНастроек.Настройки.УсловноеОформление);
	
	УстановитьУсловноеОформлениеПоЦветамСостоянийСервер();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"ФормаДокументПриходнаяНакладнаяСоздатьНаОсновании", 
		"Заголовок",
		НСтр("ru = 'Возврат от покупателя'"));
		
	// МобильноеПриложение
	Если МобильноеПриложениеВызовСервера.НужноОграничитьФункциональность() Тогда
		Элементы.ФормаОбщаяКомандаСтруктураПодчиненности.Видимость = Ложь;
		Элементы.ГруппаГлобальныеКомандыЗаказПокупателя.Видимость = Ложь;
	КонецЕсли;
	// Конец МобильноеПриложение
	
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(Список);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ЭтотОбъект.ЭтоЗаказНаряд И ИмяСобытия = "Запись_СостоянияЗаказНарядов")
		Или (Не ЭтотОбъект.ЭтоЗаказНаряд И ИмяСобытия = "Запись_СостоянияЗаказовПокупателей") Тогда
		
		УстановитьУсловноеОформлениеПоЦветамСостоянийСервер();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПечатьЗаказаИзРМК(Команда)
	
	СтруктураВыбора = Новый Структура;
	СтруктураВыбора.Вставить("ДокументЗаказ", Элементы.Список.ТекущиеДанные.Ссылка);
	СтруктураВыбора.Вставить("ПечатьЗаказа", Истина);
	Закрыть(СтруктураВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформлениеПоЦветамСостоянийСервер()
	
	СостоянияЗаказов.УстановитьУсловноеОформлениеПоЦветамСостояний(
		Список.КомпоновщикНастроек.Настройки.УсловноеОформление,
		?(ЭтотОбъект.ЭтоЗаказНаряд, Метаданные.Справочники.СостоянияЗаказНарядов.ПолноеИмя(),
			Метаданные.Справочники.СостоянияЗаказовПокупателей.ПолноеИмя()));
	
КонецПроцедуры

#КонецОбласти
