
#Область СлужебныйПрограммныйИнтерфейс

Процедура ФормаЭлементаВидаЗаказаПриСозданииНаСервере(Форма) Экспорт 
	
	Объект     = Форма.Объект; 
	ЭтотОбъект = Форма.ЭтотОбъект; 
	Элементы   = Форма.Элементы;
	
	СостояниеЗавершен = СостояниеЗавершенИзВидаЗаказа(Объект.Ссылка);
	ОтборСтрок = Новый Структура("Состояние", СостояниеЗавершен);
	
	СтрокаСостояниеЗавершен = Объект.ПорядокСостояний.НайтиСтроки(ОтборСтрок);
	ТаблицаСостояний = Объект.ПорядокСостояний;

	Если НЕ СтрокаСостояниеЗавершен.Количество() Тогда			
		
		НоваяСтрока = ТаблицаСостояний.Добавить();
		НоваяСтрока.Состояние = СостояниеЗавершен;
		НоваяСтрока.НаименованиеСостояния = СостояниеЗавершен.Наименование;
		НоваяСтрока.ЦветТекста = СостояниеЗавершен.Цвет.Получить();
		НоваяСтрока.ЦветФона = СостояниеЗавершен.ЦветФона.Получить();
		
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПорядокСостояний.Ссылка КАК Ссылка,
	|	ПорядокСостояний.НомерСтроки КАК НомерСтроки,
	|	ПорядокСостояний.Состояние КАК Состояние,
	|	СостоянияЗаказовПокупателей.ПометкаУдаления КАК ПометкаУдаления,
	|	СостоянияЗаказовПокупателей.Наименование КАК Наименование,
	|	СостоянияЗаказовПокупателей.Цвет КАК Цвет,
	|	СостоянияЗаказовПокупателей.ЦветФона КАК ЦветФона,
	|	СостоянияЗаказовПокупателей.Предопределенный КАК Предопределенный,
	|	СостоянияЗаказовПокупателей.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ПорядокСостояний
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
	|		ПО ПорядокСостояний.Состояние = СостоянияЗаказовПокупателей.Ссылка
	|ГДЕ ПорядокСостояний.Ссылка = &ВидЗаказа";
	
	Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.ВидыЗаказНарядов") Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВидыЗаказовПокупателей", "ВидыЗаказНарядов");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СостоянияЗаказовПокупателей", "СостоянияЗаказНарядов");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидЗаказа", Объект.Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Состояние Из Результат Цикл
		СостояниеВТаблице = ТаблицаСостояний.НайтиСтроки(Новый Структура("Состояние", Состояние.Состояние));
		Для Каждого НайденноеСостояние Из СостояниеВТаблице Цикл
			Если Состояние.Цвет.Получить() <> Неопределено Тогда
				НайденноеСостояние.ЦветТекста = Состояние.Цвет.Получить();
			КонецЕсли;
			Если Состояние.ЦветФона.Получить() <> Неопределено Тогда
				НайденноеСостояние.ЦветФона = Состояние.ЦветФона.Получить();
			КонецЕсли;
			НайденноеСостояние.ПометкаУдаления = Состояние.ПометкаУдаления;
			НайденноеСостояние.НаименованиеСостояния = Состояние.Наименование;
		КонецЦикла;
	КонецЦикла;
	
	НесколькоВидовЗаказов = ПолучитьФункциональнуюОпцию("Использовать" + Объект.Ссылка.Метаданные().Имя); 
	
	Если НЕ НесколькоВидовЗаказов Тогда
		
		ЭтотОбъект.АвтоЗаголовок = Ложь;  
		
		Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.ВидыЗаказовПокупателей") Тогда
			ЗаголовокФормы = НСтр("ru  = 'Состояния заказов покупателей'");
		Иначе
			ЗаголовокФормы = НСтр("ru  = 'Состояния заказ-нарядов'");
		КонецЕсли;
		ЭтотОбъект.Заголовок = ЗаголовокФормы;
		
		Элементы.Наименование.Видимость = Ложь;
		Элементы.Комментарий.Видимость = Ложь; 
		Элементы.ПорядокСостоянийДобавитьВсе.Видимость = Ложь;
		
		Элементы.ПорядокСостоянийКонтекстноеМенюУдалить.Видимость = Ложь;
		Элементы.ПорядокСостоянийУдалить.Видимость = Ложь;
		
	КонецЕсли;	
	
КонецПроцедуры

Функция СостояниеЗавершенИзВидаЗаказа(ВидЗаказа) Экспорт 

	Если ТипЗнч(ВидЗаказа) = Тип("СправочникСсылка.ВидыЗаказовПокупателей") Тогда
	
		СостояниеЗавершен = Справочники.СостоянияЗаказовПокупателей.Завершен;	
	
	ИначеЕсли ТипЗнч(ВидЗаказа) = Тип("СправочникСсылка.ВидыЗаказНарядов") Тогда
		
		СостояниеЗавершен = Справочники.СостоянияЗаказНарядов.Завершен;
	
	КонецЕсли;
	
	Возврат СостояниеЗавершен;

КонецФункции

#КонецОбласти