
#Область ПрограммныйИнтерфейс

// Возвращает структуру с настройками учетной записи.
//
// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиМаркетплейсов - Учетная запись для получения настроек.
// 
// Возвращаемое значение:
//  Структура - Настройки учетной записи, см. Справочники.УчетныеЗаписиМаркетплейсов.СтрокаИменНастроекУчетнойЗаписи().
//
Функция НастройкиУчетнойЗаписи(УчетнаяЗапись) Экспорт

	Возврат Справочники.УчетныеЗаписиМаркетплейсов.НастройкиУчетнойЗаписи(УчетнаяЗапись);

КонецФункции

// Возвращает список действующих учетных записей маркетплейсов.
//
// Возвращаемое значение:
//  СписокЗначений - Не помеченные на удаление учетные записи Ozon.
//
Функция СписокНастроекПодключенияКСервису() Экспорт
	
	Возврат ИнтеграцияСМаркетплейсомOzonСервер.СписокНастроекПодключенияКСервису();
	
КонецФункции

// Проверяет, что присоединенный файл является изображением.
//
// Параметры:
//  ПрисоединенныйФайл - СправочникСсылка - Ссылка на присоединенный файл.
//  Параметры - Структура - Возвращает тип файла.
//
// Возвращаемое значение:
//  Булево - признак изображения.
//
Функция ПрисоединенныйФайлЭтоИзображение( ПрисоединенныйФайл, Параметры = Неопределено ) Экспорт
	Возврат ИнтеграцияСМаркетплейсомOzonСервер.ПрисоединенныйФайлЭтоИзображение( ПрисоединенныйФайл, Параметры );
КонецФункции

// Формирует строковое представление товарной позиции Ozon по шаблону.
//
// Параметры:
//  Номенклатура   - СправочникСсылка.Номенклатура - 
//  Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - 
//  Упаковка       - СправочникСсылка.ЕдиницыИзмерения - 
//  ОбъектПубликации - СправочникСсылка.НоменклатураПрисоединенныеФайлы,
//                       - Если указано, то возвращается наименование данного объекта.
// 
// Возвращаемое значение:
//  Строка - Строковое представление товарной позиции Ozon.
//
Функция ПредставлениеТоварнойПозиции(Номенклатура, Характеристика, Упаковка = Неопределено, ОбъектПубликации = Неопределено) Экспорт
	Возврат ИнтеграцияСМаркетплейсомOzonСервер.ПредставлениеТоварнойПозиции(Номенклатура, Характеристика, Упаковка, ОбъектПубликации);
КонецФункции

#КонецОбласти
