
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ДанныеВходящегоПоИсточнику(Источник) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактЦентрВходящее.Источник КАК Источник,
	|	КонтактЦентрВходящее.Ответственный КАК Ответственный,
	|	КонтактЦентрВходящее.ЭтоОбсуждениеМессенджера КАК ЭтоОбсуждениеМессенджера,
	|	КонтактЦентрВходящее.Описание КАК Описание,
	|	КонтактЦентрВходящее.ОтКого КАК ОтКого,
	|	КонтактЦентрВходящее.ТипВнешнейСистемы КАК ТипВнешнейСистемы
	|ИЗ
	|	РегистрСведений.КонтактЦентрВходящее КАК КонтактЦентрВходящее
	|ГДЕ
	|	КонтактЦентрВходящее.Источник = &Источник";
	
	Запрос.УстановитьПараметр("Источник", Источник);
	Выборка = Запрос.Выполнить().Выбрать();
	Описание = КонтактЦентр.ОписаниеВходящего();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Описание, Выборка);
		Возврат Описание;
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#КонецЕсли