////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции формирования отчетности по НДС.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область РасширенныйНалоговыйПериод

// Определяет нужно или нет представлять отчетность за квартал, внутри которого находится переданная дата.
// Параметры:
//  Организация - СправочникСсылка.Организации - Проверяемая организация.
//  Период      - Дата - на которую определяется необходимость представления отчетности по НДС.
//
// Возвращаемое значение:
//  Булево - Истина - отчетность по НДС необходимо представить,
//           Ложь   - отчетность по НДС не представляется.
Функция ОтчетностьПоНДСПредставляется(Организация, Период) Экспорт
	
	БлижайшийНалоговыйПериод = ИнтерфейсыВзаимодействияБРО.БлижайшийНалоговыйПериод(
		Организация,
		Период,
		Перечисления.ВариантыРасширенногоПервогоНалоговогоПериода.РегистрацияВПоследние10ДнейКвартала,
		Перечисления.Периодичность.Квартал);
	
	Возврат БлижайшийНалоговыйПериод.Конец = КонецДня(КонецКвартала(Период));

КонецФункции

// Определяет соответствие выбранного в отчете периода налоговому.
// Параметры:
//  Организация   - СправочникСсылка.Организация - организация, для которой определяется налоговый период,
//  НачалоПериода - Дата - начало периода отчета,
//  КонецПериода  - Дата - конец периода отчета.
//
// Возвращаемое значение:
//  Булево - Истина - период соответствует налоговому, можно формировать отчет по стандартной форме (с шапкой и подписями)
//           Ложь   - период не соответствует налоговому, отчет формируется без шапки и подписей.
Функция ПериодОтчетаСоответствуетНалоговому(Организация, НачалоПериода, КонецПериода) Экспорт
	
	БлижайшийНалоговыйПериод = ИнтерфейсыВзаимодействияБРО.БлижайшийНалоговыйПериод(
		Организация,
		КонецПериода,
		Перечисления.ВариантыРасширенногоПервогоНалоговогоПериода.РегистрацияВПоследние10ДнейКвартала,
		Перечисления.Периодичность.Квартал);
		
	Возврат БлижайшийНалоговыйПериод.Начало = НачалоПериода
	      И БлижайшийНалоговыйПериод.Конец = КонецДня(КонецПериода);
	
КонецФункции

// Определяет начало налогового периода по НДС.
// Параметры:
//  Организация - СправочникСсылка.Организации - Организация.
//  Период      - Дата - внутри налогового периода, для которого необходимо определить начало.
//
// Возвращаемое значение:
//  Дата - начало налогового периода по НДС, если отчетность в данном периоде представляется
//         или начало квартала, если отчетность не представляется.
Функция НачалоНалоговогоПериода(Организация, Период) Экспорт
	
	НачалоНалоговогоПериода = ИнтерфейсыВзаимодействияБРО.НачалоНалоговогоПериода(
		Организация,
		Период,
		Перечисления.ВариантыРасширенногоПервогоНалоговогоПериода.РегистрацияВПоследние10ДнейКвартала,
		Перечисления.Периодичность.Квартал,
		Ложь);
		
	Если ЗначениеЗаполнено(НачалоНалоговогоПериода) Тогда
		Возврат НачалоНалоговогоПериода;
	Иначе
		Возврат НачалоКвартала(Период);
	КонецЕсли;
	
КонецФункции

// Определяет, находятся ли переданные даты внутри одного налогового периода по НДС.
// Параметры:
//  Организация   - СправочникСсылка.Организация - организация.
//  НачалоПериода - Дата - начало периода отчета.
//  КонецПериода  - Дата - конец периода отчета.
//
// Возвращаемое значение:
//  Булево - Истина - переданные даты находятся внутри одного налогового периода,
//           Ложь   - даты расположены в разных налоговых периодах.
Функция ДатыРасположеныВнутриОдногоНалоговогоПериода(Организация, НачалоПериода, КонецПериода) Экспорт
	
	БлижайшийНалоговыйПериод = ИнтерфейсыВзаимодействияБРО.БлижайшийНалоговыйПериод(
		Организация,
		КонецПериода,
		Перечисления.ВариантыРасширенногоПервогоНалоговогоПериода.РегистрацияВПоследние10ДнейКвартала,
		Перечисления.Периодичность.Квартал);
		
	Если КонецДня(КонецКвартала(КонецПериода)) < БлижайшийНалоговыйПериод.Конец Тогда
		// Учет еще не ведется, необходимо просто проверить, что даты находятся в одном квартале.
		Возврат НачалоКвартала(НачалоПериода) = НачалоКвартала(НачалоПериода);
	КонецЕсли;
		
	Возврат БлижайшийНалоговыйПериод.Начало <= НачалоПериода
	        И КонецДня(КонецПериода) <= БлижайшийНалоговыйПериод.Конец;
	
КонецФункции

// Возвращает ближайший налоговый период.
// См. Перечисления.ВариантыРасширенногоПервогоНалоговогоПериода.БлижайшийНалоговыйПериод.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - Организация.
//	Период - Дата - Дата периода.
//
// Возвращаемое значение:
//	Структура - Содержит ключи:
//    * Период - Дата - стандартное начало налогового периода (например, 01 июля для третьего квартала);
//    * Начало - Дата - фактическое начало налогового периода (может совпадать со стандартным началом или
//               датой регистрации организации;
//    * Конец  - Дата - дата с указанием времени.
// 
Функция БлижайшийНалоговыйПериод(Организация, Период) Экспорт
	
	Возврат ИнтерфейсыВзаимодействияБРО.БлижайшийНалоговыйПериод(
		Организация,
		Период,
		Перечисления.ВариантыРасширенногоПервогоНалоговогоПериода.РегистрацияВПоследние10ДнейКвартала,
		Перечисления.Периодичность.Квартал);
	
КонецФункции

#КонецОбласти

#Область ОбщиеПроцедурыИФункцииОтчетов

// Вызывается при создании формы отчета по НДС.
//
// Параметры:
//	Форма - УправляемаяФорма - Форма отчета.
//
Процедура ФормаОтчетаПриСозданииНаСервере(Форма) Экспорт
	
	Отчет = Форма.Отчет;
	
	Если НЕ ЗначениеЗаполнено(Отчет.Организация) Тогда
		Отчет.Организация = Справочники.Организации.ОсновнаяОрганизация;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Отчет.КонецПериода) Тогда
		Отчет.КонецПериода = КонецКвартала(ОбщегоНазначения.ТекущаяДатаПользователя());
		Если НЕ ЗначениеЗаполнено(Отчет.НачалоПериода) Тогда
			// В случае расширенного налогового периода необходимо правильно указать дату начала.
			Отчет.НачалоПериода = НачалоНалоговогоПериода(
				Отчет.Организация, Отчет.КонецПериода);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Отчет.НачалоПериода) Тогда
		Отчет.НачалоПериода = НачалоКвартала(ОбщегоНазначения.ТекущаяДатаПользователя());
	КонецЕсли;
	
	УчетНДСКлиентСервер.ОтобразитьПоясненияКПериодуОтчета(Форма);

	УстановитьАктивностьКнопокКоманднойПанели(Форма);

КонецПроцедуры      

// Вызывается при выборе периода в форме отчета НДС.
//
// Параметры:
//	Форма - УправляемаяФорма - Форма отчета.
//
Процедура ФормаОтчетаОбработатьВыборПериода(Форма) Экспорт
	
	Отчет = Форма.Отчет;
	
	Если НачалоКвартала(Отчет.КонецПериода) = Отчет.НачалоПериода
		И КонецКвартала(Отчет.КонецПериода) = КонецДня(Отчет.КонецПериода) Тогда
		// Выбран квартал. В случае расширенного налогового периода необходимо правильно указать дату начала.
		Отчет.НачалоПериода = НачалоНалоговогоПериода(
			Отчет.Организация, Отчет.КонецПериода);
	КонецЕсли;
	
	УчетНДСКлиентСервер.ОтобразитьПоясненияКПериодуОтчета(Форма);
	
КонецПроцедуры

Процедура ДополнитьИнформациейОРНПТ(ДополнительнаяИнформация, СтруктураПараметров, Запрос, ПоискРНПТПоОснованию = Ложь) Экспорт

	УчетНДСУНФ.ДополнитьИнформациейОРНПТ(ДополнительнаяИнформация, СтруктураПараметров, Запрос, ПоискРНПТПоОснованию);

КонецПроцедуры

Процедура ДополнитьПокупкиИнформациейОНомерахДекларацийНаТовары(ДополнительнаяИнформация, СтруктураПараметров, Запрос) Экспорт
	
	УчетНДСУНФ.ДополнитьПокупкиИнформациейОНомерахДекларацийНаТовары(ДополнительнаяИнформация, СтруктураПараметров, Запрос);

КонецПроцедуры

Процедура ДополнитьИнформациейОПосредникахИПлатежах(ДополнительнаяИнформация, СтруктураПараметров, Запрос) Экспорт
	
	УчетНДСУНФ.ДополнитьИнформациейОПосредникахИПлатежах(ДополнительнаяИнформация, СтруктураПараметров, Запрос);

КонецПроцедуры

Процедура ДополнитьИнформациейОТНВЭД(ДополнительнаяИнформация, Запрос) Экспорт

	УчетНДСУНФ.ДополнитьИнформациейОТНВЭД(ДополнительнаяИнформация, Запрос);

КонецПроцедуры

Процедура ДополнитьПродажиИнформациейОНомерахДекларацийНаТовары(ДополнительнаяИнформация, СтруктураПараметров, Запрос) Экспорт

	УчетНДСУНФ.ДополнитьПродажиИнформациейОНомерахДекларацийНаТовары(ДополнительнаяИнформация, СтруктураПараметров, Запрос);

КонецПроцедуры

Процедура ПреобразоватьПоказателиРНПТКСторнирующейЗаписи(МассивСвРегНом) Экспорт
	
	УчетНДСУНФ.ПреобразоватьПоказателиРНПТКСторнирующейЗаписи(МассивСвРегНом);
	
КонецПроцедуры

Функция ТекстЗапросаПодготовкаСведенийРНПТЖурнал() Экспорт
	
	Возврат УчетНДСУНФ.ТекстЗапросаПодготовкаСведенийРНПТЖурнал();
	
КонецФункции

// Процедура подготавливает в менеджере временных таблиц таблицу
// с суммами НДС с межценовой разницы.
//
// Параметры:
//	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер, в который помещается таблицы.
//
//		На выходе содержит таблицу НДССМежценовойРазницы с колонками:
//			* СуммаНДСМежценоваяРазницаОсновнаяРасчетнаяСтавка - Число - сумма НДС с межценовой разницы по ставкам 20/120, 16,67%.
//			* СуммаНДСМежценоваяРазницаПониженнаяРасчетнаяСтавка - Число - сумма НДС с межценовой разницы по ставкам 10/110, 9,09%.
//
Процедура СуммаНДССМежценовойРазницы(МенеджерВременныхТаблиц, ПараметрыОсновногоЗапроса) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Для Каждого Параметр Из ПараметрыОсновногоЗапроса Цикл
		Запрос.Параметры.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(Запрос.Параметры, ПараметрыОсновногоЗапроса);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТаблицаМежценоваяРазница.СтавкаНДС = &ОбщаяРасчетнаяСтавкаНДС
	|			ТОГДА ТаблицаМежценоваяРазница.СуммаНДС
	|	КОНЕЦ КАК СуммаНДСМежценоваяРазницаОсновнаяРасчетнаяСтавка,
	|	ВЫБОР
	|		КОГДА ТаблицаМежценоваяРазница.СтавкаНДС = &СтавкаНДС10_110
	|			ТОГДА ТаблицаМежценоваяРазница.СуммаНДС
	|	КОНЕЦ КАК СуммаНДСМежценоваяРазницаПониженнаяРасчетнаяСтавка
	|ПОМЕСТИТЬ НДССМежценовойРазницыПредварительная
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК ТаблицаМежценоваяРазница
	|ГДЕ
	|	ТаблицаМежценоваяРазница.НалоговаяБазаНДС > 0
	|	И ТаблицаМежценоваяРазница.Ссылка.Организация В(&Организация)
	|	И ТаблицаМежценоваяРазница.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТаблицаМежценоваяРазница.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(НДССМежценовойРазницыПредварительная.СуммаНДСМежценоваяРазницаОсновнаяРасчетнаяСтавка) КАК СуммаНДСМежценоваяРазницаОсновнаяРасчетнаяСтавка,
	|	СУММА(НДССМежценовойРазницыПредварительная.СуммаНДСМежценоваяРазницаПониженнаяРасчетнаяСтавка) КАК СуммаНДСМежценоваяРазницаПониженнаяРасчетнаяСтавка
	|ПОМЕСТИТЬ НДССМежценовойРазницы
	|ИЗ
	|	НДССМежценовойРазницыПредварительная КАК НДССМежценовойРазницыПредварительная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НДССМежценовойРазницыПредварительная";
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Настраивает кнопки командной панели.
//
// Параметры:
//  Форма        - ФормаКлиентскогоПриложения - на командной панели которой есть кнопка ПредварительныйПросмотр.
//
Процедура УстановитьАктивностьКнопокКоманднойПанели(Форма) Экспорт

	Если Не ПравоДоступа("Вывод", Метаданные) Тогда
		// Делает неактивной кнопку "Сохранить", если пользователю не разрешён вывод.
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы, "Сохранить", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы, "СохранитьВсеДействия", "Доступность", Ложь);

	КонецЕсли;
	
	Если ОбщегоНазначения.ЭтоВебКлиент() Тогда
		// Скрывает кнопку "Предварительный просмотр" при работе через браузер, т.к. она работает также как "Печать".
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы, "ПредварительныйПросмотр", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы, "ПредварительныйПросмотрВсеДействия", "Видимость", Ложь);

	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область РаботаСоСчетамиФактурами

// Функция возвращает структуру реквизитов счета-фактуры для вывода в табличные документы книги покупок и книги продаж.
//
// Параметры:
// 	ЗаписьКниги - ВыборкаИзРезультатаЗапроса - Строка выборки, содержащая регистрационную запись книги покупок или продаж.
//
Функция ОпределитьДатуИНомерСчетаФактурыДляПечати(ЗаписьКниги) Экспорт

	ПредставлениеСчетаФактуры = НовыйПредставлениеСчетаФактуры();
	
	Если НЕ ЗначениеЗаполнено(ЗаписьКниги.СчетФактура) Тогда
		Возврат ПредставлениеСчетаФактуры;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаписьКниги.ДатаСчетаФактуры) И ЗначениеЗаполнено(ЗаписьКниги.НомерСчетаФактуры) Тогда
		
		Если ЗаписьКниги.ОбрабатыватьНомерДокумента Тогда			
			НомерСФ = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ЗаписьКниги.НомерСчетаФактуры, Истина, Истина);
		Иначе
			НомерСФ = СокрЛП(ЗаписьКниги.НомерСчетаФактуры);
		КонецЕсли;
		ДатаСФ 	= Формат(ЗаписьКниги.ДатаСчетаФактуры, "ДФ=dd.MM.yyyy");

		ИмяДокумента = ЗаписьКниги.СчетФактура.Метаданные().Синоним;
		Представление = СтрШаблон(НСтр("ru='%1 № %2 от %3'"),
			ИмяДокумента,
			НомерСФ,
			ДатаСФ);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СокрЛП(НомерСФ)) Тогда
		ПредставлениеСчетаФактуры.ДатаНомер   = СтрШаблон(НСтр("ru='%1;%2'"), ДатаСФ, НомерСФ);
		ПредставлениеСчетаФактуры.НомерДата   = СтрШаблон(НСтр("ru='%1;%2'"), НомерСФ, ДатаСФ);
		ПредставлениеСчетаФактуры.НомерОтДата = СтрШаблон(НСтр("ru='%1 от %2'"), НомерСФ, ДатаСФ);
	КонецЕсли;
	
	ПредставлениеСчетаФактуры.Номер         = СокрЛП(НомерСФ);
	ПредставлениеСчетаФактуры.Дата          = ДатаСФ;
	ПредставлениеСчетаФактуры.Представление = Представление;
	
	Возврат ПредставлениеИсправленногоКорректировочногоСчетаФактуры(ПредставлениеСчетаФактуры, ЗаписьКниги);

КонецФункции

// Возвращает реквизиты счета-фактуры для формирования ее представления.
//
// Возвращаемое значение:
//	Структура -  см. Результат.
//
Функция НовыйПредставлениеСчетаФактуры() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ДатаНомер"    , "");
	Результат.Вставить("НомерДата"    , "");
	Результат.Вставить("НомерОтДата"  , "");
	Результат.Вставить("Дата"         , "");
	Результат.Вставить("Номер"        , "");
	Результат.Вставить("Представление", "");
	
	Результат.Вставить("НомерДатаКорректировочный"  , "");
	Результат.Вставить("НомерОтДатаКорректировочный", "");
	Результат.Вставить("ДатаКорректировочный"       , "");
	Результат.Вставить("НомерКорректировочный"      , "");
	
	Результат.Вставить("НомерДатаИсправленный"  , "");
	Результат.Вставить("НомерОтДатаИсправленный", "");
	Результат.Вставить("ДатаИсправленный"       , "");
	Результат.Вставить("НомерИсправленный"      , "");
	
	Результат.Вставить("НомерДатаИсправленныйКорректировочный"  , "");
	Результат.Вставить("НомерОтДатаИсправленныйКорректировочный", "");
	Результат.Вставить("ДатаИсправленныйКорректировочный"       , "");
	Результат.Вставить("НомерИсправленныйКорректировочный"      , "");
	
	Возврат Результат;
	
КонецФункции

// Дополняет представление счета-фактуры данными о корректировочном счете-фактуре.
//
// Параметры:
//	ПредставлениеСчетаФактуры - Структура - Сведения о счете-фактуре, см. НовыйПредставлениеСчетаФактуры().
// 	ЗаписьКниги - ВыборкаИзРезультатаЗапроса - Строка выборки, содержащая регистрационную запись книги покупок или продаж.
//
// Возвращаемое значение:
//	Структура - см. НовыйПредставлениеСчетаФактуры().
//
Функция ПредставлениеИсправленногоКорректировочногоСчетаФактуры(ПредставлениеСчетаФактуры, ЗаписьКниги) Экспорт
	
	Если ЗначениеЗаполнено(СокрЛП(ЗаписьКниги.НомерКорректировки)) Тогда
		ПредставлениеСчетаФактуры.НомерКорректировочный = СокрЛП(ЗаписьКниги.НомерКорректировки);
		ПредставлениеСчетаФактуры.ДатаКорректировочный = Формат(ЗаписьКниги.ДатаКорректировки, "ДФ=dd.MM.yyyy");
		ПредставлениеСчетаФактуры.НомерДатаКорректировочный = СтрШаблон(НСтр("ru='%1;%2'"), 
			ПредставлениеСчетаФактуры.НомерКорректировочный, ПредставлениеСчетаФактуры.ДатаКорректировочный);
		ПредставлениеСчетаФактуры.НомерОтДатаКорректировочный = СтрШаблон(НСтр("ru='%1 от %2'"), 
			ПредставлениеСчетаФактуры.НомерКорректировочный, ПредставлениеСчетаФактуры.ДатаКорректировочный);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СокрЛП(ЗаписьКниги.НомерИсправления)) Тогда
		ПредставлениеСчетаФактуры.НомерИсправленный = СокрЛП(ЗаписьКниги.НомерИсправления);
		ПредставлениеСчетаФактуры.ДатаИсправленный = Формат(ЗаписьКниги.ДатаИсправления, "ДФ=dd.MM.yyyy");
		ПредставлениеСчетаФактуры.НомерДатаИсправленный = СтрШаблон(НСтр("ru='%1;%2'"), 
			ПредставлениеСчетаФактуры.НомерИсправленный, ПредставлениеСчетаФактуры.ДатаИсправленный);
		ПредставлениеСчетаФактуры.НомерОтДатаИсправленный = СтрШаблон(НСтр("ru='%1 от %2'"), 
			ПредставлениеСчетаФактуры.НомерИсправленный, ПредставлениеСчетаФактуры.ДатаИсправленный);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СокрЛП(ЗаписьКниги.НомерИсправленияКорректировки)) Тогда
		ПредставлениеСчетаФактуры.НомерИсправленныйКорректировочный = СокрЛП(ЗаписьКниги.НомерИсправленияКорректировки);
		ПредставлениеСчетаФактуры.ДатаИсправленныйКорректировочный = 
			Формат(ЗаписьКниги.ДатаИсправленияКорректировки, "ДФ=dd.MM.yyyy");
		ПредставлениеСчетаФактуры.НомерДатаИсправленныйКорректировочный = СтрШаблон(НСтр("ru='%1;%2'"),
			ПредставлениеСчетаФактуры.НомерИсправленныйКорректировочный, 
			ПредставлениеСчетаФактуры.ДатаИсправленныйКорректировочный);
		ПредставлениеСчетаФактуры.НомерОтДатаИсправленныйКорректировочный = СтрШаблон(НСтр("ru='%1 от %2'"),
			ПредставлениеСчетаФактуры.НомерИсправленныйКорректировочный, 
			ПредставлениеСчетаФактуры.ДатаИсправленныйКорректировочный);
	КонецЕсли;

	Возврат ПредставлениеСчетаФактуры;
	
КонецФункции

// Функция определяет наличие счетов-фактур, полученных по документам,
// которые могут являться основаниями для ввода счетов-фактур полученных.
//
// Применяется для контроля за наличием в ИБ информации о наличии счетов-фактур.
//
// Параметры:
//  ПараметрыПоискаСчетовФактур - Структура - параметры поиска счетов-фактур.
//                                См. конструктор параметров УчетНДС.НовыйПараметрыПоискаСчетовФактур().
//   * НачалоПериода - Дата - Начальная дата выборки (включительно, с 00:00:00)
//   * КонецПериода  - Дата - Конечная дата выборки (включительно, по 23:59:59)
//   * Организация   - СправочникСсылка.Организации - Организация, по которой
//                     осуществляется поиск. Если организация не задана, то поиск
//                     ведется по всем организациям.
//   * Фильтр        - Документ.Ссылка, Массив, Неопределено - Документ или список документов,
//                     по которым осуществляется поиск.
//                     Если не задан, поиск осуществляется по всем документам,
//                     которые могут являться основаниями для ввода счетов-фактур
//                     полученных.
//   * ВсеКромеФильтра  - Булево - Признак отбора документов, не входящих в Фильтр.
//
//   * НаличиеСчетаФактуры - Булево, Неопределено - Признак отбора документов:
//                           Истина - искать документы, по которым существуют счета-фактуры.
//                           Ложь - искать документы, по которым счета-фактуры отсутствуют.
//                           Неопределено - поиск осуществляется для всех документов.
//   * СчетФактураПроведен - Булево, Неопределено - Признак отбора счетов-фактур:
//                           Истина - искать проведенные счета-фактуры.
//                           Ложь - искать непроведенные счета-фактуры.
//                           Неопределено - осуществляется поиск всех счетов-фактур.
//   * ДатаСФНеБолее    - Дата, Неопределено - крайняя дата поиска счетов-фактур.
//   * ИскатьПоОборотам - Булево - Истина - поиск осуществляется по оборотам регистра накопления НДСПредъявленный,
//                                 Ложь - поиск осуществляется по остаткам.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица значений - Состав колонок:
//   * Документ - ДокументСсылка - Документ, по которому производился поиск счета-фактуры полученного.
//   * СчетФактура - ДокументСсылка, Неопределено - Ссылка на счет-фактуру полученный.
//
Функция ОпределитьНаличиеСчетовФактурПолученных(ПараметрыПоискаСчетовФактур) Экспорт

	НачПериода          = ПараметрыПоискаСчетовФактур.НачалоПериода;
	КонПериода          = ПараметрыПоискаСчетовФактур.КонецПериода;
	Организация         = ПараметрыПоискаСчетовФактур.Организация;
	Фильтр              = ПараметрыПоискаСчетовФактур.Фильтр;
	ВсеКромеФильтра     = Ложь;
	НаличиеСчетаФактуры = ПараметрыПоискаСчетовФактур.НаличиеСчетаФактуры;
	СчетФактураПроведен = ПараметрыПоискаСчетовФактур.СчетФактураПроведен;
	ДатаСФНеБолее       = ПараметрыПоискаСчетовФактур.ДатаСФНеБолее;
	ЭтоОтчет            = ПараметрыПоискаСчетовФактур.ИскатьПоОборотам;
	
	Запрос = Новый Запрос();

	Запрос.УстановитьПараметр("НачПериода",  		НачПериода);
	Запрос.УстановитьПараметр("КонПериода",  		?(НЕ ЗначениеЗаполнено(КонПериода), '00010101', КонецДня(КонПериода)));
	Запрос.УстановитьПараметр("КонПериодаГраница", 	?(НЕ ЗначениеЗаполнено(КонПериода), 
															'00010101', Новый Граница(КонецДня(КонПериода), ВидГраницы.Включая)));
	Запрос.УстановитьПараметр("ДатаСФНеБолее",  	?(НЕ ЗначениеЗаполнено(ДатаСФНеБолее), Неопределено,КонецДня(ДатаСФНеБолее)));
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Фильтр",      		Фильтр);
	Запрос.УстановитьПараметр("ЭтоОтчет", 			ЭтоОтчет);

	МассивСубконто = Новый Массив;
	//МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СФПолученные);
	//Запрос.УстановитьПараметр("СчетУчетаНДС", ПланыСчетов.Хозрасчетный.НДСпоПриобретеннымЦенностям);
	//Запрос.УстановитьПараметр("МассивСубконто", МассивСубконто);
	//Запрос.УстановитьПараметр("СчетНДС", ПланыСчетов.Хозрасчетный.НДС);

	// Дополняем условие запроса отбором по организации.
	Условие_Основание = ?(НЕ ЗначениеЗаполнено(Организация), "", "Организация в (&Организация) ");
	
	// Дополняем условие запроса отбором по документу-основанию или списку документов-оснований.
	Условие_Основание = Условие_Основание
				   + ?(НЕ ЗначениеЗаполнено(Фильтр), "", ?(НЕ ЗначениеЗаполнено(Условие_Основание), "", " И ") + "СчетФактура " + ?(ВсеКромеФильтра, " НЕ ", "") + " В (&Фильтр) ");

	// Дополняем условие запроса отбором по периоду.
	Если (ЗначениеЗаполнено(НачПериода)) И (ЗначениеЗаполнено(КонПериода)) Тогда
		УсловиеЗапроса = "Субконто1.Дата МЕЖДУ &НачПериода И &КонПериода
		                 |";
	ИначеЕсли (ЗначениеЗаполнено(НачПериода)) И (НЕ ЗначениеЗаполнено(КонПериода)) Тогда
		УсловиеЗапроса = "Субконто1.Дата >= &НачПериода
		                 |";
	ИначеЕсли (НЕ ЗначениеЗаполнено(НачПериода)) И (ЗначениеЗаполнено(КонПериода)) Тогда
		УсловиеЗапроса = "Субконто1.Дата <= &КонПериода
		                 |";
	Иначе
		УсловиеЗапроса = "";
	КонецЕсли;

	// Дополняем условие запроса отбором по признаку наличия/отсутствия счета-фактуры.
	УсловиеЗапроса = УсловиеЗапроса 
					+ ?(НаличиеСчетаФактуры = Неопределено, "", ?(НЕ ЗначениеЗаполнено(УсловиеЗапроса), "", " И ") + ?(НаличиеСчетаФактуры, "НЕ (", "(") + "
					|	ВЫБОР
					|		КОГДА ХозрасчетныйОбороты.Субконто1 <> НЕОПРЕДЕЛЕНО     // в БРУ отдельных документов счетов-фактур нет.
					|			ТОГДА ХозрасчетныйОбороты.Субконто1
					|		ИНАЧЕ NULL
					|	КОНЕЦ ЕСТЬ NULL) ");
	// Дополняем условие запроса отбором по признаку проведения счета-фактуры.
	УсловиеЗапроса = УсловиеЗапроса
	               + ?(СчетФактураПроведен = Неопределено, "", ?(НЕ ЗначениеЗаполнено(УсловиеЗапроса), "", " И ") + "
					|	ВЫБОР
					|		КОГДА ХозрасчетныйОбороты.Субконто1 <> НЕОПРЕДЕЛЕНО    // в БРУ отдельных документов счетов-фактур нет.
					|			ТОГДА ХозрасчетныйОбороты.Субконто1.Проведен
					|		ИНАЧЕ ЛОЖЬ
					|	КОНЕЦ = " + ?(СчетФактураПроведен, "ИСТИНА", "ЛОЖЬ") + " ");

	// Дополняем условие запроса отбором по дате СФ.
	УсловиеЗапроса = УсловиеЗапроса
	               + ?(НЕ ЗначениеЗаполнено(ДатаСФНеБолее), "", ?(НЕ ЗначениеЗаполнено(УсловиеЗапроса), "", " И ") + "
					|	ВЫБОР
					|		КОГДА ХозрасчетныйОбороты.Субконто1 <> НЕОПРЕДЕЛЕНО    // в БРУ отдельных документов счетов-фактур нет.
					|			ТОГДА ХозрасчетныйОбороты.Субконто1.Дата
					|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
					|	КОНЕЦ <= &ДатаСФНеБолее ");

	// Дополняем условие запроса соединением условий "И".
	УсловиеЗапроса = ?(НЕ ЗначениеЗаполнено(УсловиеЗапроса), "", " И " + УсловиеЗапроса);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ХозрасчетныйОбороты.Субконто1, НЕОПРЕДЕЛЕНО) КАК Документ,
	|	ЕСТЬNULL(ХозрасчетныйОбороты.Субконто1, НЕОПРЕДЕЛЕНО) КАК ДокументОснование, // в БРУ отдельных документов счетов-фактур нет.
	|	ЕСТЬNULL(ХозрасчетныйОбороты.Субконто1, НЕОПРЕДЕЛЕНО) КАК СчетФактура,
	|	ЕСТЬNULL(ХозрасчетныйОбороты.Субконто1.Контрагент, НЕОПРЕДЕЛЕНО) КАК Контрагент,
	|	Истина КАК Оригинал,
	|	0 КАК СуммаДокумента,
	|	ЕСТЬNULL(ХозрасчетныйОбороты.Субконто1.Проведен, ЛОЖЬ) КАК СчетФактураПроведен,
	|	ЕСТЬNULL(ХозрасчетныйОбороты.Субконто1.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК СчетФактураДата,
	|	ЕСТЬNULL(ХозрасчетныйОбороты.Субконто1.НомерВходящегоДокумента, """") КАК СчетФактураНомер,
	|	ЛОЖЬ КАК ЭтоСчетФактураПолученный // признак используется в отчете о наличии с/ф для специального форматирования в БП представления документа, если ЛОЖЬ, то общий порядок 
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(, , Период, Счет В ИЕРАРХИИ (&СчетУчетаНДС), &МассивСубконто, Организация в (&Организация), (НЕ КорСчет = &СчетНДС), ) КАК ХозрасчетныйОбороты
	|ГДЕ
	|	ХозрасчетныйОбороты.СуммаОборот > 0";

	Запрос.Текст =  Запрос.Текст + УсловиеЗапроса;

	Если ЗначениеЗаполнено(КонПериода) Тогда
		Если НЕ ЭтоОтчет Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Хозрасчетный.Обороты(, , Период", "Хозрасчетный.Остатки(&КонПериодаГраница");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, ", (НЕ КорСчет = &СчетНДС),", "");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ХозрасчетныйОбороты.СуммаОборот", "ХозрасчетныйОбороты.СуммаОстаток");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст,", Период","&КонПериода, Период");
		КонецЕсли;	
	КонецЕсли; 
	Запрос.Текст = Запрос.Текст 
		+ "
		  |УПОРЯДОЧИТЬ ПО
		  |	СчетФактураДата,
		  |	Документ";

	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();

	Возврат ТаблицаДокументов;

КонецФункции // ОпределитьНаличиеСчетовФактурПолученных()

// Функция возвращает процент НДС.
//
// Параметры:
//	СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - Значение ставки НДС.
//	ПрименяютсяСтавки4и2 - Булево - Признак применения ставок 4% и 2%.
//
// Возвращаемое значение:
//	Число - Процент НДС.
//
Функция ПолучитьСтавкуНДС(СтавкаНДС, ПрименяютсяСтавки4и2 = Ложь) Экспорт

	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС10 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
		Ставка = ?(ПрименяютсяСтавки4и2, 2, 10);
		Возврат Ставка;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
		Ставка = ?(ПрименяютсяСтавки4и2, 4, 18);
		Возврат Ставка;
	КонецЕсли;

	Возврат 0;

КонецФункции

// КОРРЕКТИРОВОЧНЫЕ И ИСПРАВИТЕЛЬНЫЕ СЧЕТА-ФАКТУРЫ
// Функция находит и возвращает документ, являющийся отправной точкой исправлений (либо ПТУ либо корректировку ПТУ)
// либо первоначальный документ ПТУ при передаче истины в параметр Исходный
Функция ПолучитьИсправляемыйДокументПоступления(ДокументПоступления,
		Исходный = Ложь, ОбработанныеДокументы = Неопределено) Экспорт
		
	//Если ЗначениеЗаполнено(ДокументПоступления) 
	//	И ТипЗнч(ДокументПоступления) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
	//	
	//	Если Исходный Тогда
	//		Возврат Документы.ВозвратТоваровПоставщику.СделкаПоДокументу(ДокументПоступления);
	//	Иначе
	//		Возврат ДокументПоступления;
	//	КонецЕсли; 
	//	
	//Иначе
	Если Не ЗначениеЗаполнено(ДокументПоступления) 
		Или ТипЗнч(ДокументПоступления) <> Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		
		Возврат ДокументПоступления;
	КонецЕсли;
	
	СогласованноеИзменение = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументПоступления,
		"ВидОперации,ДокументПоступления");

	// При согласованном изменении первоначальный документ возвращается только при установленом флаге Исходный.
	Если Не Исходный И РеквизитыДокумента.ВидОперации = СогласованноеИзменение Тогда
		Возврат ДокументПоступления;
	КонецЕсли;

	Если ОбработанныеДокументы = Неопределено Тогда
		ОбработанныеДокументы = Новый Массив;
	ИначеЕсли ОбработанныеДокументы.Найти(РеквизитыДокумента.ДокументПоступления) <> Неопределено Тогда
		Возврат ОбработанныеДокументы[0]; // Если обнаружена зацикленность, возвращаем первый документ в массиве.
	КонецЕсли;

	ОбработанныеДокументы.Добавить(ДокументПоступления); // Добавляем обработанный документ, для поиска зацикленности
		
	// Если документ не первоначальный, то вызываем рекурсию.
	Возврат ПолучитьИсправляемыйДокументПоступления(РеквизитыДокумента.ДокументПоступления,
			Исходный, ОбработанныеДокументы);
	
КонецФункции

// Функция находит и возвращает документ, являющийся отправной точкой исправлений (либо РТУ либо корректировку РТУ)
// либо первоначальный документ РТУ при передаче истины в параметр Исходный
Функция ПолучитьИсправляемыйДокументРеализации(ДокументРеализации,
		Исходный = Ложь, ОбработанныеДокументы = Неопределено) Экспорт

	//Если ЗначениеЗаполнено(ДокументРеализации) 
	//		И ДокументРеализации = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда 
	//		
	//		Если Исходный Тогда
	//			Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРеализации, "Сделка");
	//		Иначе
	//			Возврат ДокументРеализации;
	//		КонецЕсли; 
	//	
	//	Иначе
	Если НЕ ЗначениеЗаполнено(ДокументРеализации) 
		ИЛИ ТипЗнч(ДокументРеализации) <> Тип("ДокументСсылка.КорректировкаРеализации") Тогда 
		
		Возврат ДокументРеализации;
	КонецЕсли;

	СогласованноеИзменение = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРеализации,
		"ВидОперации,ДокументРеализации");

	// При согласованном изменении первоначальный документ возвращается только при установленом флаге Исходный.
	Если Не Исходный И РеквизитыДокумента.ВидОперации = СогласованноеИзменение Тогда
		Возврат ДокументРеализации;
	КонецЕсли;

	Если ОбработанныеДокументы = Неопределено Тогда
		ОбработанныеДокументы = Новый Массив;
	ИначеЕсли ОбработанныеДокументы.Найти(РеквизитыДокумента.ДокументРеализации) <> Неопределено Тогда
		Возврат ОбработанныеДокументы[0]; // Если обнаружена зацикленность, возвращаем первый документ в массиве.
	КонецЕсли;

	ОбработанныеДокументы.Добавить(ДокументРеализации); // Добавляем обработанный документ, для поиска зацикленности
		
	// Если документ не первоначальный, то вызываем рекурсию.
	Возврат ПолучитьИсправляемыйДокументРеализации(РеквизитыДокумента.ДокументРеализации,
			Исходный, ОбработанныеДокументы);
	
КонецФункции



// Функция возвращает массив пустых ссылок на документы, являющиеся типами для ИсправленногоСчетаФактуры.
//
// Возвращаемое значение:
//	Массив - Пустые ссылки типов измерения ИсправленныйСчетФактура.
//
Функция ПолучитьМассивПустыхИсправленныхСчетовФактур() Экспорт

	МассивДокументовИсправлений = Новый Массив;
	
	МассивТипов = Метаданные.РегистрыНакопления.НДСЗаписиКнигиПокупок.Измерения.ИсправленныйСчетФактура.Тип.Типы();
	Для Каждого ТипДокумента Из МассивТипов Цикл
		МетаданныеДокумента = Метаданные.НайтиПоТипу(ТипДокумента);
		Если МетаданныеДокумента <> Неопределено Тогда
			ИмяДокумента = МетаданныеДокумента.Имя;
			МассивДокументовИсправлений.Добавить(Документы[ИмяДокумента].ПустаяСсылка());
		КонецЕсли;
	КонецЦикла;
	
	МассивДокументовИсправлений.Добавить(Неопределено);

	Возврат МассивДокументовИсправлений;

КонецФункции // ПолучитьМассивПустыхИсправленныхСчетовФактур()

// Функция возвращает таблицу значений со ссылками на документы счета-фактуры, 
// которые записываются в субконто субсчетов 19 и в регистры НДС по таблице первичных 
// документов поступлений. Используется в отчете "ОтчетПоНаличиюСчетовФактур".
// 
// Параметры:
//	ТаблицаДокументов - ТаблицаЗначений - Содержит колонки:
//		* Документ - ДокументСсылка.* - Ссылка на первичный документ поступления.
//
// Возвращаемое значение:
//	ТаблицаЗначений - Таблица с колонкой "СчетФактура".
//
Функция ПреобразоватьДокументыВСчетаФактуры(ТаблицаДокументов) Экспорт

	// В БРУ нет специальных документов счетов-фактур, поэтому возвращаем исходную таблицу.
	ТаблицаРезультат = ТаблицаДокументов.Скопировать(, "Документ");
	ТаблицаРезультат.Колонки.Документ.Имя = "СчетФактура";
	
	Возврат ТаблицаРезультат;

КонецФункции // ПреобразоватьДокументыВСчетаФактуры()

//	ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает версию постановления Правительства РФ от 26.12.2011 г. № 1137.
//
// Параметры:
//  Период  -  Дата - В данном параметре передается
//             дата на которую необходимо определить версию постановления.
// Возвращаемое значение:
//  Число   -  версия постановления,
//              1 - исходная версия постановления Правительства РФ от 26.12.2011 г. № 1137;
//              2 - постановление Правительства РФ от 26.12.2011 г. № 1137 в редакции постановления № 952;
//              3 - постановление Правительства РФ от 26.12.2011 г. № 1137 в редакции постановления № 735;
//              4 - постановление Правительства РФ от 26.12.2011 г. № 1137 в редакции постановления № 981.
//              5 - постановление Правительства РФ от 26.12.2011 г. № 1137 в редакции постановления № 534
//
Функция ВерсияПостановленияНДС1137(Период) Экспорт
	
	Если Период >= '20210701' Тогда      // Постановление № 534 вступает в силу с 1 июля 2021 года.
		Возврат 5;
	ИначеЕсли Период >= '20171001' Тогда // Постановление № 981 вступает в силу с 1 октября 2017 года.
		Возврат 4;
	ИначеЕсли Период >= '20141001' Тогда // Постановление № 735 вступает в силу с 1 октября 2014 года.
		Возврат 3;
	ИначеЕсли Период >= '20131106' Тогда // Постановление № 952 вступает в силу с 6 ноября 2013 года.
		Возврат 2;
	Иначе 
		Возврат 1; // исходная версия Постановления Правительства РФ от 26.12.2011 г. № 1137.
	КонецЕсли;
	
КонецФункции

// Возвращает признак применения постановления Правительства от 19.01.2019 г. № 15
// в котором утверждена форма книги продаж с добавлением граф по 20%
// и отмена обязанность по выставлению покупателем счета-фактуры при возврате товаров, принятых на учет.
// Дата вступления в силу постановления 01.04.2019.
// Однако постановление можно применять с 1 января 2019 года,
// т.к. в соответствии с НК РФ ставка 20% применяется именно с этого момента.
Функция ПрименяетсяПостановление15(Период) Экспорт
	
	Возврат Период >= '20190101';
	
КонецФункции

// Функция возвращает признак автоматического заполнения раздела 7 Декларации по НДС.
//
// Параметры:
//	Период - Дата - Дата периода формирования декларации.
//
// Возвращаемое значение:
//	Булево - Истина, если заполнение раздела 7 декларации по НДС поддерживается.
//
Функция ЗаполняетсяРаздел7ДекларацииНДС(Период) Экспорт
	
	Возврат Истина;
	
КонецФункции

// Функция возвращает код вида операции для регистрации счета-фактуры по смешанным операциям в журнале счетов-фактур по комиссии.
// 
// Параметры:
// 	КодВидаОперации - Строка - Код вида операции счета-фактуры.
// 	Период - Дата - Период записи журнала.
// 
// Возвращаемое значение:
// 	КодВидаОперацииКомиссия - Строка - Код вида операции для журнала счетов-фактур по комиссии.
//
Функция КодВидаОперацииКомиссия(КодВидаОперации, Период) Экспорт
	
	КодВидаОперацииКомиссия = КодВидаОперации;
	
	ВерсияКодовВидовОпераций = УчетНДСКлиентСервер.ВерсияКодовВидовОпераций(Период);
	ВозможенСоставнойКод     = (ВерсияКодовВидовОпераций < 3);
			
	Если СтрДлина(КодВидаОперации) >= 4 
			И ВозможенСоставнойКод Тогда 
		Если СтрНайти(КодВидаОперации, "04") > 0 Тогда
			КодВидаОперацииКомиссия = "04";
		ИначеЕсли СтрНайти(КодВидаОперации, "05") > 0 Тогда	
			КодВидаОперацииКомиссия  = "05"
		ИначеЕсли СтрНайти(КодВидаОперации, "13") > 0 Тогда	
			КодВидаОперацииКомиссия  = "13"
		КонецЕсли;
	КонецЕсли;
	
	Возврат КодВидаОперацииКомиссия;
	
КонецФункции

// Функция возвращает типы документов, являющихся ручными операциями по НДС.
//
// Возвращаемое значение:
//	Массив - Массив со значениями типов документов.
//
Функция ТипыДокументовРучныхОперацийНДС() Экспорт

	Результат = Новый Массив;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область ФункцииПолученияТекстовЗапросов

////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ПОЛУЧЕНИЯ ТЕКСТОВ ЗАПРОСОВ

// Функция возвращает текст запроса, выбирающего корректировочные счета-фактуры. 
// Используется в отчете "Журнал учета счетов-фактур 1137".
//
// Параметры:
//	Запрос - Запрос - Объект Запрос, с помощью которого будет выполнен текст запроса.
//	Период - Дата - Последняя дата периода, за который строится запрос.
//	Отбор  - Структура - Структура отбора, содержащая следующие ключи:
//		* СписокОрганизаций - СписокЗначений - Список организаций, по которым строится запрос.
//		* Контрагент - Структура - Настройки отбора по контрагенту (необязательный ключ)
//			** ВидСравнения - ВидСравнения - Вид сравнения
//			** Значение - СправочникСсылка.Контрагенты - Ссылка на контрагента для отбора.
//
// Возвращаемое значение:
//	Строка - Текст запроса, формирующего таблицу со следующими полями:
//		* СчетФактура - ДокументСсылка.* - Ссылка на документ счета-фактуры.
//		* Организация - СправочникСсылка.Организации - Организация из счета-фактуры.
//
Функция ТекстЗапросаКорректировочныеСчетаФактуры(Запрос, Период, Отбор) Экспорт

	// В БРУ нет документов счетов-фактур.
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Документ.ДокументРасчетовСКонтрагентом.ПустаяСсылка) КАК СчетФактура,
	               |	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
	               |	ЗНАЧЕНИЕ(Перечисление.ЧастиЖурналаУчетаСчетовФактур.ВыставленныеСчетаФактуры) КАК ЧастьЖурналаУчетаСчетовФактур
	               |ГДЕ
	               |	ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Документ.ДокументРасчетовСКонтрагентом.ПустаяСсылка),
	               |	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка),
	               |	ЗНАЧЕНИЕ(Перечисление.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры)
	               |ГДЕ
	               |	ЛОЖЬ";

	Возврат ТекстЗапроса;

КонецФункции // ТекстЗапросаКорректировочныеСчетаФактуры()

// Функция возвращает текст запроса со списком документов счетов-фактур полученных,
// в которых сама организация выступает в роли поставщика в книге покупок.
//
// Возвращаемое значение:
//	Строка - Текст запроса, формирующего таблицу со следующими полями:
//		* СчетФактура - ДокументСсылка.* - Ссылка на документ счета-фактуры.
//		* Организация - СправочникСсылка.Организации - Организация из счета-фактуры.
//		* ГоловнаяОрганизация - СправочникСсылка.Организации - Головная организация.
//		* ЭтоКорректировкаРеализации 	- Булево - Истина, если счет-фактура относится к корректировке реализации.
//
Функция ТекстЗапросаСчетаФактурыПолученныеГдеОрганизацияЯвляетсяПоставщиком() Экспорт

	// В БРУ таких документов нет.

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Документ.ДокументРасчетовСКонтрагентом.ПустаяСсылка) КАК СчетФактура,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК ГоловнаяОрганизация,
	|	ЛОЖЬ КАК ЭтоКорректировкаРеализации
	|ГДЕ
	|	ЛОЖЬ
	|";

	Возврат ТекстЗапроса;

КонецФункции // ТекстЗапросаСчетаФактурыПолученныеГдеОрганизацияЯвляетсяПоставщиком()

// Функция возвращает текст запроса со списком документов счетов-фактур выданных,
// в которых сама организация выступает в роли покупателя в книге продаж.
//
// Возвращаемое значение:
//	Строка - Текст запроса.
//
Функция ТекстЗапросаСчетаФактурыВыданныеГдеОрганизацияЯвляетсяПокупателем() Экспорт

	// В БРУ таких документов нет.

	ТекстЗапроса = "ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Документ.ДокументРасчетовСКонтрагентом.ПустаяСсылка) КАК СчетФактура,
	               |	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
	               |	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК ГоловнаяОрганизация,
	               |	ЛОЖЬ КАК ЭтоКорректировкаПоступления
	               |ГДЕ
	               |	ЛОЖЬ";

	Возврат ТекстЗапроса;

КонецФункции // ТекстЗапросаСчетаФактурыВыданныеГдеОрганизацияЯвляетсяПокупателем()

// Функция возвращает текст запроса со списком документов счетов-фактур из 
// книги покупок, которые могут являться регистраторами исправительных записей.
//
// Возвращаемое значение:
//	Строка - Текст запроса, формирующего таблицу со следующими полями:
//		* СчетФактура - ДокументСсылка.* - Ссылка на документ счета-фактуры.
//		* Организация - СправочникСсылка.Организации - Организация из счета-фактуры.
//		* ГоловнаяОрганизация - СправочникСсылка.Организации - Головная организация.
//		* ЭтоКорректировкаПоступления 	- Булево - Истина, если счет-фактура относится к корректировке поступления.
//		* ЭтоКорректировкаРеализации 	- Булево - Истина, если счет-фактура относится к корректировке реализации.
//
Функция ТекстЗапросаСчетаФактурыИсправленияКнигиПокупок() Экспорт

	// В БРУ таких документов нет.
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Документ.ДокументРасчетовСКонтрагентом.ПустаяСсылка) КАК СчетФактура,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК ГоловнаяОрганизация,
	|	ЛОЖЬ КАК ЭтоКорректировкаПоступления,
	|	ЛОЖЬ КАК ЭтоКорректировкаРеализации
	|ГДЕ
	|	ЛОЖЬ
	|";
	
	Возврат ТекстЗапроса;

КонецФункции // ТекстЗапросаСчетаФактурыИсправленияКнигиПокупок()

// Функция возвращает текст запроса со списком документов счетов-фактур из 
// книги продаж, которые могут являться регистраторами исправительных записей.
//
// Возвращаемое значение:
//	Строка - Текст запроса, формирующего таблицу со следующими полями:
//		* СчетФактура - ДокументСсылка.* - Ссылка на документ счета-фактуры.
//		* Организация - СправочникСсылка.Организации - Организация из счета-фактуры.
//		* ГоловнаяОрганизация - СправочникСсылка.Организации - Головная организация.
//		* ЭтоКорректировкаПоступления 	- Булево - Истина, если счет-фактура относится к корректировке поступления.
//		* ЭтоКорректировкаРеализации 	- Булево - Истина, если счет-фактура относится к корректировке реализации.
//
Функция ТекстЗапросаСчетаФактурыИсправленияКнигиПродаж() Экспорт

	// В БРУ таких документов нет.
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Документ.ДокументРасчетовСКонтрагентом.ПустаяСсылка) КАК СчетФактура,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК ГоловнаяОрганизация,
	|	ЛОЖЬ КАК ЭтоКорректировкаПоступления,
	|	ЛОЖЬ КАК ЭтоКорректировкаРеализации
	|ГДЕ
	|	ЛОЖЬ
	|";
	
	Возврат ТекстЗапроса;

КонецФункции // ТекстЗапросаСчетаФактурыИсправленияКнигиПродаж()

// Функция возвращает запрос для получения информации о ГТД и стране происхождения
// для счетов фактур.
//
// Параметры:
//	Запрос - Запрос - Объект запрос, с помощью которого будет выполняться обращение к базе данных.
//
// Возвращаемое значение:
//	Строка - Текст запроса для получения таблица со следующими полями:
//		* СчетФактура - ДокументСсылка.* - Ссылка на документ, представляющий счет-фактуру.
//		* СтранаПроисхождения - СправочникСсылка.СтраныМира - Страна происхождения товара.
//		* НомерГТД - СправочникСсылка.НомераГТД - Таможенная декларация, указанная в счете-фактуре.
//
Функция ТекстЗапросаНомераГТДпоСчетамФактурам(Запрос) Экспорт

	// В БРУ таких документов нет.

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Документ.ДокументРасчетовСКонтрагентом.ПустаяСсылка) КАК СчетФактура,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка) КАК НомерГТД
	|ГДЕ
	|	ЛОЖЬ
	|";

	Возврат ТекстЗапроса;

КонецФункции

// Функция возвращает текст запроса, выбирающего сводные комиссионные счета-фактуры. 
// Используется в отчете "Журнал учета счетов-фактур 1137".
//
// Параметры:
//	Запрос - Запрос - Объект запрос, с помощью которого будет выполняться обращение к базе данных.
//	Период - ДатаВремя - Конец периода формирования отчета.
//	Отбор - Структура - Структура отбора с ключами:
//		* СписокОрганизаций - СписокЗначений - список организаций, по которым строится отчет.
//		* Контрагент (необязательный) - Структура с ключами:
//			** ВидСравнения - ВидСравнения.
//			** Значение - СправочникСсылка.Контрагенты - Ссылка на контрагента.
//
// Возвращаемое значение:
//	Строка - Текст запроса для получения таблица со следующими полями:
//		* СчетФактура - ДокументСсылка.* - Ссылка на документ, представляющий счет-фактуру.
//		* Организация - СправочникСсылка.Организации - Организация, к которой относится счет-фактура.
//		* ЧастьЖурналаУчетаСчетовФактур - ПеречислениеСсылка.ЧастиЖурналаУчетаСчетовФактур.
//
//
Функция ТекстЗапросаСводныеКомиссионныеСчетаФактуры(Запрос, Период, Отбор) Экспорт

	// В БРУ нет документов счетов-фактур.
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Документ.ДокументРасчетовСКонтрагентом.ПустаяСсылка) КАК СчетФактура,
	               |	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
	               |	ЗНАЧЕНИЕ(Перечисление.ЧастиЖурналаУчетаСчетовФактур.ВыставленныеСчетаФактуры) КАК ЧастьЖурналаУчетаСчетовФактур
	               |ГДЕ
	               |	ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Документ.ДокументРасчетовСКонтрагентом.ПустаяСсылка),
	               |	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка),
	               |	ЗНАЧЕНИЕ(Перечисление.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры)
	               |ГДЕ
	               |	ЛОЖЬ";

	Возврат ТекстЗапроса;

КонецФункции // ТекстЗапросаКорректировочныеСчетаФактуры()

// Функция возвращает текст запроса для получения раздела 12 Декларации по НДС с 2015 г.
// "Сведения из счетов-фактур, выставленных лицами, указанными в п.5 ст.173 НК РФ".
//
// Параметры:
//	Запрос - Запрос - Объект запрос, с помощью которого будет выполняться обращение к базе данных.
//	СписокОрганизаций - СписокЗначений - Список ссылок на организации, по которым строится отчет. 
//	НачалоПериода - ДатаВремя - Начало периода формирования отчета. 
//	КонецПериода - ДатаВремя - Конец периода формирования отчета. 
//
// Возвращаемое значение:
//	Строка - Текст запроса для получения таблица со следующими полями:
//		* Номер - Строка - Номер документа счета-фактуры.
//		* Дата - ДатаВремя - Дата документа счета-фактуры.
//		* Контрагент - СправочникСсылка.Контрагенты - Контрагент из счета-фактуры.
//		* КППКонтрагента - Строка - КПП контрагента из счета-фактуры.
//		* СуммаНДСДокумента - Число - Сумма НДС по счету-фактуре.
//		* СуммаДокумента - Число - Общая сумма с НДС по счету-фактуре.
//		* ВалютаДокумента - СправочникСсылка.Валюты - Валюта счета-фактуры.
//		* Ссылка - ДокументСсылка.* - Ссылка на документ счет-фактура.
//
Функция ТекстЗапросаСчетаФактурыВыставленныеНеплательщикамиНДС(Запрос, СписокОрганизаций, НачалоПериода, КонецПериода) Экспорт

	// В БРУ таких документов нет.
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	"""" КАК Номер,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК Дата,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
	|	"""" КАК КППКонтрагента,
	|	0 КАК СуммаНДСДокумента,
	|	0 КАК СуммаНДСДокументаКомиссия,
	|	0 КАК СуммаДокумента,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) ВалютаДокумента,
	|	ЗНАЧЕНИЕ(Документ.ДокументРасчетовСКонтрагентом.ПустаяСсылка) КАК Ссылка
	|ГДЕ
	|	ЛОЖЬ
	|";
	
	Возврат ТекстЗапроса;

КонецФункции

// Функция возвращает текст запроса для сопоставления счетов-фактур, выписанных при неподтверждении 0%,
// с исходными документами отгрузки, которые не были подтверждены.
// В текст запроса можно использовать параметры запроса:
//	* Организация - Список организаций, по которым строится декларация НДС.
//	* НачалоПериода - Дата - Дата начала периода декларации НДС.
//	* КонецПериода - Дата - Дата окончания периода декларации НДС.
//
// Возвращаемое значение:
//	Строка - Текст запроса, возвращающего таблицу с колонками:
//		* СчетФактура - ДокументСсылка.* - Ссылка на счет-фактуру, выписанную при неподтверждении 0%.
//		* ДокументОтгрузки - ДокументСсылка.* - Ссылка на документ реализации по 0%, который не был подтвержден.
//
Функция ТекстЗапросаНеподтвержденныеРеализации0() Экспорт

	// В БРУ таких данных нет.

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Документ.ДокументРасчетовСКонтрагентом.ПустаяСсылка) КАК СчетФактура,
	|	ЗНАЧЕНИЕ(Документ.ДокументРасчетовСКонтрагентом.ПустаяСсылка) КАК ДокументОтгрузки
	|ГДЕ
	|	ЛОЖЬ";
	
	Возврат ТекстЗапроса;

КонецФункции

// Возвращает текст запроса для получения данных о кодах ТНВЭД для счетов-фактур при отгрузках в ЕАЭС.
//
// Возвращаемое значение:
//	Строка - Текст запроса.
//
Функция ТекстЗапросаИнформацияПоТНВЭД() Экспорт
	
	// В БРУ нет таких данных.

	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(Документ.ДокументРасчетовСКонтрагентом.ПустаяСсылка) КАК СчетФактура,
	|	"""" КАК КодТНВЭД,
	|	1 КАК КоличествоЭлементов
	|ГДЕ
	|	ЛОЖЬ
	|ИТОГИ
	|	СУММА(КоличествоЭлементов)
	|ПО
	|	СчетФактура";

КонецФункции

#КонецОбласти

#Область ФормированиеОтчетовПоНдс

// Функция возвращает ИСТИНА, если из отчетов НДС необходимо открывать помощник.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - Организация, по которой строится отчет.
//	Период - Дата - Налоговый период, за который строится отчет.
//
// Возвращаемое значение:
//	Булево - Истина, если поддерживается работа с помощником учета НДС.
//
Функция ОткрыватьПомощникИзМакета(Организация, Период) Экспорт

    Возврат Ложь;
	
КонецФункции

// Функция возвращает макет для помощника по НДС.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - Организация по которой строится отчет.
//	Период - Дата - Дата налогового периода, за который строится отчет.
//
// Возвращаемое значение:
//	ТабличныйДокумент - Табличный документ с макетом.
//
Функция ПолучитьМакетОткрытияПомощника(Организация, Период) Экспорт

	// В БРУ нет помощника по учету НДС
	ТабДокумент = Новый ТабличныйДокумент;

	Возврат ТабДокумент;

КонецФункции

Функция ПолучитьДатуНачалаДействияПостановления1137() Экспорт
	
	Возврат УчетНДСУНФ.ПолучитьДатуНачалаДействияПостановления1137();
	
КонецФункции	

#КонецОбласти

#Область РаботаСКнигамиПокупокИПродаж

// Формирует книгу покупок внутри фонового задания.
//
// Параметры:
//	ПараметрыОтчета - Структура - Структура параметров фонового задания,
//						см. ПодготовитьПараметрыОтчета() в отчете книга покупок.
//	АдресХранилища - Строка - Адрес временного хранилища, в которое поместить результат отчета.
//
Процедура ПодготовитьПараметрыКнигиПокупок(ПараметрыОтчета, АдресХранилища) Экспорт
	
	Отчеты.КнигаПокупок.СформироватьОтчет(ПараметрыОтчета, АдресХранилища);	
	
КонецПроцедуры

// Формирует книгу продаж внутри фонового задания.
//
// Параметры:
//	ПараметрыОтчета - Структура - Структура параметров фонового задания, 
//						см. ПодготовитьПараметрыОтчета() в отчете книга продаж.
//	АдресХранилища - Строка - Адрес временного хранилища, в которое поместить результат отчета.
//
Процедура ПодготовитьПараметрыКнигиПродаж(ПараметрыОтчета, АдресХранилища) Экспорт
	
	Отчеты.КнигаПродаж.СформироватьОтчет(ПараметрыОтчета, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСЖурналомУчетаСчетовФактур

// Формирует журнал учета счетов-фактур внутри фонового задания.
//
// Параметры:
//	ПараметрыОтчета - Структура - Структура параметров фонового задания, 
//						см. ПодготовитьПараметрыОтчета() в журнале учета счетов-фактур.
//	АдресХранилища - Строка - Адрес временного хранилища, в которое поместить результат отчета.
//
Процедура ПодготовитьПараметрыЖурналаУчетаСчетовФактур (ПараметрыОтчета, АдресХранилища) Экспорт
	
	Отчеты.ЖурналУчетаСчетовФактур.СформироватьОтчет(ПараметрыОтчета, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти

#Область СведенияОЮридическихИФизическихЛицах

// Процедура подготавливает в менеджере временных таблиц таблицу
// сведениями о переданных контрагента и организациях на указанные даты.
//
// Параметры:
//	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер, в который помещается таблицы.
//		На входе содержит таблицу СсылкиНаДаты с колонками:
//			* Ссылка - СправочникСсылка.Контрагенты, СправочникСсылка.Организации - контрагент или организация,
//						для которых требуется получить сведения.
//			* ДатаСведений - Дата - Дата, на которую необходимо получить данные.
//
//		На выходе содержит таблицу СведенияОСсылкахНаДаты с колонками:
//			* Ссылка - СправочникСсылка.Контрагенты, СправочникСсылка.Организации - контрагент или организация.
//			* ДатаСведений - Дата - Дата, на которую получены данные.
//			* Наименование - Строка - Наименование контрагента или организации для вывода в отчете.
//			* ИНН - Строка - ИНН контрагента или организации.
//			* КПП - Строка - КПП контрагента или организации.
//
Процедура РегистрационныеСведенияНаДаты(МенеджерВременныхТаблиц) Экспорт
	
	// Запрос требует обязательного наличия в МенеджерВременныхТаблиц таблицы с именем:
	// СсылкиНаДаты с колонками Ссылка, ДатаСведений.
	// Результатом является временная таблица СведенияОСсылкахНаДаты.
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СсылкиНаДаты.Ссылка КАК Ссылка,
	|	СсылкиНаДаты.ДатаСведений КАК ДатаСведений,
	|	МАКСИМУМ(ИсторияКППКонтрагентов.Период) КАК Период
	|ПОМЕСТИТЬ ДатыСведенийОКонтрагентах
	|ИЗ
	|	СсылкиНаДаты КАК СсылкиНаДаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ИсторияКПП КАК ИсторияКППКонтрагентов
	|		ПО СсылкиНаДаты.Ссылка = ИсторияКППКонтрагентов.Ссылка
	|			И СсылкиНаДаты.ДатаСведений >= ИсторияКППКонтрагентов.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	СсылкиНаДаты.Ссылка,
	|	СсылкиНаДаты.ДатаСведений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыСведенийОКонтрагентах.Ссылка КАК Ссылка,
	|	ДатыСведенийОКонтрагентах.ДатаСведений КАК ДатаСведений,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(Контрагенты.НаименованиеПолное, 1, 250) = """"
	|			ТОГДА Контрагенты.Наименование
	|		ИНАЧЕ Контрагенты.НаименованиеПолное
	|	КОНЕЦ КАК Наименование,
	|	Контрагенты.ИНН КАК ИНН,
	|	ЕСТЬNULL(ИсторияКППКонтрагентов.КПП, Контрагенты.КПП) КАК КПП
	|ПОМЕСТИТЬ СведенияОКонтрагентахНаДаты
	|ИЗ
	|	ДатыСведенийОКонтрагентах КАК ДатыСведенийОКонтрагентах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДатыСведенийОКонтрагентах.Ссылка = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК ГоловныеКонтрагенты
	|		ПО (Контрагенты.ГоловнойКонтрагент = ГоловныеКонтрагенты.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ИсторияКПП КАК ИсторияКППКонтрагентов
	|		ПО ДатыСведенийОКонтрагентах.Ссылка = ИсторияКППКонтрагентов.Ссылка
	|			И ДатыСведенийОКонтрагентах.Период = ИсторияКППКонтрагентов.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	ДатаСведений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДатыСведенийОКонтрагентах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СсылкиНаДаты.Ссылка КАК Ссылка,
	|	СсылкиНаДаты.ДатаСведений КАК ДатаСведений,
	|	МАКСИМУМ(ИсторияРегистрацийВНалоговомОргане.Период) КАК Период
	|ПОМЕСТИТЬ ДатыСведенийОбОрганизациях
	|ИЗ
	|	СсылкиНаДаты КАК СсылкиНаДаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОргане
	|		ПО СсылкиНаДаты.Ссылка = ИсторияРегистрацийВНалоговомОргане.СтруктурнаяЕдиница
	|			И СсылкиНаДаты.ДатаСведений >= ИсторияРегистрацийВНалоговомОргане.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	СсылкиНаДаты.Ссылка,
	|	СсылкиНаДаты.ДатаСведений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыСведенийОбОрганизациях.Ссылка КАК Ссылка,
	|	ДатыСведенийОбОрганизациях.ДатаСведений КАК ДатаСведений,
	|	ВЫБОР
	|		КОГДА Организации.ОбособленноеПодразделение
	|			ТОГДА Организации.ГоловнаяОрганизация.НаименованиеПолное
	|		ИНАЧЕ Организации.НаименованиеПолное
	|	КОНЕЦ КАК Наименование,
	|	Организации.ИНН КАК ИНН,
	|	ЕСТЬNULL(ИсторияРегистрацийВНалоговомОргане.РегистрацияВНалоговомОргане.КПП, Организации.КПП) КАК КПП
	|ПОМЕСТИТЬ СведенияОбОрганизацияхНаДаты
	|ИЗ
	|	ДатыСведенийОбОрганизациях КАК ДатыСведенийОбОрганизациях
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ДатыСведенийОбОрганизациях.Ссылка = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОргане
	|		ПО ДатыСведенийОбОрганизациях.Ссылка = ИсторияРегистрацийВНалоговомОргане.СтруктурнаяЕдиница
	|			И ДатыСведенийОбОрганизациях.Период = ИсторияРегистрацийВНалоговомОргане.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	ДатаСведений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДатыСведенийОбОрганизациях
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СсылкиНаДаты.Ссылка КАК Ссылка,
	|	СсылкиНаДаты.ДатаСведений КАК ДатаСведений,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(СведенияОКонтрагентахНаДаты.Наименование, СведенияОбОрганизацияхНаДаты.Наименование) КАК СТРОКА(1000)) КАК Наименование,
	|	ЕСТЬNULL(СведенияОКонтрагентахНаДаты.ИНН, СведенияОбОрганизацияхНаДаты.ИНН) КАК ИНН,
	|	ЕСТЬNULL(СведенияОКонтрагентахНаДаты.КПП, СведенияОбОрганизацияхНаДаты.КПП) КАК КПП
	|ПОМЕСТИТЬ СведенияОСсылкахНаДаты
	|ИЗ
	|	СсылкиНаДаты КАК СсылкиНаДаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияОКонтрагентахНаДаты КАК СведенияОКонтрагентахНаДаты
	|		ПО СсылкиНаДаты.Ссылка = СведенияОКонтрагентахНаДаты.Ссылка
	|			И СсылкиНаДаты.ДатаСведений = СведенияОКонтрагентахНаДаты.ДатаСведений
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияОбОрганизацияхНаДаты КАК СведенияОбОрганизацияхНаДаты
	|		ПО СсылкиНаДаты.Ссылка = СведенияОбОрганизацияхНаДаты.Ссылка
	|			И СсылкиНаДаты.ДатаСведений = СведенияОбОрганизацияхНаДаты.ДатаСведений
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	ДатаСведений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СведенияОКонтрагентахНаДаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СведенияОбОрганизацияхНаДаты";

	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти 

#Область Прочее

// Получает пакет электронных представлений документов.
//
// Параметры:
//  ВыгружаемыеДокументы - Массив - перечень документов для которых
//                 необходимо получить электронные представления в виде двоичных данных.
//  УникальныйИдентификатор - УникальныйИдентификатор - уникальный идентификатор по которому
//                 осуществляется привязка двоичных данных во временном хранилище.
//
// Возвращаемое значение:
//   Соответствие - соответствие переданных ссылок на документы и массива структур с полями:
//                 ТипФайла - Строка - описание типа файла;
//                 ИмяФайла - Строка - имя файла с расширением;
//                 АдресВременногоХранилища - Строка - адрес временного хранилища, в котором размещены двоичные данные файла.
//
Функция СформироватьЭлектронныеДокументы(ВыгружаемыеДокументы, УникальныйИдентификатор = Неопределено) Экспорт
	
	Если УникальныйИдентификатор = Неопределено Тогда
		УникальныйИдентификатор = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Результат = Новый Соответствие;
	
	Для Каждого ВыгружаемыйДокумент Из ВыгружаемыеДокументы Цикл
		
		ЭтоДокументРегистраУчетаНДС = (ВыгружаемыйДокумент.Метаданные().Имя = "КнигаПокупокДляПередачиВЭлектронномВиде"
		                           ИЛИ ВыгружаемыйДокумент.Метаданные().Имя = "КнигаПродажДляПередачиВЭлектронномВиде"
		                           ИЛИ ВыгружаемыйДокумент.Метаданные().Имя = "ДопЛистКнигиПокупокДляПередачиВЭлектронномВиде"
		                           ИЛИ ВыгружаемыйДокумент.Метаданные().Имя = "ДопЛистКнигиПродажДляПередачиВЭлектронномВиде"
		                           ИЛИ ВыгружаемыйДокумент.Метаданные().Имя = "ЖурналУчетаСчетовФактурДляПередачиВЭлектронномВиде");
		Если ЭтоДокументРегистраУчетаНДС Тогда
			ОбъектВыгрузки = ВыгружаемыйДокумент.ПолучитьОбъект();
			ФайлыВыгрузки = ОбъектВыгрузки.ВыгрузитьДокумент(УникальныйИдентификатор);
			
			МассивВыгрузки = Новый Массив;
			Для Каждого ФайлВыгрузки Из ФайлыВыгрузки Цикл
				
				ЭлементВыгрузки = Новый Структура;
				ЭлементВыгрузки.Вставить("ТипФайла", "ФайлВыгрузки");
				ЭлементВыгрузки.Вставить("ИмяФайла", ФайлВыгрузки.ИмяФайлаВыгрузки);
				ЭлементВыгрузки.Вставить("АдресВременногоХранилища", ФайлВыгрузки.АдресФайлаВыгрузки);
				
				МассивВыгрузки.Добавить(ЭлементВыгрузки);
			КонецЦикла;
			
			Результат.Вставить(ВыгружаемыйДокумент, МассивВыгрузки);
			
		Иначе
			Результат.Вставить(ВыгружаемыйДокумент, Неопределено);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Заполняет список доступных ставок НДС.
//
// Параметры:
//	СписокВыбора - СписокЗначений - Список, который необходимо заполнить.
//	НДСпоСтавкам4и2 - Булево - Истина, если контрагент предъявляет НДС по ставкам 4 и 2%.
//	БезДробных - Булево - Истина, если не требуется включать расчетные ставки.
//
Процедура ЗаполнитьСписокВыбораСтавокНДС(СписокВыбора, НДСпоСтавкам4и2, БезДробных = Ложь) Экспорт
	
	СписокВыбора.Очистить();
	СписокВыбора.Добавить(Перечисления.СтавкиНДС.НДС18,	 ?(НДСпоСтавкам4и2, НСтр("ru = '4%'"), НСтр("ru = '18%'")));
	СписокВыбора.Добавить(Перечисления.СтавкиНДС.НДС10,	 ?(НДСпоСтавкам4и2, НСтр("ru = '2%'"), НСтр("ru = '10%'")));
	СписокВыбора.Добавить(Перечисления.СтавкиНДС.НДС0,	 НСтр("ru = '0%'"));
	СписокВыбора.Добавить(Перечисления.СтавкиНДС.БезНДС, НСтр("ru = 'Без НДС'"));
	Если Не БезДробных Тогда
		СписокВыбора.Вставить(1, Перечисления.СтавкиНДС.НДС18_118, ?(НДСпоСтавкам4и2, НСтр("ru = '4/104'"), НСтр("ru = '18/118'")));
		СписокВыбора.Вставить(3, Перечисления.СтавкиНДС.НДС10_110, ?(НДСпоСтавкам4и2, НСтр("ru = '2/102'"), НСтр("ru = '10/110'")));
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает условное оформление для элемента формы со ставкой НДС.
//
// Параметры:
//	УсловноеОформление - УсловноеОформлениеКомпоновкиДанных - Условное оформление формы.
//	СтавкаНДС - ПолеФормы - Поле формы, для которого установить условное оформление.
//
Процедура УстановитьУсловноеОформлениеДляНДСпоСтавкам4и2(УсловноеОформление, СтавкаНДС) Экспорт
	
	СтавкиНДС = Новый Соответствие;
	СтавкиНДС.Вставить(Перечисления.СтавкиНДС.НДС18,		НСтр("ru = '4%'"));
	СтавкиНДС.Вставить(Перечисления.СтавкиНДС.НДС18_118,	НСтр("ru = '4/104'"));
	СтавкиНДС.Вставить(Перечисления.СтавкиНДС.НДС10,		НСтр("ru = '2%'"));
	СтавкиНДС.Вставить(Перечисления.СтавкиНДС.НДС10_110,	НСтр("ru = '2/102'"));
	
	Для Каждого ЗнСтавки Из СтавкиНДС Цикл
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(СтавкаНДС.Имя);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтавкаНДС.ПутьКДанным);
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = ЗнСтавки.Ключ;
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НДСпоСтавкам4и2");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст", ЗнСтавки.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

//++ НЕ УТ

#Область ДекларацияНДС

// Дополняется сведения о показателях декларации НДС для заполнения раздела 7.
//
// Параметры:
//	ПоказателиОтчета - Структура - Содержит данные заполняемого отчета БРО.
//
Процедура ДополнитьСведенияОПоказателяхОтчетаНДСФормаОтчета2017Кв1Раздел7(ПоказателиОтчета) Экспорт

	// В УП дополнительно поддерживается заполнение полей декларации, связанных с особенностями принятия к вычету НДС 
	// при длительном цикле производства.	
	
КонецПроцедуры

// Вызывается при заполнении раздела 7 декларации по НДС, позволяет заполнить дополнительные показатели.
//
// Параметры:
//	ПараметрыЗапросов - Структура - Содержит параметры запроса для заполнения декларации НДС.
//										см. УчетНДСФормированиеОтчетности.ЗаполнитьДекларациюНДС().
//	Контейнер - Структура - Содержит данные заполняемого отчета БРО.
//
Процедура ЗаполнитьОтчетНДСФормаОтчета2017Кв1Раздел7(ПараметрыЗапросов, Контейнер) Экспорт

	// В УП дополнительно поддерживается заполнение полей декларации, связанных с особенностями принятия к вычету НДС 
	// при длительном цикле производства.	

КонецПроцедуры

// Возвращает Имя регистра местонахождения ос
//
Функция ИмяРегистраМестоНахожденияОС() Экспорт
	
	Возврат "МестонахождениеОСБухгалтерскийУчет";
	
КонецФункции

#КонецОбласти

// Вызывается после записи документа ФормированиеЗаписейРаздела7ДекларацииНДС
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма документа.
//	ТекущийОбъект - ДокументСсылка -  Записываемый объект
//	ПараметрыЗаписи - Структура - Содержит параметры записи
//
Процедура ПослеЗаписиНаСервереДокументаНДС(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	
КонецПроцедуры

// Вызывается при создании документа ФормированиеЗаписейРаздела7ДекларацииНДС
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма документа.
//	Отказ - Булево - Признак отказа 
//	СтандартнаяОбработка - Булево - Признак стандартной обработки
//
Процедура ПриСозданииНаСервереДокументаНДС(Форма, Отказ, СтандартнаяОбработка) Экспорт
		
КонецПроцедуры

// Вызывается при чтении документа ФормированиеЗаписейРаздела7ДекларацииНДС
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма документа.
//	ТекущийОбъект - ДокументСсылка -  Записываемый объект
//
Процедура ПриЧтенииНаСервереДокументаНДС(Форма, ТекущийОбъект) Экспорт
	
	
КонецПроцедуры


// Возвращает реквизиты организации 
//
// Параметры:
// Организация - СправочникСсылка.Организации - Справочник Организации
//
// Возвращаемое значение:
//    - Структура 
//            - ИностраннаяОрганизация - Булево
//            - КПП - Строка
//
Функция РеквизитыОрганизацииДляОтчетностиПоНДС(Организация) Экспорт
	
	ПараметрыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Организация, "ИностраннаяОрганизация,КПП");
		
	Возврат Новый Структура("ИностраннаяОрганизация,КПП", 
		ПараметрыОрганизации.ИностраннаяОрганизация, ПараметрыОрганизации.КПП);
	
КонецФункции

#Область РегламентированнаяОтчетность

Процедура ТекстЗапросаРеестрНДСПриложение(Запрос, ПараметрыОтчета, ЭтоПриложение5) Экспорт
	
	//УчетНДСБП.ТекстЗапросаРеестрНДСПриложение(Запрос, ПараметрыОтчета, ЭтоПриложение5);
	
КонецПроцедуры

Функция ТекстЗапросаРаздел4(ПараметрыОтчета) Экспорт
	
	//Возврат УчетНДСУНФ.ТекстЗапросаРаздел4(ПараметрыОтчета);
	
КонецФункции

Функция ТекстЗапросаРаздел5(ПараметрыОтчета) Экспорт
	
	Возврат "";
//	Возврат УчетНДСБП.ТекстЗапросаРаздел5(ПараметрыОтчета);
	
КонецФункции

Функция ТекстЗапросаРаздел6(ПараметрыОтчета) Экспорт
	
	Возврат "";
//	Возврат УчетНДСБП.ТекстЗапросаРаздел6(ПараметрыОтчета);
	
КонецФункции

Функция ТекстЗапросаНаборДанныхНачислениеРеализация0(Запрос) Экспорт
	
	Возврат "";
//	Возврат УчетНДСБП.ТекстЗапросаНаборДанныхНачислениеРеализация0(Запрос);
	
КонецФункции

Функция ТекстЗапросаНаборДанныхВычетПоПриобретеннымЦенностям0(Запрос) Экспорт
	
	Возврат "";
//	Возврат УчетНДСБП.ТекстЗапросаНаборДанныхВычетПоПриобретеннымЦенностям0(Запрос);
	
КонецФункции

#КонецОбласти

//-- НЕ УТ

#КонецОбласти  

#Область СлужебныйПрограммныйИнтерфейс

// Обработчик подписки на событие ПриЗаписиДокументаРегистрацияДанныхПервичныхДокументовИП.
//
Процедура ПриЗаписиДокументаРегистрацияДанныхПервичныхДокументов(Источник, Отказ) Экспорт
	
	Перем НомерДокумента, ДатаДокумента;
	
	Если Источник.ОбменДанными.Загрузка = Истина
		И Источник.ДополнительныеСвойства.Свойство("РегистрироватьДанныеПервичныхДокументов")
		И Источник.ДополнительныеСвойства.РегистрироватьДанныеПервичныхДокументов = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	// При групповом перепроведении реквизиты документов не меняются,
	// поэтому обновление связанных данных выполнять не требуется.
	Если Источник.ДополнительныеСвойства.Свойство("ГрупповоеПерепроведение") И Источник.ДополнительныеСвойства.ГрупповоеПерепроведение Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьДанныеПервичныхДокументов(Источник);
	
КонецПроцедуры

Процедура ЗаписатьДанныеПервичныхДокументов(Источник, НомерСчетаФактуры = "") Экспорт
	
	Ссылка = Источник.Ссылка;
	ТипДокумента = ТипЗнч(Ссылка);
	
	ИменаРеквизитов = "Организация, Номер, Дата";
	
	МетаданныеДокумента = Источник.Метаданные();
	
	Если МетаданныеДокумента.Реквизиты.Найти("НомерВходящегоДокумента") <> Неопределено Тогда
		ИменаРеквизитов = ИменаРеквизитов + ", НомерВходящегоДокумента";
		Если МетаданныеДокумента.Реквизиты.Найти("ДатаВходящегоДокумента") <> Неопределено Тогда
			ИменаРеквизитов = ИменаРеквизитов + ", ДатаВходящегоДокумента";
		КонецЕсли;
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("ЭтоУниверсальныйДокумент") <> Неопределено Тогда
		ИменаРеквизитов = ИменаРеквизитов + ", ЭтоУниверсальныйДокумент";
	КонецЕсли;
	
	Если ТипДокумента = Тип("ДокументСсылка.ОприходованиеЗапасов") Тогда
		ИменаРеквизитов = ИменаРеквизитов + ", ДокументОснование";
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РасходИзКассы") Или
			ТипДокумента = Тип("ДокументСсылка.ОперацияПоПлатежнымКартам") Тогда
			ИменаРеквизитов = ИменаРеквизитов + ", ВидОперации";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СчетФактура") Тогда
		ИменаРеквизитов = ИменаРеквизитов + ", ОтредактированНомерСчетаФактуры";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		ИменаРеквизитов = ИменаРеквизитов + 
		", НомерИсправляемогоКорректировочногоДокумента, ДатаИсправляемогоКорректировочногоДокумента" +
		", НомерИсходногоДокумента, ДатаИсходногоДокумента, ВидОперации";
	КонецЕсли;
	
	Реквизиты = Новый Структура(ИменаРеквизитов);
	ЗаполнитьЗначенияСвойств(Реквизиты, Источник);
	
	Если НЕ ЗначениеЗаполнено(Реквизиты.Организация) Тогда
		Возврат;
	КонецЕсли;
	
	// Установка управляемой блокировки
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДанныеПервичныхДокументов");
	ЭлементБлокировки.УстановитьЗначение("Документ", Ссылка);
	Блокировка.Заблокировать();
	
	НомерДокумента = "";
	ДатаДокумента  = '00010101';
	ЭтоУниверсальныйДокумент = Ложь;
	ЭтоКорректировочныйДокумент = Ложь;
	
	Если Реквизиты.Свойство("ЭтоУниверсальныйДокумент") Тогда
		ЭтоУниверсальныйДокумент = Реквизиты.ЭтоУниверсальныйДокумент;
	КонецЕсли;
	
	Если ТипДокумента = Тип("ДокументСсылка.ОприходованиеЗапасов")
		И ЗначениеЗаполнено(Реквизиты.ДокументОснование) Тогда
		
		РеквизитыИнвентаризации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Реквизиты.ИнвентаризацияТоваровНаСкладе, "Номер, Дата");
		
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыИнвентаризации.Номер, Истина, Ложь);
		ДатаДокумента  = РеквизитыИнвентаризации.Дата;
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РасходИзКассы") Тогда
		
		Если Реквизиты.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Налоги Тогда
			НомерДокумента = СокрЛП(Реквизиты.НомерВходящегоДокумента);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер, Истина, Ложь);
		КонецЕсли;
		
		ДатаДокумента  = Реквизиты.Дата;
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОперацияПоПлатежнымКартам") Тогда
		
		// Для документа "Операция по платежной карте" входящий номер и входящая дата существуют
		// только для вида операции "Платеж по реестру", во всех остальных случаях используем номер и дату
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер, Истина, Ложь);
		ДатаДокумента = Реквизиты.Дата;
		
	ИначеЕсли Реквизиты.Свойство("НомерВходящегоДокумента") И ЗначениеЗаполнено(Реквизиты.НомерВходящегоДокумента) Тогда
		
		Если ТипДокумента = Тип("ДокументСсылка.СчетФактура")
			И Реквизиты.ОтредактированНомерСчетаФактуры = Ложь Тогда
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер, Истина, Ложь);
		Иначе
			НомерДокумента = СокрЛП(Реквизиты.НомерВходящегоДокумента);
		КонецЕсли;
		
		Если Реквизиты.Свойство("ДатаВходящегоДокумента") И ЗначениеЗаполнено(Реквизиты.ДатаВходящегоДокумента) Тогда
			ДатаДокумента = Реквизиты.ДатаВходящегоДокумента;
		Иначе
			ДатаДокумента = Реквизиты.Дата;
		КонецЕсли;
		
	Иначе
		
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер, Истина, Ложь);
		ДатаДокумента  = Реквизиты.Дата;
		
		Если ТипДокумента = Тип("ДокументСсылка.КорректировкаРеализации") 
			И Реквизиты.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
			Если ЗначениеЗаполнено(Реквизиты.НомерИсправляемогоКорректировочногоДокумента) И ЗначениеЗаполнено(Реквизиты.ДатаИсправляемогоКорректировочногоДокумента) Тогда
				НомерДокумента = Реквизиты.НомерИсправляемогоКорректировочногоДокумента;
				ДатаДокумента  = Реквизиты.ДатаИсправляемогоКорректировочногоДокумента;
			ИначеЕсли ЗначениеЗаполнено(Реквизиты.НомерИсходногоДокумента) И ЗначениеЗаполнено(Реквизиты.ДатаИсходногоДокумента) Тогда
				НомерДокумента = Реквизиты.НомерИсходногоДокумента;
				ДатаДокумента  = Реквизиты.ДатаИсходногоДокумента;
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтоУниверсальныйДокумент Тогда
			
			Если ЗначениеЗаполнено(НомерСчетаФактуры) Тогда
				НомерДокумента = НомерСчетаФактуры;
			Иначе
				НомерДокумента = НомерДокумента;
			КонецЕсли;
			
			Если ТипДокумента = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
				РеквизитыКорректировки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ВидОперации,ДокументПоступления");
				ЭтоКорректировочныйДокумент = Документы.КорректировкаПоступления.ЭтоКорректировка(
				РеквизитыКорректировки.ВидОперации, РеквизитыКорректировки.ДокументПоступления);
			ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
				РеквизитыКорректировки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ВидОперации,ДокументРеализации");
				ЭтоКорректировочныйДокумент = Документы.КорректировкаРеализации.ЭтоКорректировка(
				РеквизитыКорректировки.ВидОперации, РеквизитыКорректировки.ДокументРеализации);
				//ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда 
				//	ЭтоКорректировочныйДокумент = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	НаборЗаписейРегистра = РегистрыСведений.ДанныеПервичныхДокументов.СоздатьНаборЗаписей();
	НаборЗаписейРегистра.Отбор.Документ.Установить(Ссылка);
	
	МенеджерЗаписиРегистра = НаборЗаписейРегистра.Добавить();
	МенеджерЗаписиРегистра.Организация                 = Реквизиты.Организация;
	МенеджерЗаписиРегистра.Документ                    = Ссылка;
	МенеджерЗаписиРегистра.Номер                       = НомерДокумента;
	МенеджерЗаписиРегистра.Дата                        = ДатаДокумента;
	МенеджерЗаписиРегистра.НомерРегистратора           = Реквизиты.Номер;
	МенеджерЗаписиРегистра.ДатаРегистратора            = Реквизиты.Дата;
	МенеджерЗаписиРегистра.ЭтоУниверсальныйДокумент    = ЭтоУниверсальныйДокумент;
	МенеджерЗаписиРегистра.ЭтоКорректировочныйДокумент = ЭтоКорректировочныйДокумент;
	
	// Запись данных первичного документа разрешена всем пользователям,
	// которые вправе изменять этот документ.
	ВыполнитьПроверкуПравДоступа("Изменение", Ссылка.Метаданные());
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписейРегистра.Записать(Истина);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Заполняет поле формы списком всех организаций и их структурных частей, имеющих отдельный баланс.
//
// Параметры:
// ЭлементПолеОрганизация - ПолеФормы - поле формы, в которое добавляется список организаций.
// СоответствиеОрганизаций - Структура, Неопределено - после выполнения процедуры содержит в виде структуры
//                           список организаций, добавленный в ЭлементПолеОрганизация.
// Период - Дата - дата, до которой необходимо исключить при заполнении закрытые подразделения. Если указан Период,
//                 то в список не попадают обособленные подразделения закрытые до начала года.
// ИсключитьФилиалы - Булево - из списка организаций исключаются организации - обособленные подразделения.
//
Процедура ЗаполнитьСписокОрганизаций(ЭлементПолеОрганизация, СоответствиеОрганизаций, Период = '00010101', ИсключитьФилиалы = Ложь) Экспорт
	
	СоответствиеОрганизаций = Новый Структура;
	
	ИспользоватьУправленческуюОрганизацию = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИспользоватьУправленческуюОрганизацию", ИспользоватьУправленческуюОрганизацию);
	Запрос.УстановитьПараметр("ИсключитьФилиалы", ИсключитьФилиалы);
	
	Если ЗначениеЗаполнено(Период) Тогда
		Запрос.УстановитьПараметр("Период", НачалоГода(Период));
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Организация
		|ПОМЕСТИТЬ Организации
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	(НЕ Организации.Предопределенный
		|			ИЛИ &ИспользоватьУправленческуюОрганизацию)
		|	И НЕ Организации.ОбособленноеПодразделение
		|
		| ;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Организации.Организация КАК Организация,
		|	Организации.Организация.Наименование КАК ОрганизацияПредставление,
		|	ЛОЖЬ КАК ВключатьОбособленныеПодразделения
		|ИЗ
		|	Организации КАК Организации
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Организации.Организация.ГоловнаяОрганизация,
		|	Организации.Организация.ГоловнаяОрганизация.Наименование,
		|	ИСТИНА
		|ИЗ
		|	Организации КАК Организации
		|ГДЕ
		|	Организации.Организация.ОбособленноеПодразделение
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОрганизацияПредставление";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Организация,
		|	Организации.Наименование КАК ОрганизацияПредставление,
		|	ЛОЖЬ КАК ВключатьОбособленныеПодразделения
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	(НЕ Организации.Предопределенный
		|			ИЛИ &ИспользоватьУправленческуюОрганизацию)
		|	И (НЕ Организации.ОбособленноеПодразделение
		|			ИЛИ НЕ &ИсключитьФилиалы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Организации.ГоловнаяОрганизация,
		|	Организации.ГоловнаяОрганизация.Наименование,
		|	ИСТИНА
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ОбособленноеПодразделение
		|	И НЕ &ИсключитьФилиалы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОрганизацияПредставление";
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЭлементПолеОрганизация.СписокВыбора.Очистить();
	МаксКоличествоСимволов = 40;
	Пока Выборка.Следующий() Цикл
		Ключ     = СтрЗаменить(Строка(Выборка.ВключатьОбособленныеПодразделения) + Выборка.Организация.УникальныйИдентификатор(), "-", "");
		Значение = Новый Структура("Организация,ВключатьОбособленныеПодразделения", Выборка.Организация, Выборка.ВключатьОбособленныеПодразделения);
		СоответствиеОрганизаций.Вставить(Ключ, Значение);
		
		ОрганизацияПредставление = Выборка.ОрганизацияПредставление;
		
		Если Выборка.ВключатьОбособленныеПодразделения Тогда
			ОрганизацияПредставление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 с обособленными подразделениями'"),
				Выборка.ОрганизацияПредставление);
		Иначе
			ОрганизацияПредставление = Выборка.ОрганизацияПредставление;
		КонецЕсли;
		
		ЭлементПолеОрганизация.СписокВыбора.Добавить(Ключ, ОрганизацияПредставление);
		
		МаксКоличествоСимволов = Макс(МаксКоличествоСимволов, СтрДлина(ОрганизацияПредставление));
	КонецЦикла;
	
	ЭлементПолеОрганизация.ШиринаСпискаВыбора = Окр(?(МаксКоличествоСимволов > 200, 200, МаксКоличествоСимволов) * 1.3);
	ЭлементПолеОрганизация.ВысотаСпискаВыбора = ?(ЭлементПолеОрганизация.СписокВыбора.Количество() > 15, 15, ЭлементПолеОрганизация.СписокВыбора.Количество());

КонецПроцедуры

// Возвращает наименование фонового задания для выполнения отчета.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма отчета.
//
// Возвращаемое значение:
//	Строка - Наименование фонового задания.
//
Функция ПолучитьНаименованиеЗаданияВыполненияОтчета(Форма, ИмяОтчета = "") Экспорт
	
	НаименованиеЗадания = НСтр("ru = 'Выполнение отчета: %1'");
	
	Если ПустаяСтрока(ИмяОтчета) Тогда
		ИмяОтчета = ИмяОтчетаПоИмениФормы(Форма);
	КонецЕсли;
	
	НаименованиеЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НаименованиеЗадания, ИмяОтчета);
	
	Возврат НаименованиеЗадания;
	
КонецФункции

// Возвращает имя отчета (объекта метаданных), которому принадлежит форма.
// Следует использовать для форм, принадлежащих отчету.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма объекта.
//
// Возвращаемое значение:
//	Строка       - Имя отчета (объекта метаданных).
//  Неопределено - Передана не форма отчета (например, если отчет использует общую форму).
//
Функция ИмяОтчетаПоИмениФормы(Форма) Экспорт
	
	ЭлементыИмени = СтрРазделить(Форма.ИмяФормы, ".");
	Если ЭлементыИмени.Количество() > 1 И ЭлементыИмени[0] = "Отчет" Тогда
		Возврат ЭлементыИмени[1];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Возвращает сумму выделенных ячеек табличного документа.
//
// Параметры:
//	Результат - ТабличныйДокумент - Табличный документ, содержащий ячейки для суммирования.
//	КэшВыделеннойОбласти - Структура - Содержит ячейки выделенной области.
//
// Возвращаемое значение:
//	Число - Сумма значений ячеек.
//
Функция ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(Знач Результат, КэшВыделеннойОбласти) Экспорт
	
	Сумма = 0;
	Для Каждого КлючИЗначение Из КэшВыделеннойОбласти Цикл
		СтруктураАдресВыделеннойОбласти = КлючИЗначение.Значение;
		ВычислитьСуммуВЯчейках(Сумма, СтруктураАдресВыделеннойОбласти, Результат);
	КонецЦикла;
	
	КэшВыделеннойОбласти.Вставить("Сумма", Сумма);
	
	Возврат Сумма;
	
КонецФункции 

// Вычисляет сумму выделенных ячеек табличного документа.
//
// Параметры:
//	Сумма - Число - Сумма значений ячеек.
//	СтруктураАдресВыделеннойОбласти - Структура - Содержит ячейки выделенной области.
//	Результат - ТабличныйДокумент - Табличный документ, содержащий ячейки для суммирования.
//
Процедура ВычислитьСуммуВЯчейках(Сумма, СтруктураАдресВыделеннойОбласти, Результат) Экспорт
	Перем РазделительДробнойЧасти;
	
	Если Не СтруктураАдресВыделеннойОбласти.Свойство("РазделительДробнойЧасти", РазделительДробнойЧасти) Тогда
		ЭталонноеЧисло = Формат(1.1);
		РазделительДробнойЧасти = ?(СтрДлина(ЭталонноеЧисло) > 3, "", Сред(ЭталонноеЧисло, 2, 1));
	КонецЕсли;

	Для ИндексСтрока = СтруктураАдресВыделеннойОбласти.Верх По СтруктураАдресВыделеннойОбласти.Низ Цикл
		Если ИндексСтрока = 0 Тогда // Выделена колонка отчета (без ограничений), суммы из нее получить нельзя.
			Продолжить;
		КонецЕсли;
		
		Для ИндексКолонка = СтруктураАдресВыделеннойОбласти.Лево По СтруктураАдресВыделеннойОбласти.Право Цикл
			Если ИндексКолонка = 0 Тогда // Выделена строка отчета (без ограничений), суммы из нее получить нельзя.
				Продолжить;
			КонецЕсли;
			
			Ячейка = Результат.Область(ИндексСтрока, ИндексКолонка, ИндексСтрока, ИндексКолонка);
			Если Ячейка.Видимость <> Истина Тогда
				Продолжить;
			КонецЕсли;
			
			Если Ячейка.СодержитЗначение И ТипЗнч(Ячейка.Значение) = Тип("Число") Тогда
				Сумма = Сумма + Ячейка.Значение;
				Продолжить;
			ИначеЕсли Не ЗначениеЗаполнено(Ячейка.Текст) Тогда
				Продолжить;
			КонецЕсли;

			Сумма = Сумма + СтрокаСФорматомВЧисло(Ячейка.Текст, РазделительДробнойЧасти);
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Дает возможность работать с произвольными разделителем дробной части и разделителем групп разрядов.
// Также как и СтроковыеФункцииКлиентСервер.СтрокаВЧисло() работает без выдачи исключений.
//
// Параметры:
//  Значение - Строка - Строка, которую необходимо привести к числу.
//  РазделительДробнойЧасти - Строка - Символ, который является разделителем дробной части. Если не указан, то будет
//             использован первый символ отличный от цифры в ряду символов справа. Например, и "ъ111,222.333ъ" ,
//             и "111,222,333" будут распознаны как 111222.333 , если разделитель не указан явно; но, если указан
//             разделитель "," , то будут распознаны соответственно как 111.222333 и 111222.333
//
// Возвращаемое значение:
//   Число - распознанное число или 0, если не удалось распознать.
//
Функция СтрокаСФорматомВЧисло(Знач Значение, РазделительДробнойЧасти = "") Экспорт
	
	Если ПустаяСтрока(Значение) Тогда
		Возврат 0;
	КонецЕсли;
	
	ДлинаЗначения = СтрДлина(Значение);
	Если ДлинаЗначения = 1 И Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Значение) Тогда
		// Отдельно обрабатываем тривиальный случай. Например, "-" .
		Возврат 0;
	КонецЕсли;
	
	// Определяем самую левую и самую правую из цифр строки.
	Для ЛеваяГраница = 1 По ДлинаЗначения Цикл
		ТекущийСимвол = Сред(Значение, ЛеваяГраница, 1);
		Если ТекущийСимвол >= "0" И ТекущийСимвол <= "9" Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Для ПраваяГраница = 0 По ДлинаЗначения - 1 Цикл
		ТекущийСимвол = Сред(Значение, ДлинаЗначения - ПраваяГраница, 1);
		Если ТекущийСимвол >= "0" И ТекущийСимвол <= "9" Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	ПраваяГраница = ДлинаЗначения - ПраваяГраница;
	Если ПраваяГраница < ЛеваяГраница Тогда
		// В строке вообще отсутствуют цифры.
		Возврат 0;
	КонецЕсли;
	
	// Определяем знак числа.
	Если СтрНайти(Значение, "-", НаправлениеПоиска.СКонца, ЛеваяГраница) <> 0   // соответствует форматам ЧО=3 или ЧО=4
	 Или СтрНайти(Значение, "-", НаправлениеПоиска.СНачала, ПраваяГраница) <> 0 // соответствует форматам ЧО=1 или ЧО=2
	 Или СтрНайти(Значение, "(", НаправлениеПоиска.СКонца, ЛеваяГраница) <> 0   // соответствует формату ЧО=0
		И СтрНайти(Значение, ")", НаправлениеПоиска.СНачала, ПраваяГраница) <> 0 Тогда
		ЗнакЗначения = -1;
	Иначе
		ЗнакЗначения = 1;
	КонецЕсли;
	
	Если ПраваяГраница <> ДлинаЗначения Или ЛеваяГраница <> 1 Тогда
		ДлинаЗначения = ПраваяГраница - ЛеваяГраница + 1;
		Значение = Сред(Значение, ЛеваяГраница, ДлинаЗначения);
	КонецЕсли;
	
	// Определяем дробную часть числа.
	ТолькоЦифры = Новый Массив;
	РазделительНайден = Ложь;
	РазрядовПослеЗапятой = 0;
	Для НомерСимвола = 0 По ДлинаЗначения - 1 Цикл
		
		ТекущийСимвол = Сред(Значение, ДлинаЗначения - НомерСимвола, 1);
		
		ЭтоЦифра = (ТекущийСимвол >= "0" И ТекущийСимвол <= "9");
		Если ЭтоЦифра Тогда
			ТолькоЦифры.Вставить(0, ТекущийСимвол);
		КонецЕсли;
		
		Если РазделительНайден Тогда
			Продолжить;
		КонецЕсли;
			
		Если ЭтоЦифра Тогда
			РазрядовПослеЗапятой = РазрядовПослеЗапятой + 1;
		ИначеЕсли ПустаяСтрока(РазделительДробнойЧасти)
		 Или ТекущийСимвол = РазделительДробнойЧасти Тогда
			РазделительНайден = Истина;
		КонецЕсли;

	КонецЦикла;
	Если Не РазделительНайден Тогда // строка не содержит дробной части
		РазрядовПослеЗапятой = 0;
	КонецЕсли;
	
	// Преобразуем в число с учетом дробной части.
	ТипЧисло = Новый ОписаниеТипов("Число");
	ЗначениеТолькоЦифры = СтрСоединить(ТолькоЦифры);
	Результат = ЗнакЗначения * ТипЧисло.ПривестиЗначение(ЗначениеТолькоЦифры);
	Если РазрядовПослеЗапятой <> 0 И ЗначениеЗаполнено(Результат) Тогда
		Результат = Результат / Pow(10, РазрядовПослеЗапятой);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Устанавливает значения выбранных реквизитов при отказе от выбора значения (выборе пустого значения).
//
// Параметры:
//	ПолеОрганизация - РеквизитФормы - Реквизит формы, в котором нужно установить значение.
//	Организация - СправочникСсылка.Организации - Организация, для которой нужно установить реквизит.
//	ВключатьОбособленныеПодразделения - Булево - Признак, что нужно включать обособленные подразделения.
//
Процедура ОбработкаОтменыВыбораОрганизации(ПолеОрганизация, Организация, ВключатьОбособленныеПодразделения) Экспорт
	
	Если ЗначениеЗаполнено(ПолеОрганизация) Тогда 
		Возврат;
	КонецЕсли;
	
	Организация                       = Неопределено;
	ВключатьОбособленныеПодразделения = Ложь;
	
КонецПроцедуры  



#КонецОбласти
