
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. РаботаСФайламиПереопределяемый.ПриСозданииФормыСпискаФайлов().
Процедура ПриСозданииФормыСпискаФайлов(Форма) Экспорт
	
	Если ТипЗнч(Форма.ВладелецФайла) <> Тип("ДокументСсылка.ЗадачаСотрудника") Тогда
		Возврат;
	КонецЕсли;
	
	Форма.Ширина = 40;
	Форма.Высота = 30;
	
КонецПроцедуры

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту
Процедура ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	
	Команда = Команды.Добавить();
	Команда.Вид = "Органайзер";
	Команда.Идентификатор = "ЗадачаСотрудника";
	Команда.Представление = НСтр("ru = 'Создать задачу'");
	Команда.Важность = "Обычное";
	Команда.Порядок = 100;
	Команда.ОтображениеКнопки = ОтображениеКнопки.Картинка;
	Команда.Картинка = БиблиотекаКартинок.ЗадачаСотрудника;
	Команда.ТипПараметра = Метаданные.ОпределяемыеТипы.ОснованиеЗадачи.Тип;
	Команда.ФункциональныеОпции = "ИспользоватьЗадачиСотрудников";
	Команда.ИзменяетВыбранныеОбъекты = Ложь;
	Команда.РежимЗаписи = "Записывать";
	Команда.Обработчик = "ЗадачиСотрудникаКлиент.СоздатьЗадачу";
	Команда.ТолькоВоВсехДействиях = Ложь;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает доступные типы для формирования меню создания записи календаряподбора типа основания для формы документа ЗадачаСотрудника
//
// Возвращаемое значение:
//  Массив - Массив из Тип
Функция ДоступныеТипыМенюСозданияСобытияКалендаря() Экспорт

	ТипыЗаписей = Метаданные.ОпределяемыеТипы.ИсточникЗаписейКалендаря.Тип.Типы();
	ФункциональныеОпцииТиповЗаписей = ФункциональныеОпцииМенюСозданияЗаписиКалендаря();
	
	ДоступныеТипы = ОтфильтроватьТипыПоФункциональнымОпциям(ТипыЗаписей, ФункциональныеОпцииТиповЗаписей);
	
	Возврат ДоступныеТипы;
	
КонецФункции

// Возвращает доступные типы для формирования меню подбора основания в форме документа ЗадачаСотрудника
// 
// Возвращаемое значение:
//  СписокЗначеий
//		* Ключ - Тип, Строка - Тип или "ПоказатьВсе"
//		* Значение - Строка - Представление в меню
Функция ДоступныеТипыМенюВыбораОснования() Экспорт

	ФункциональныеОпцииТиповОснований = ФункциональныеОпцииТиповОснованийМенюПодбора();
	
	ТипыОснований = ТипыОснованийМенюПодбора();
	ДоступныеТипы = ОтфильтроватьТипыПоФункциональнымОпциям(ТипыОснований, ФункциональныеОпцииТиповОснований);
	
	ТипыОснованийЗадачи = Новый СписокЗначений;
	
	Для Каждого ДоступныйТип Из ДоступныеТипы Цикл
		
		Если ДоступныйТип = Тип("СправочникСсылка.Лиды") Тогда
			Представление = НСтр("ru = 'Лид'");
		ИначеЕсли ДоступныйТип = Тип("СправочникСсылка.КонтактныеЛица") Тогда
			Представление = НСтр("ru = 'Контакт'");
		ИначеЕсли ДоступныйТип = Тип("СправочникСсылка.Контрагенты") Тогда
			Представление = НСтр("ru = 'Контрагент'");
		ИначеЕсли ДоступныйТип = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Представление = НСтр("ru = 'Заказ покупателя'");
		ИначеЕсли ДоступныйТип = Тип("ДокументСсылка.Событие") Тогда
			Представление = НСтр("ru = 'Событие'");
		Иначе
			ТипМетаданных = Метаданные.НайтиПоТипу(ДоступныйТип);
			ПредставлениеОбъекта = ТипМетаданных.ПредставлениеОбъекта;
			Представление = ?(ПустаяСтрока(ПредставлениеОбъекта), ТипМетаданных.Синоним, ПредставлениеОбъекта);
		КонецЕсли;
		
		ТипыОснованийЗадачи.Добавить(ДоступныйТип, Представление);
		
	КонецЦикла;
	
	ТипыОснованийЗадачи.Добавить("ПоказатьВсе", НСтр("ru = 'Показать все'"));
	
	Возврат ТипыОснованийЗадачи;
	
КонецФункции

// Возвращает доступные типы оснований документа ЗадачаСотрудника согласно установленным Функциональным опциям.
// 
// Возвращаемое значение:
//  Массив из Тип
Функция ДоступныеТипыОснованийЗадачиСотрудника() Экспорт	
	
	ТипыОснований = Метаданные.ОпределяемыеТипы.ОснованиеЗадачи.Тип.Типы();
	ФункциональныеОпцииТиповОснований = ФункциональныеОпцииТиповОснований();
	
	ДоступныеТипы = ОтфильтроватьТипыПоФункциональнымОпциям(ТипыОснований, ФункциональныеОпцииТиповОснований);
	
	Возврат ДоступныеТипы;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает Массив с типами, для которых включены переданные параметром функциональные опции.
// Если имя функциональной опции задано пустой строкой, тип не будет исключен.
//
// Параметры:
//  * Типы - Массив из Тип - Исходные типы
//  * ФункциональныеОпции - Соответствие
//
// Возвращаемое значение:
//  Массив - Массив из Тип
Функция ОтфильтроватьТипыПоФункциональнымОпциям(Типы, ФункциональныеОпции)

	ИсключаемыеТипыОснований = Новый Массив;
	ПроверяемыеФО = Новый Массив;
	ОтключенныеФО = Новый Массив;

	Для Каждого ФункциональнаяОпция Из ФункциональныеОпции Цикл
		Если ПроверяемыеФО.Найти(ФункциональнаяОпция.Значение) = Неопределено 
			И Не ПустаяСтрока(ФункциональнаяОпция.Значение) Тогда
				ПроверяемыеФО.Добавить(ФункциональнаяОпция.Значение);
		КонецЕсли;
	КонецЦикла;

	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого ПроверяемаяФО Из ПроверяемыеФО Цикл
		
		Попытка
			ЗначениеФО = ПолучитьФункциональнуюОпцию(ПроверяемаяФО);
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если ТипЗнч(ЗначениеФО) = Тип("Булево") И Не ЗначениеФО Тогда
			ОтключенныеФО.Добавить(ПроверяемаяФО);
		КонецЕсли;

	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Для Каждого ТипОснования Из Типы Цикл
		
		ФункциональнаяОпция = ФункциональныеОпции.Получить(ТипОснования);
		Если ФункциональнаяОпция = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОтключенныеФО.Найти(ФункциональнаяОпция) <> Неопределено Тогда
			ИсключаемыеТипыОснований.Добавить(ТипОснования);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = ОбщегоНазначенияКлиентСервер.РазностьМассивов(Типы, ИсключаемыеТипыОснований);
	
	Возврат Результат;
	
КонецФункции

Функция ФункциональныеОпцииТиповОснований()
	
	ФункциональныеОпцииТипов = Новый Соответствие;

	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.АктВыполненныхРабот"), 		"ИспользоватьАктыВыполненныхРабот");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ИнвентаризацияЗапасов"), 		"ИспользоватьПодсистемуСклад");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ЗаказНаПроизводство"), 		"ИспользоватьПодсистемуПроизводство");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПланПродаж"), 				"ПланированиеПродаж");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПриемИПередачаВРемонт"), 		"ИспользоватьРемонты");
	ФункциональныеОпцииТипов.Вставить(Тип("СправочникСсылка.Проекты"), 					"УчетПоПроектам");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ОтчетКомитенту"), 			"ПриемТоваровНаКомиссию");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ОперацияПоПлатежнымКартам"), 	"ИспользоватьОплатуКартами");
	
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.АктОРасхождениях"), 			"ИспользоватьКорректировкиПоступлений");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.КорректировкаПоступления"), 	"ИспользоватьКорректировкиПоступлений");
	
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.АктОРасхожденияхПолученный"), "ИспользоватьКорректировкиРеализаций");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.КорректировкаРеализации"), 	"ИспользоватьКорректировкиРеализаций");
	
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ДоговорКредитаИЗайма"), 		"КредитыИЗаймы");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.НачисленияПоКредитамИЗаймам"), "КредитыИЗаймы");
	
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ЗаданиеНаРаботу"), 			"ИспользоватьЗаданияНаРаботу");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ЗаказНаПеремещение"), 		"УчетПоНесколькимСкладам");
	
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.СчетНаОплатуПоставщика"), 	"ИспользоватьПодсистемуЗакупки");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ЗаказПоставщику"), 			"ИспользоватьПодсистемуЗакупки");
	
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПереоценкаТоваровНаКомиссии"), "ПередачаТоваровНаКомиссию");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ОтчетКомиссионера"), 			"ПередачаТоваровНаКомиссию");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ОтчетКомиссионераОСписании"), "ПередачаТоваровНаКомиссию");
	
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПлатежнаяВедомость"), 		"ИспользоватьПодсистемуЗарплата");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПриемНаРаботуУНФ"), 			"ИспользоватьПодсистемуЗарплата");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.НачислениеЗарплатыУНФ"), 		"ИспользоватьПодсистемуЗарплата");
	
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.СверкаВзаиморасчетов"), 		"СверкиВзаиморасчетов");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.СчетНаОплату"), 				"ИспользоватьСчетаНаОплату");

	ФункциональныеОпцииТипов.Вставить(Тип("СправочникСсылка.ДоговорыКонтрагентов"), 	"ИспользоватьДоговорыКонтрагентов");
	ФункциональныеОпцииТипов.Вставить(Тип("СправочникСсылка.КонтактныеЛица"), 			"ИспользоватьКонтактыКонтрагентов");
	
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ОтчетОПереработке"), 			"ПереработкаДавальческогоСырья");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ОтчетПереработчика"), 		"ПередачаСырьяВПереработку");	
	
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПеремещениеДСПлан"), 			"ПлатежныйКалендарь");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.РасходДСПлан"), 				"ПлатежныйКалендарь");
	
	ФункциональныеОпцииТипов.Вставить(Тип("СправочникСсылка.Лиды"), 					"ИспользоватьПодсистемуCRM");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.Событие"), 					"ИспользоватьСобытия");

	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями"), "ПередачаТоваровМеждуОрганизациями");

	Возврат ФункциональныеОпцииТипов;
	
КонецФункции

Функция ТипыОснованийМенюПодбора()

	ТипыОснований = Новый Массив;
	ТипыОснований.Добавить(Тип("СправочникСсылка.Лиды"));
	ТипыОснований.Добавить(Тип("СправочникСсылка.КонтактныеЛица"));
	ТипыОснований.Добавить(Тип("СправочникСсылка.Контрагенты"));
	ТипыОснований.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	ТипыОснований.Добавить(Тип("ДокументСсылка.Событие"));
	
	Возврат ТипыОснований;
	
КонецФункции

Функция ФункциональныеОпцииТиповОснованийМенюПодбора()
	
	ФункциональныеОпцииТипов = Новый Соответствие;

	ФункциональныеОпцииТипов.Вставить(Тип("СправочникСсылка.Лиды"),           "ИспользоватьПодсистемуCRM");
	ФункциональныеОпцииТипов.Вставить(Тип("СправочникСсылка.КонтактныеЛица"), "ИспользоватьКонтактыКонтрагентов");
	ФункциональныеОпцииТипов.Вставить(Тип("СправочникСсылка.Контрагенты"),    "");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ЗаказПокупателя"),  "");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.Событие"),          "ИспользоватьСобытия");	

	Возврат ФункциональныеОпцииТипов;
	
КонецФункции

Функция ФункциональныеОпцииМенюСозданияЗаписиКалендаря()
	
	ФункциональныеОпцииТипов = Новый Соответствие;

	ФункциональныеОпцииТипов.Вставить(Тип("СправочникСсылка.ЗаписиКалендаряПодготовкиОтчетности"),
		"ИспользоватьКалендарьПодготовкиОтчетности");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ЗаданиеНаРаботу"),   "ИспользоватьЗаданияНаРаботу");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ЗаказПокупателя"),   "");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ЗаказНаПроизводство"), "ИспользоватьПодсистемуПроизводство");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.Событие"),             "ИспользоватьСобытия");	

	Возврат ФункциональныеОпцииТипов;
	
КонецФункции

#КонецОбласти
