#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Начальное заполнение и обновление информационной базы.
Процедура НачальноеЗаполнение() Экспорт

	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;
	
	Обновить(ПолучитьМакет("ПредопределенныеЗначения").ПолучитьТекст(), Ложь);
КонецПроцедуры

// Обновляет данные регистра.
Процедура Обновить(ТекстXML, ПолучатьДанныеИзСервиса = Истина) Экспорт
	РегламентированнаяОтчетностьУСН.ОбновитьКлассификатор(ТекстXML, ПолучатьДанныеИзСервиса);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает размеры тарифов взносов в разрезе лет и видов тарифа, 
// установленные Федеральным законом.
//
// Параметры: 
// 	нет
//
// Возвращаемое значение:
//	Таблица значений, соответствующая по структуре регистру сведений ТарифыСтраховыхВзносовУНФ.
//
Функция ТаблицаТарифовСтраховыхВзносов() Экспорт
	ТекстXML = ПолучитьМакет("ПредопределенныеЗначения").ПолучитьТекст();
	СведенияОКлассификаторе = ОбщегоНазначения.ЗначениеИзСтрокиXML(ТекстXML);
	Возврат РегламентированнаяОтчетностьУСН.ПолныеИменаВСсылки(СведенияОКлассификаторе.Данные, СоздатьНаборЗаписей().ВыгрузитьКолонки());
КонецФункции

#КонецОбласти

#КонецЕсли