#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ТекущаяНастройка() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Использование", Ложь);
	Результат.Вставить("АдресПриложения", "");
	Результат.Вставить("НомерОбласти", 0);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиИнтеграцииСБухгалтерией.Использование КАК Использование,
	|	НастройкиИнтеграцииСБухгалтерией.АдресПриложения КАК АдресПриложения,
	|	НастройкиИнтеграцииСБухгалтерией.НомерОбласти КАК НомерОбласти
	|ИЗ
	|	РегистрСведений.НастройкиИнтеграцииСБухгалтерией КАК НастройкиИнтеграцииСБухгалтерией");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДоступныеПриложенияБухгалтерии() Экспорт
	
	ПриложенияПользователя = ПрограммныйИнтерфейсСервиса.Приложения();
	
	Отбор = Новый Структура;
	Отбор.Вставить("СостояниеПриложения", Перечисления.СостоянияПриложений.Используется);
	Отбор.Вставить("ИмяВидаПриложения", "БухгалтерияПредприятия");
	
	Возврат ПриложенияПользователя.Скопировать(Отбор, "Код,АдресПриложения,Наименование");
	
КонецФункции

Функция УстановитьПараметрыПодключенияКБухгалтерии(ОписаниеПриложения) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбластьДанныхВспомогательныеДанные.Установить(РаботаВМоделиСервиса.ЗначениеРазделителяСеанса());
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		ЕстьИзменения = Ложь;
		
		Если НаборЗаписей[0].АдресПриложения <> ОписаниеПриложения.АдресПриложения Тогда
			НаборЗаписей[0].АдресПриложения = ОписаниеПриложения.АдресПриложения;
			ЕстьИзменения = Истина;
		КонецЕсли;
		Если НаборЗаписей[0].НомерОбласти <> ОписаниеПриложения.Код Тогда
			НаборЗаписей[0].НомерОбласти = ОписаниеПриложения.Код;
			ЕстьИзменения = Истина;
		КонецЕсли;
		
		Если ЕстьИзменения Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли