
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("АдресХранилищаДляОбменаДанными", АдресХранилищаДляОбменаДанными);
	
	КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	Элементы.ГруппаКнопки.Видимость = Ложь;
	Элементы.ПовторитьПодключение.Видимость = Ложь;
	Элементы.ТекстОшибки.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтобразитьИнформацию();
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	ОчиститьСообщения();
	ОтобразитьИнформацию();
	Активизировать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерезапуститьПриложение(Команда)

	ЗавершитьРаботуСистемы(Истина, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПовторитьПодключение(Команда)
	
	ВладелецФормы.ПовторноеПодключение();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОтобразитьИнформацию()
	
	Данные = ПолучитьИзВременногоХранилища(АдресХранилищаДляОбменаДанными);
	Элементы.КартинкаОжидание.Картинка = Данные.Картинка;
	Элементы.НадписьОжидание.Заголовок = Данные.Текст;
	Элементы.ГруппаКнопки.Видимость = Данные.ПоказатьКнопкиВопроса;
	Элементы.ПовторитьПодключение.Видимость = Данные.ПоказатьКнопкуПовторногоПодключения;
	
	ТекстОшибки = Данные.ТекстОшибки;
	Элементы.ТекстОшибки.Видимость = Не ПустаяСтрока(ТекстОшибки);
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
		Высота = 25;
		Ширина = 60;
	КонецЕсли;
	
	Если Данные.ЗакрытьФорму Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти