#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавить новую связь и очистить все старые
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты
//  Лид - СправочникСсылка.Лиды
//
Процедура НоваяСвязь(Контрагент, Лид) Экспорт
	
	УдалитьСвязи(Лид);
	
	МенеджерЗаписи = РегистрыСведений.СвязиКонтрагентЛид.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Лид = Лид;
	МенеджерЗаписи.Контрагент = Контрагент;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Очистить все связи лида с контрагентами
//
// Параметры:
//  Лид - СправочникСсылка.Лиды
//
Процедура УдалитьСвязи(Лид) Экспорт
	
	НаборЗаписей = РегистрыСведений.СвязиКонтрагентЛид.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Лид.Установить(Лид);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() Тогда
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Добавление заказа в существующую связь
//
// Параметры:
//  Лид - СправочникСсылка.Лиды
//  Контрагент - СправочникСсылка.Контрагенты
//  Заказ - ДокументСсылка.ЗаказПокупателя
//
Процедура ДобавитьЗаказВСвязь(Лид, Контрагент, Заказ) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.СвязиКонтрагентЛид.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Контрагент = Контрагент;
	МенеджерЗаписи.Лид = Лид;
	МенеджерЗаписи.Прочитать();
	
	Если Не МенеджерЗаписи.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи.Заказ = Заказ;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
