
#Область ПрограммныйИнтерфейс

Процедура ОтправитьСобытиеGA(ПараметрыСобытия) Экспорт
	
	Попытка
		ИнтернетПрокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси("HTTP");
		HTTPСоединение = Новый HTTPСоединение("www.google-analytics.com", 80,,,ИнтернетПрокси,5);
		
		HTTPЗапрос = Новый HTTPЗапрос(ПараметрыСобытия);
		
		Результат = HTTPСоединение.Получить(HTTPЗапрос);
	Исключение
		// Сбор статистики
		Инфо = ИнформацияОбОшибке();
		ПолноеОписание = ПодробноеПредставлениеОшибки(Инфо);
		СборСтатистикиМПКлиентСерверПереопределяемый.ОтправитьОшибкуВGA(ПолноеОписание);
		// Конец сбор статистики
	КонецПопытки;
	
КонецПроцедуры // ОтправитьСобытиеGA()

Процедура ОтправитьСобытиеEndВGA() Экспорт
	
	//ОтправитьСобытиеGA(глПараметрыСтатистикиПриЗакрытии);
	
КонецПроцедуры

#КонецОбласти