#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресДокументыОплатыВХранилище = Параметры.АдресДокументыОплатыВХранилище;
	ДатаНомерДокументовОплаты.Загрузить(ПолучитьИзВременногоХранилища(АдресДокументыОплатыВХранилище));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ЗаписатьДокументыОплатыВХранилище();
	Закрыть(КодВозвратаДиалога.OK);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьДокументыОплатыВХранилище()
	
	ДокументыОплатыВХранилище = ДатаНомерДокументовОплаты.Выгрузить();
	ПоместитьВоВременноеХранилище(ДокументыОплатыВХранилище, АдресДокументыОплатыВХранилище);
	
КонецПроцедуры

#КонецОбласти
