
#Область ПрограммныйИнтерфейс

// Возвращает результат добавления штампов в документ.
//
// Параметры:
//   ПараметрыДобавленияШтампов - см. Интеграция1СШтампКлиентСервер.НовыеПараметрыДобавленияШтамповВДокумент
//   Таймаут - Число, Неопределено - Максимальное время ожидания получения результата выполнения задания из сервиса
//                                    (не больше 600 сек). По умолчанию - 600 сек.
//
// Возвращаемое значение:
//   Структура: 
//    * ЕстьОшибки          - Булево - Признак наличия ошибок.
//    * ИнформацияОбОшибках - Структура - Информация об ошибках выополнения запроса:
//       ** КодСостояния - Число      - Код состояния http ответа.
//       ** Данные       - Структура  - Данные ответа сервиса.
//       ** URLРедиректа - Строка     - URL адрес для повторного обращения.
//       ** Интервал     - Число      - Интервал (в секундах) для повторного обращения к сервису.
//       ** ТекстОшибки  - Строка     - Текст ошибки на стороне сервиса.
//    * ЕстьРезультат      - Булево         - Признак успешного выполнения запроса.
//    * ДвоичныеДанные     - ДвоичныеДанные - Двоичные данные результата (PDF документа).
//
Функция РезультатДобавленияШтамповВДокумент(Знач ПараметрыДобавленияШтампов, Знач Таймаут = Неопределено) Экспорт
	
	Возврат Интеграция1СШтампСлужебный.РезультатДобавленияШтамповВДокумент(
		ПараметрыДобавленияШтампов,
		Таймаут);
	
КонецФункции

#КонецОбласти