//@strict-types
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает общий размер файлов массива документов учета в байтах
//
// Параметры:
//  ЭлектронныеДокументы - Массив из ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
//
// Возвращаемое значение:
//  Число
Функция РазмерПрисоединенныхФайловДокументов(ЭлектронныеДокументы) Экспорт
	
	Возврат ЭлектронныеДокументыЭДО.РазмерПрисоединенныхФайловДокументов(ЭлектронныеДокументы);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаДействийПоЭДО

// Возвращает описание длительной операции выполнения действий по ЭДО.
// 
// Параметры:
//  ПараметрыВыполненияДействий - См. ИнтерфейсДокументовЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО
//  КонтекстДиагностики - См. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
// Возвращаемое значение:
//  См. ЭлектронныеДокументыЭДО.ВыполнитьДействияПоЭДОВФоне
Функция ВыполнитьДействияПоЭДОВФоне(Знач ПараметрыВыполненияДействий, Знач КонтекстДиагностики) Экспорт
	Возврат ЭлектронныеДокументыЭДО.ВыполнитьДействияПоЭДОВФоне(ПараметрыВыполненияДействий, КонтекстДиагностики);
КонецФункции

// Возвращает результат заполнения доверенностей и подписантов по сертификату.
//
// Параметры:
//  ДанныеДляЗаполнения - Соответствие из КлючИЗначение:
//    * Ключ - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//    * Значение - Структура:
//  	** ТребуетсяЗаполнитьПодписанта   - Булево
//  	** ТребуетсяЗаполнитьДоверенность - Булево
//  	** НаборМЧД						  - Массив из СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//  	** Данные						  - Неопределено, Строка, ДвоичныеДанные - данные файлов.
//  Сертификат          - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//  КонтекстДиагностики - См. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
//  РезультатУточненияМЧД - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//
// Возвращаемое значение:
//  См. ЭлектронныеДокументыЭДО.ЗаполнитьПодписантовИДоверенностиПоСертификату
//
Функция ЗаполнитьПодписантовИДоверенностиПоСертификату(Знач ДанныеДляЗаполнения,
	Знач Сертификат, КонтекстДиагностики, Знач РезультатУточненияМЧД) Экспорт
	Возврат ЭлектронныеДокументыЭДО.ЗаполнитьПодписантовИДоверенностиПоСертификату(
		ДанныеДляЗаполнения, Сертификат, КонтекстДиагностики, РезультатУточненияМЧД);
КонецФункции

// Возвращает преобразованный результат действий по ЭДО.
// 
// Параметры:
//  АдресРезультата - Строка
//
// Возвращаемое значение:
//  См. ЭлектронныеДокументыЭДО.ОбработатьРезультатДействийПоЭДОФоне
//
Функция РезультатДействийПоЭДО(Знач АдресРезультата) Экспорт
	
	РезультатДействийПоЭДОФоне = ПолучитьИзВременногоХранилища(АдресРезультата);
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	РезультатДействийПоЭДО = ЭлектронныеДокументыЭДО.ОбработатьРезультатДействийПоЭДОФоне(РезультатДействийПоЭДОФоне);
	
	Возврат РезультатДействийПоЭДО;
	
КонецФункции

#КонецОбласти

#Область ВидыДокументов

// См. ОбщегоНазначения.ЭтоМобильныйКлиент
Функция ИспользоватьКраткоеПредставлениеВидовДокументов() Экспорт
	Возврат ОбщегоНазначения.ЭтоМобильныйКлиент();
КонецФункции

#КонецОбласти

#Область Подписи

// Возвращает результат проверки подписей электронного документа.
// 
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО
//                      - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
//  КонтекстДиагностики - См. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
//
// Возвращаемое значение:
//  См. ЭлектронныеДокументыЭДО.ПроверитьПодписиДокумента
//
Функция ПроверитьПодписиДокумента(Знач ЭлектронныйДокумент, КонтекстДиагностики) Экспорт
	Возврат ЭлектронныеДокументыЭДО.ПроверитьПодписиДокумента(ЭлектронныйДокумент, КонтекстДиагностики);
КонецФункции

// Возвращает результат проверки подписей сообщения.
// 
// Параметры:
//  СообщениеЭДО - ДокументСсылка.СообщениеЭДО
//  КонтекстДиагностики - См. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
//
// Возвращаемое значение:
//  См. ЭлектронныеДокументыЭДО.ПроверитьПодписиСообщения
//
Функция ПроверитьПодписиСообщения(Знач СообщениеЭДО, КонтекстДиагностики) Экспорт
	Возврат ЭлектронныеДокументыЭДО.ПроверитьПодписиСообщения(СообщениеЭДО, КонтекстДиагностики);
КонецФункции

// См. ЭлектронныеДокументыЭДО.ЗаписатьРезультатПроверкиПодписейДокумента
Функция ЗаписатьРезультатПроверкиПодписейДокумента(Знач ПроверенныеПодписи) Экспорт
	Возврат ЭлектронныеДокументыЭДО.ЗаписатьРезультатПроверкиПодписейДокумента(ПроверенныеПодписи);
КонецФункции

#КонецОбласти

#Область МашиночитаемыеДоверенности

// Возвращает результаты проверок подписей по МЧД при регистрации сертификатов.
// 
// Параметры:
//  НаборПараметровПроверок - Массив из См. ЭлектронныеДокументыЭДОКлиент.НовыеПараметрыПроверкиПодписиПоМЧДПриРегистрацииСертификата
//  КонтекстДиагностики - См. ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики
//  
// Возвращаемое значение:
//  См. ЭлектронныеДокументыЭДО.ПроверитьПодписиПоМЧДПриРегистрацииСертификатов
Функция ПроверитьПодписиПоМЧДПриРегистрацииСертификатов(Знач НаборПараметровПроверок, КонтекстДиагностики) Экспорт
	Возврат ЭлектронныеДокументыЭДО.ПроверитьПодписиПоМЧДПриРегистрацииСертификатов(
		НаборПараметровПроверок, КонтекстДиагностики)
КонецФункции

// Продолжает проверку подписей по МЧД при регистрации сертификатов
//
// Параметры:
//  РезультатыПроверокПодписейПоМЧД - См. ЭлектронныеДокументыЭДО.ПроверитьПодписиПоМЧДПриРегистрацииСертификатов
//  КонтекстДиагностики - См. ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики
//
// Возвращаемое значение:
//  См. ЭлектронныеДокументыЭДО.ПроверитьПодписиПоМЧДПриРегистрацииСертификатовПродолжение
Функция ПроверитьПодписиПоМЧДПриРегистрацииСертификатовПродолжение(Знач РезультатыПроверокПодписейПоМЧД, 
	КонтекстДиагностики) Экспорт
	Возврат ЭлектронныеДокументыЭДО.ПроверитьПодписиПоМЧДПриРегистрацииСертификатовПродолжение(
		РезультатыПроверокПодписейПоМЧД, КонтекстДиагностики);
КонецФункции

// Текст ошибки сертификатом можно подписать только по МЧД.
// 
// Параметры:
//  Сертификаты - Массив Из СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования - сертификаты,
//                                                                                            по которым требуются МЧД
// 
// Возвращаемое значение:
//  См. ЭлектронныеДокументыЭДО.ТекстОшибкиСертификатомМожноПодписатьТолькоПоМЧД
Функция ТекстОшибкиСертификатомМожноПодписатьТолькоПоМЧД(Знач Сертификаты) Экспорт
	
	Возврат ЭлектронныеДокументыЭДО.ТекстОшибкиСертификатомМожноПодписатьТолькоПоМЧД(Сертификаты);
	
КонецФункции

#КонецОбласти

// Параметры:
//  ИдентификаторКонтрагента - Строка
//  ИдентификаторОрганизации - Строка
//  АдресФайла - Строка
//
// Возвращаемое значение:
//  см. ПакетыДокументовЭДОКлиентСервер.НовыйРезультатПроверкиПревышения
Функция ПроверкаПревышенияМаксимальногоРазмераФайла(ИдентификаторКонтрагента, ИдентификаторОрганизации, АдресФайла) Экспорт
	
	Возврат ЭлектронныеДокументыЭДО.ПроверкаПревышенияМаксимальногоРазмераФайла(ИдентификаторКонтрагента,
		ИдентификаторОрганизации, АдресФайла);
	
КонецФункции

#КонецОбласти