#Область ПрограммныйИнтерфейс

// Помещает содержимое присоединенного файла во временное хранилище и возвращает адрес
//
// Параметры:
//  Ссылка  - ссылка на справочник "Присоединенные файлы".
//  Адрес - адрес во временном хранилище.
// 
// Возвращаемое значение:
//  Строка - адрес во временном хранилище
//
Функция ПрисоединенныйФайлВоВременноеХранилище( Ссылка, Адрес = Неопределено ) Экспорт
	Возврат ИнтеграцияСМаркетплейсамиСервер.ПрисоединенныйФайлВоВременноеХранилище( Ссылка, Адрес );
КонецФункции

#КонецОбласти