///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаписатьИсториюПлатежнойОперации(Команда, ДанныеОперации, РезультатВыполнения) Экспорт
	
	ЛогированиеОперацийБПО.ЗаписатьИсториюПлатежнойОперации(Команда, ДанныеОперации, РезультатВыполнения);

КонецПроцедуры

// Устанавливает идентификатор фискальной операции в журнале логирования платежных операций по идентификатору запроса
//
// Параметры:
//   ИдентификаторЗапроса - Строка - Уникальный идентификатор запроса
//   ИдентификаторФискальнойОперации - Строка - Идентификатор фискальной операции
Процедура УстановитьИдентификаторФискальнойЗаписи(ИдентификаторЗапроса, ИдентификаторФискальнойОперации) Экспорт
	
	РегистрыСведений.ПлатежныеОперации.УстановитьРеквизитПлатежнойОперации(ИдентификаторЗапроса, 
		"ИдентификаторФискальнойОперации", ИдентификаторФискальнойОперации);
	
КонецПроцедуры

// ++ НеМобильноеПриложение 

Процедура ЗаписатьлогНаСервере(Знач Записи) Экспорт
	
	ЛогированиеОперацийБПО.ЗаписатьЛогОперацииНаСервере(Записи);
	
КонецПроцедуры

Функция ПараметрыЛогированияОперацийСОборудованием() Экспорт
	
	Возврат ЛогированиеОперацийБПО.ПараметрыЛогированияОперацийСОборудованием();
	
КонецФункции

// -- НеМобильноеПриложение 

#КонецОбласти

