// @strict-types

#Область ПрограммныйИнтерфейс

// Устанавливает пользователю права по умолчанию.
// Вызывается при работе в модели сервиса, в случае обновления в менеджере
// сервиса прав пользователя без прав администрирования.
// @skip-check module-empty-method - переопределяемый метод.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - пользователь, 
//                 которому требуется установить права по умолчанию.
//  ДоступРазрешен - Булево - признак разрешения доступа. 
//                   Если Истина - доступ разрешается, если Ложь - доступ запрещается.
//
Процедура УстановитьПраваПоУмолчанию(Пользователь, ДоступРазрешен = Истина) Экспорт
	
	УправлениеДоступомУНФ.УстановитьПраваПоУмолчанию(Пользователь, ДоступРазрешен);
	
КонецПроцедуры

// Устанавливает пользователю права доступа к API области данных.
// Вызывается при работе в модели сервиса, в случае обновления в менеджере 
// сервиса прав пользователя без прав администрирования.
// @skip-check module-empty-method - переопределяемый метод.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - пользователь, которому требуется установить права доступа к API.
//  ДоступРазрешен - Булево - признак разрешения доступа.  
//                   Если Истина - доступ разрешается, если Ложь - доступ запрещается.
//
Процедура УстановитьДоступКAPIОбластиДанных(Пользователь, ДоступРазрешен = Истина) Экспорт
	УправлениеДоступомУНФ.ОбновитьДоступСлужебногоПользователяКAPI(Пользователь, ДоступРазрешен);
КонецПроцедуры

// Определяет параметры работы личного кабинета
// 
// По умолчанию отображение включено.
//
// Параметры:
//  ПараметрыЛичногоКабинета - Структура:
//   * ОтображатьВПанелиРазделов - Булево - По умолчанию Истина. Управляет отображением личного кабинета сервиса
//                                 в панели разделов прикладной конфигурации.
// @skip-check module-empty-method - переопределяемый метод.
Процедура ПриОпределенииПараметровЛичногоКабинета(ПараметрыЛичногоКабинета) Экспорт
	ПараметрыЛичногоКабинета.ОтображатьВПанелиРазделов = Ложь;
КонецПроцедуры

#КонецОбласти
