#Область СлужебныеПроцедурыИФункции

Функция ОперацияЭДОИзСтроки(Знач СтрокаОперацииЭДО) Экспорт
	
	Возврат ИнтеграцияБРОЭДОСлужебный.ОперацияЭДОИзСтроки(СтрокаОперацииЭДО);
	
КонецФункции

Функция ОперацияЭДОВСтроку(ОперацияЭДО) Экспорт
	
	Возврат ИнтеграцияБРОЭДОСлужебный.ОперацияЭДОВСтроку(ОперацияЭДО);
	
КонецФункции

// Выполняет проверку существования учетной записи ЭДО.
// 
// Параметры:
//  ОтборУчетнойЗаписи - Структура:
//  * Организация - ОпределяемыйТип.Организация - организация, которую следует подключить к ЭДО.
//  * КодНалоговогоОргана - Строка - код налоговой инспекции, в которой зарегистрирована организация.
//  * Сертификат - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования - сертификат для регистрации у оператора ЭДО.
// 
// Возвращаемое значение:
//  Булево - Учетная запись существует
Функция УчетнаяЗаписьСуществует(Знач ОтборУчетнойЗаписи) Экспорт
	Возврат УчетныеЗаписиЭДО.УчетнаяЗаписьСуществует(ОтборУчетнойЗаписи);
КонецФункции

#КонецОбласти