// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ПустаяСтрока(Параметры.КодСпециальногоОбстоятельства) Тогда
		ДанныеЗаписи = РегистрыСведений.ПереченьСпециальныхОбстоятельствДокументаЭДО.СоздатьМенеджерЗаписи();
		ДанныеЗаписи.Код = Параметры.КодСпециальногоОбстоятельства;
		ДанныеЗаписи.Прочитать();
		ЗаполнитьЗначенияСвойств(Запись, ДанныеЗаписи);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	Заголовок = Запись.Код;
КонецПроцедуры

#КонецОбласти