#Область ПрограммныйИнтерфейс

// См. СчетаФактурыУНФ.ЗаполнитьПараметрыПечатиУКД
Процедура ЗаполнитьПараметрыПечатиУКД(ПараметрКоманды, ИсточникиПечати, СообщенияПользователю) Экспорт
	СчетаФактурыУНФ.ЗаполнитьПараметрыПечатиУКД(ПараметрКоманды, ИсточникиПечати, СообщенияПользователю);
КонецПроцедуры

// См. СчетаФактурыУНФ.ПолучитьПодчиненныйСчетФактуру
Функция ПолучитьПодчиненныйСчетФактуру(ДокументОснование, Полученный = Ложь) Экспорт
	Возврат СчетаФактурыУНФ.ПолучитьПодчиненныйСчетФактуру(ДокументОснование, Полученный);
КонецФункции

// См. СчетаФактурыУНФ.СоздатьСчетФактуру
Функция СоздатьСчетФактуру(ДокументОснование, СчетФактураДата, СчетФактураНомер = Неопределено) Экспорт
	Возврат СчетаФактурыУНФ.СоздатьСчетФактуру(ДокументОснование, СчетФактураДата, СчетФактураНомер);
КонецФункции

// См. СчетаФактурыУНФ.ДатаНомерДляПечатиСчетаФактуры
Функция ДатаНомерДляПечатиСчетаФактуры(СчетФактура) Экспорт
	Возврат СчетаФактурыУНФ.ДатаНомерДляПечатиСчетаФактуры(СчетФактура);
КонецФункции

#КонецОбласти