#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВосстановитьНастройкиМонитора();

	ПодготовитьМониторОтражения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОжидатьЗавершениеОбновленияДанныхМонитора();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОтражениеОтключено" Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПодготовитьМониторОтражения()
	
	ВосстановитьНастройкиОтражения();
	
	СформироватьИнтерфейсШапкиМонитораНаСервере();
	СформироватьИнтерфейсПоказателейМонитораНаСервере();
	
	НачатьОбновлениеДанныхМонитораНаСервере(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНастройкиМонитора(Команда)
	
	ОткрытьФорму(
		"Обработка.ОтражениеДокументовВБухгалтерии.Форма.НастройкиРаздела",
		,
		ЭтотОбъект,
		,
		,
		,
		Новый ОписаниеОповещения("НастройкиМонитораЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьДанныеМонитора(Команда)
	
	ДлительнаяОперация = Неопределено;
	Элементы.ПанельМонитор.ТекущаяСтраница = Элементы.СтраницаОжидание;
	
	ПодключитьОбработчикОжидания("НачатьОбновлениеДанныхМонитора", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщийОбработчикКомандыРазделаУчета(Команда)
	
	ЧастиИмени = СтрРазделить(Команда.Имя, "_");
	
	ИдентификаторРаздела = ЧастиИмени[1];
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отборы", Новый Структура);
	
	ПараметрыФормы.Отборы.Вставить("Период", ОтборПериод);
	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		ПараметрыФормы.Отборы.Вставить("Организации", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОтборОрганизация));
	Иначе
		ПараметрыФормы.Отборы.Вставить("Организации", Новый Массив);
	КонецЕсли;
	ПараметрыФормы.Отборы.Вставить("РазделыУчета", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторРаздела));
	ПараметрыФормы.Отборы.Вставить("Статусы", Новый Массив);
	
	ОткрытьФорму("Обработка.ОтражениеДокументовВБухгалтерии.Форма.ЖурналОтраженияДокументов", ПараметрыФормы, ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтборМонитораОрганизации(Команда)
	
	СписокДействий = Новый СписокЗначений;
	
	Если ПодключенныеОрганизации.Количество() = 1 Тогда
		СписокДействий.Добавить(ПодключенныеОрганизации[0].Значение, , Истина); 
	Иначе
		СписокДействий.Добавить(
			Неопределено,
			НСтр("ru = 'Все организации'"),
			Не ЗначениеЗаполнено(ОтборОрганизация));
		Для Каждого ЭлементСписка Из ПодключенныеОрганизации Цикл
			СписокДействий.Добавить(ЭлементСписка.Значение, , ЭлементСписка.Значение = ОтборОрганизация);
		КонецЦикла;
	КонецЕсли;
	
	Если СписокДействий.Количество() > 0 Тогда
		ПоказатьВыборИзМеню(
			Новый ОписаниеОповещения("ОтборМонитораОрганизацииЗавершение", ЭтотОбъект),
			СписокДействий,
			Элементы.КомандаОтборМонитораОрганизации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтборМонитораПериод(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = ОтборПериод;
	Диалог.Показать(Новый ОписаниеОповещения("ОтборМонитораПериодЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЖурналОтраженияДокументов(Команда)
	
	ОткрытьФорму("Обработка.ОтражениеДокументовВБухгалтерии.Форма.ЖурналОтраженияДокументов", , ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаБухгалтерия_ОборотноСальдоваяВедомость(Команда)
	
	ВыполнитьКомандуБухгалтерии(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаБухгалтерия_ОборотноСальдоваяВедомостьПоСчету(Команда)
	
	ВыполнитьКомандуБухгалтерии(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаБухгалтерия_СводныеПроводки(Команда)
	
	ВыполнитьКомандуБухгалтерии(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаБухгалтерия_ОтчетПоПроводкам(Команда)
	
	ВыполнитьКомандуБухгалтерии(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаБухгалтерия_ОстаткиДенежныхСредств(Команда)
	
	ВыполнитьКомандуБухгалтерии(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаБухгалтерия_РасчетыСПокупателямиИПоставщиками(Команда)
	
	ВыполнитьКомандуБухгалтерии(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаБухгалтерия_ОстаткиТоваров(Команда)
	
	ВыполнитьКомандуБухгалтерии(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаБухгалтерия_КалендарьОтчетности(Команда)
	
	ВыполнитьКомандуБухгалтерии(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаБухгалтерия_РегламентированныеОтчеты(Команда)
	
	ВыполнитьКомандуБухгалтерии(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаБухгалтерия_ЖурналОпераций(Команда)
	
	ВыполнитьКомандуБухгалтерии(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаБухгалтерия_ЖурналПроводок(Команда)
	
	ВыполнитьКомандуБухгалтерии(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаБухгалтерия_Реализация(Команда)
	
	ВыполнитьКомандуБухгалтерии(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаБухгалтерия_СчетаФактурыВыданные(Команда)
	
	ВыполнитьКомандуБухгалтерии(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаБухгалтерия_Поступление(Команда)
	
	ВыполнитьКомандуБухгалтерии(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаБухгалтерия_СчетаФактурыПолученные(Команда)
	
	ВыполнитьКомандуБухгалтерии(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаБухгалтерия_АктыСверкиРасчетов(Команда)
	
	ВыполнитьКомандуБухгалтерии(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаБухгалтерия_БанковскиеВыписки(Команда)
	
	ВыполнитьКомандуБухгалтерии(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаБухгалтерия_КассовыеДокументы(Команда)
	
	ВыполнитьКомандуБухгалтерии(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаБухгалтерия_Организации(Команда)
	
	ВыполнитьКомандуБухгалтерии(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаБухгалтерия_УчетнаяПолитика(Команда)
	
	ВыполнитьКомандуБухгалтерии(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаБухгалтерия_Функциональность(Команда)
	
	ВыполнитьКомандуБухгалтерии(Команда.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьКомандуБухгалтерии(ИмяКоманды)
	
	СсылкаДляПерехода = "";
	
	// Отчеты
	Если ИмяКоманды = "КомандаБухгалтерия_ОборотноСальдоваяВедомость" Тогда
		СсылкаДляПерехода = "e1cib/command/ОбщаяКоманда.ОборотноСальдоваяВедомость";
	ИначеЕсли ИмяКоманды = "КомандаБухгалтерия_ОборотноСальдоваяВедомостьПоСчету" Тогда
		СсылкаДляПерехода = "e1cib/command/ОбщаяКоманда.ОборотноСальдоваяВедомостьПоСчету";
	ИначеЕсли ИмяКоманды = "КомандаБухгалтерия_СводныеПроводки" Тогда
		СсылкаДляПерехода = "e1cib/command/ОбщаяКоманда.СводныеПроводки";
	ИначеЕсли ИмяКоманды = "КомандаБухгалтерия_ОтчетПоПроводкам" Тогда
		СсылкаДляПерехода = "e1cib/command/ОбщаяКоманда.ОтчетПоПроводкам";
	ИначеЕсли ИмяКоманды = "КомандаБухгалтерия_ОстаткиДенежныхСредств" Тогда
		СсылкаДляПерехода = "e1cib/app/Отчет.ОстаткиДенежныхСредств";
	ИначеЕсли ИмяКоманды = "КомандаБухгалтерия_РасчетыСПокупателямиИПоставщиками" Тогда
		СсылкаДляПерехода = "e1cib/app/Отчет.РасчетыСПокупателямиИПоставщиками";
	ИначеЕсли ИмяКоманды = "КомандаБухгалтерия_ОстаткиТоваров" Тогда
		СсылкаДляПерехода = "e1cib/app/Отчет.ОстаткиТоваров";
	// Отчетность
	ИначеЕсли ИмяКоманды = "КомандаБухгалтерия_КалендарьОтчетности" Тогда
		СсылкаДляПерехода = "e1cib/command/ОбщаяКоманда.КалендарьОтчетности";
	ИначеЕсли ИмяКоманды = "КомандаБухгалтерия_РегламентированныеОтчеты" Тогда
		СсылкаДляПерехода = "e1cib/command/ОбщаяКоманда.ОткрытьФорму1СОтчетностьНаОтчетах";
	// Журналы документов
	ИначеЕсли ИмяКоманды = "КомандаБухгалтерия_ЖурналОпераций" Тогда
		СсылкаДляПерехода = "e1cib/command/ОбщаяКоманда.ЖурналОпераций";
	ИначеЕсли ИмяКоманды = "КомандаБухгалтерия_ЖурналПроводок" Тогда
		СсылкаДляПерехода = "e1cib/list/РегистрБухгалтерии.Хозрасчетный";
	ИначеЕсли ИмяКоманды = "КомандаБухгалтерия_Реализация" Тогда
		СсылкаДляПерехода = "e1cib/list/Документ.РеализацияТоваровУслуг";
	ИначеЕсли ИмяКоманды = "КомандаБухгалтерия_СчетаФактурыВыданные" Тогда
		СсылкаДляПерехода = "e1cib/list/Документ.СчетФактураВыданный";
	ИначеЕсли ИмяКоманды = "КомандаБухгалтерия_Поступление" Тогда
		СсылкаДляПерехода = "e1cib/list/Документ.ПоступлениеТоваровУслуг";
	ИначеЕсли ИмяКоманды = "КомандаБухгалтерия_СчетаФактурыПолученные" Тогда
		СсылкаДляПерехода = "e1cib/list/Документ.СчетФактураПолученный";
	ИначеЕсли ИмяКоманды = "КомандаБухгалтерия_АктыСверкиРасчетов" Тогда
		СсылкаДляПерехода = "e1cib/list/Документ.АктСверкиВзаиморасчетов";
	ИначеЕсли ИмяКоманды = "КомандаБухгалтерия_БанковскиеВыписки" Тогда
		СсылкаДляПерехода = "e1cib/command/ЖурналДокументов.Деньги.Команда.БанковскиеВыписки";
	ИначеЕсли ИмяКоманды = "КомандаБухгалтерия_КассовыеДокументы" Тогда
		СсылкаДляПерехода = "e1cib/command/ЖурналДокументов.Деньги.Команда.КассовыеДокументы";
	// Настройки
	ИначеЕсли ИмяКоманды = "КомандаБухгалтерия_Организации" Тогда
		СсылкаДляПерехода = "e1cib/command/ОбщаяКоманда.Организации";
	ИначеЕсли ИмяКоманды = "КомандаБухгалтерия_УчетнаяПолитика" Тогда
		СсылкаДляПерехода = "e1cib/command/РегистрСведений.УчетнаяПолитика.Команда.УчетнаяПолитика";
	ИначеЕсли ИмяКоманды = "КомандаБухгалтерия_Функциональность" Тогда
		СсылкаДляПерехода = "e1cib/command/ОбщаяКоманда.Функциональность";
	КонецЕсли;
	
	Если Не ПустаяСтрока(СсылкаДляПерехода) Тогда
		СовместноеИспользованиеКлиент.ПерейтиПоНавигационнойСсылкеВнешнегоПриложения(
			СсылкаДляПерехода,
			"БухгалтерияПредприятия",
			Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиМонитораЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	ПодготовитьМониторОтражения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборМонитораОрганизацииЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборОрганизация = ВыбранныйЭлемент.Значение;
	
	СохранитьНастройкиМонитора();
	
	НачатьОбновлениеДанныхМонитораНаСервере(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборМонитораПериодЗавершение(ВыбранныйПериод, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйПериод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборПериод = ВыбранныйПериод;
	
	СохранитьНастройкиМонитора();
	
	НачатьОбновлениеДанныхМонитораНаСервере(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиОтражения()
	
	НастройкаСсылка = Справочники.НастройкиОтраженияДокументовВБухгалтерии.ТекущаяНастройка();
	
	ОписаниеНастройки = Справочники.НастройкиОтраженияДокументовВБухгалтерии.ОписаниеНастройки(НастройкаСсылка);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ОписаниеНастройки, "УзелОбмена,ДатаНачалаОтражения,ОтражениеВключено");
	
	ПодключенныеОрганизации.ЗагрузитьЗначения(ОписаниеНастройки.Организации);
	ПодключенныеРазделы.ЗагрузитьЗначения(ОписаниеНастройки.РазделыУчета);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиМонитора()
	
	СохраненныеОтборы = ХранилищеОбщихНастроек.Загрузить(КлючОбъектаНастроекМонитора(), "Отборы");
	Если СохраненныеОтборы <> Неопределено Тогда
		СохраненныеОтборы.Свойство("Организация", ОтборОрганизация);
		СохраненныеОтборы.Свойство("Период", ОтборПериод);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиМонитора()
	
	ОтборыМонитора = Новый Структура;
	ОтборыМонитора.Вставить("Организация", ОтборОрганизация);
	ОтборыМонитора.Вставить("Период", ОтборПериод);
	
	ХранилищеОбщихНастроек.Сохранить(КлючОбъектаНастроекМонитора(), "Отборы", ОтборыМонитора);
	
	СформироватьИнтерфейсШапкиМонитораНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КлючОбъектаНастроекМонитора()
	
	Возврат "СовместноеИспользование.МониторОтраженияДокументовВБухгалтерии";
	
КонецФункции

&НаКлиенте
Процедура НачатьОбновлениеДанныхМонитора()
	
	НачатьОбновлениеДанныхМонитораНаСервере();
	
	ОжидатьЗавершениеОбновленияДанныхМонитора();
	
КонецПроцедуры

&НаКлиенте
Процедура ОжидатьЗавершениеОбновленияДанныхМонитора()
	
	Если ЗначениеЗаполнено(ДлительнаяОперация) Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			ДлительнаяОперация,
			Новый ОписаниеОповещения("ОбновлениеДанныхМонитораЗавершение", ЭтотОбъект),
			ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НачатьОбновлениеДанныхМонитораНаСервере(ВыполнитьОбновлениеДанных = Истина)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Данные монитора отражения документов в учете'");
	Если ВыполнитьОбновлениеДанных Тогда
		ПараметрыВыполнения.ОжидатьЗавершение = 0;
	КонецЕсли;
	
	ПараметрыФункции = Новый Структура;
	ПараметрыФункции.Вставить("ВыполнитьОбновлениеДанных", ВыполнитьОбновлениеДанных);
	ПараметрыФункции.Вставить("Отборы", Новый Структура);
	
	ПараметрыФункции.Отборы.Вставить("Период", ОтборПериод);
	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		ПараметрыФункции.Отборы.Вставить("Организации", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОтборОрганизация));
	Иначе
		ПараметрыФункции.Отборы.Вставить("Организации", Новый Массив);
	КонецЕсли;
	ПараметрыФункции.Отборы.Вставить("РазделыУчета", ПодключенныеРазделы.ВыгрузитьЗначения());
	ПараметрыФункции.Отборы.Вставить("Статусы", Новый Массив);
	ПараметрыФункции.Отборы.Вставить("ТипыДокумента", Новый Массив);
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"Обработки.ОтражениеДокументовВБухгалтерии.ПодготовитьДанныеМонитора",
		ПараметрыФункции);
		
	Если ДлительнаяОперация.Статус = "Выполняется" Тогда
		Элементы.ПанельМонитор.ТекущаяСтраница = Элементы.СтраницаОжидание;
	Иначе
		Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		    ЗаполнитьДанныеМонитораНаСервере(ДлительнаяОперация.АдресРезультата);
		ИначеЕсли ДлительнаяОперация.Статус = "Ошибка" Тогда
			ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ДлительнаяОперация.ИнформацияОбОшибке));
		ИначеЕсли ДлительнаяОперация.Статус = "Отменено" Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Задание отменено.'"));
		КонецЕсли;
		
		Элементы.ПанельМонитор.ТекущаяСтраница = Элементы.СтраницаПоказатели;
		ДлительнаяОперация = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеДанныхМонитораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.ПанельМонитор.ТекущаяСтраница = Элементы.СтраницаПоказатели;
	ДлительнаяОперация = Неопределено;
	
	Если Результат = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Задание отменено.'"));
		Возврат;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(КраткоеПредставлениеОшибки(Результат.ИнформацияОбОшибке));
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДанныеМонитораНаСервере(Результат.АдресРезультата);
	
КонецПроцедуры

#Область МониторОтраженияДокументов

&НаСервере
Функция НоваяГруппаРаздела(ИдентификаторРаздела)
	
	ГруппаРаздела = Элементы.Добавить(
		ПрефиксИмениГруппыРаздела() + ИдентификаторРаздела,
		Тип("ГруппаФормы"),
		Элементы.ГруппаМониторРазделыУчета);
	ГруппаРаздела.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаРаздела.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	ГруппаРаздела.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
	ГруппаРаздела.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаРаздела.ОтображатьЗаголовок = Ложь;
	ГруппаРаздела.ЦветФона = ЦветаСтиля.ЦветФонаРазделаУчетаБезПредупреждений;
	ГруппаРаздела.Высота = 2;
	
	Возврат ГруппаРаздела;
	
КонецФункции

&НаСервере
Функция ПрефиксИмениГруппыРаздела()
	
	Возврат "ГруппаРазделУчета_";
	
КонецФункции

&НаСервере
Процедура ДобавитьГруппуСОсновнойКомандойРаздела(ГруппаРаздела, ИдентификаторРаздела, Представление)
	
	КомандаРаздела = Команды.Добавить("КомандаРазделаУчета_" + ИдентификаторРаздела);
	КомандаРаздела.Заголовок = Представление;
	КомандаРаздела.Действие = "ОбщийОбработчикКомандыРазделаУчета";
	
	КнопкаРаздела = Элементы.Добавить(
		КомандаРаздела.Имя,
		Тип("КнопкаФормы"),
		ГруппаРаздела);
	КнопкаРаздела.Заголовок = Представление;
	КнопкаРаздела.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
	КнопкаРаздела.ИмяКоманды = КомандаРаздела.Имя;
	КнопкаРаздела.Шрифт = ШрифтыСтиля.ВажнаяНадписьШрифт;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДекорациюКартинкаСтатусаРаздела(ГруппаРаздела, ИдентификаторРаздела)
	
	ДекорацияКартинкаСтатусРаздела = Элементы.Добавить(
		"ДекорацияСтатусРазделУчета_" + ИдентификаторРаздела,
		Тип("ДекорацияФормы"),
		ГруппаРаздела);
	ДекорацияКартинкаСтатусРаздела.Вид = ВидДекорацииФормы.Картинка;
	ДекорацияКартинкаСтатусРаздела.Картинка = БиблиотекаКартинок.РазделУчетаБезПредупреждений;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДекорациюНадписьВыравниваниеРаздела(ГруппаРаздела, ИдентификаторРаздела)
	
	ДекорацияНадпись = Элементы.Добавить(
		"ДекорацияНадписьВыравнивание_" + ИдентификаторРаздела,
		Тип("ДекорацияФормы"),
		ГруппаРаздела);
	ДекорацияНадпись.Вид = ВидДекорацииФормы.Надпись;
	ДекорацияНадпись.АвтоМаксимальнаяШирина = Ложь;
	ДекорацияНадпись.РастягиватьПоГоризонтали = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеСостоянияРаздела(ИдентификаторРаздела, ЕстьПредупрежения)
	
	Если ЕстьПредупрежения Тогда
		Элементы[ПрефиксИмениГруппыРаздела() + ИдентификаторРаздела].ЦветФона = ЦветаСтиля.ЦветФонаРазделаУчетаСПредупреждениями;
		Элементы["ДекорацияСтатусРазделУчета_" + ИдентификаторРаздела].Картинка = БиблиотекаКартинок.РазделУчетаСПредупреждениями;
	Иначе
		Элементы[ПрефиксИмениГруппыРаздела() + ИдентификаторРаздела].ЦветФона = ЦветаСтиля.ЦветФонаРазделаУчетаБезПредупреждений;
		Элементы["ДекорацияСтатусРазделУчета_" + ИдентификаторРаздела].Картинка = БиблиотекаКартинок.РазделУчетаБезПредупреждений;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьИнтерфейсШапкиМонитораНаСервере()
	
	Элементы.ДекорацияОбщаяИнформация.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Включено автоматическое отражение документов с %1'"),
		Формат(ДатаНачалаОтражения, "ДЛФ=D"));
	
	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		Элементы.КомандаОтборМонитораОрганизации.Заголовок = Строка(ОтборОрганизация);
	Иначе
		Если ПодключенныеОрганизации.Количество() = 1 Тогда
			Элементы.КомандаОтборМонитораОрганизации.Заголовок = Строка(ПодключенныеОрганизации[0].Значение);
		Иначе
			Элементы.КомандаОтборМонитораОрганизации.Заголовок = НСтр("ru = 'Все организации'");
		КонецЕсли;
	КонецЕсли;
	
	Элементы.КомандаОтборМонитораПериод.Заголовок = РаботаСОтборамиКлиентСервер.ОбновитьПредставлениеПериода(ОтборПериод);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьИнтерфейсПоказателейМонитораНаСервере()
	
	ВсеРазделы = СовместноеИспользование.ДоступныеРазделыУчета();
	Для Каждого ОписаниеРаздела Из ВсеРазделы Цикл
		ИдентификаторРаздела = ОписаниеРаздела.Идентификатор;
		
		ГруппаРаздела = Элементы.ГруппаМониторРазделыУчета.ПодчиненныеЭлементы.Найти(ПрефиксИмениГруппыРаздела() + ИдентификаторРаздела);
		Если ГруппаРаздела = Неопределено Тогда
			ГруппаРаздела = НоваяГруппаРаздела(ИдентификаторРаздела);
			
			ДобавитьГруппуСОсновнойКомандойРаздела(ГруппаРаздела, ИдентификаторРаздела, ОписаниеРаздела.Представление);
			ДобавитьДекорациюНадписьВыравниваниеРаздела(ГруппаРаздела, ИдентификаторРаздела);
			ДобавитьДекорациюКартинкаСтатусаРаздела(ГруппаРаздела, ИдентификаторРаздела);
		КонецЕсли;
		
		ГруппаРаздела.Видимость = (ПодключенныеРазделы.НайтиПоЗначению(ИдентификаторРаздела) <> Неопределено);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеМонитораНаСервере(АдресРезультата)
	
	ДанныеОтражения = ПолучитьИзВременногоХранилища(АдресРезультата);
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	ТаблицаДанные = ДанныеОтражения.ТаблицаДокументов;
	
	Для Каждого ЭлементРаздел Из ПодключенныеРазделы Цикл
		ИдентификаторРаздела = ЭлементРаздел.Значение;
		
		ТаблицаДанныеПоРазделу = ТаблицаДанные.Скопировать(Новый Структура("РазделУчета", ИдентификаторРаздела));
		
		КоличествоВсего = ТаблицаДанныеПоРазделу.Количество();
		КоличествоОтражено = 0;
		КоличествоОшибок = 0;
		
		Для Каждого СтрокаДанныеПоРазделу Из ТаблицаДанныеПоРазделу Цикл
			Если СтрокаДанныеПоРазделу.ОтраженВБизнесе
				И СтрокаДанныеПоРазделу.ОтраженВБухгалтерии Тогда
				КоличествоОтражено = КоличествоОтражено + 1;
			КонецЕсли;
			Если СтрокаДанныеПоРазделу.ЕстьОшибкиОтражения Тогда
				КоличествоОшибок = КоличествоОшибок + 1;
			КонецЕсли;
		КонецЦикла;
		
		ЕстьПредупрежения = (КоличествоОтражено < КоличествоВсего) Или (КоличествоОшибок > 0);
		
		УстановитьОтображениеСостоянияРаздела(ИдентификаторРаздела, ЕстьПредупрежения);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти