
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущийПользовательИБ = Пользователи.ТекущийПользователь();
	ИдентификаторПользователя = СистемаВзаимодействия.ПолучитьИдентификаторПользователя(
		ТекущийПользовательИБ.ИдентификаторПользователяИБ);
	ТекущийПользователь = СистемаВзаимодействия.ПолучитьПользователя(ИдентификаторПользователя).ПолноеИмя;
	АдресКартинки = ПоместитьВоВременноеХранилище(СистемаВзаимодействия.ПолучитьПользователя(
		ИдентификаторПользователя).Картинка, Новый УникальныйИдентификатор);
	КартинкаТекущийПользователь = АдресКартинки;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	НовоеОбсуждение = СоздатьОбсуждениеСервер();
	Закрыть(НовоеОбсуждение);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоздатьОбсуждениеСервер()
	
	НовоеОбсуждение = СистемаВзаимодействия.СоздатьОбсуждение();
	НовоеОбсуждение.Групповое = Истина;
	НовоеОбсуждение.Отображаемое = Истина;
	ТекущийПользовательИБ = Пользователи.ТекущийПользователь();
	ИдентификаторПользователя = СистемаВзаимодействия.ПолучитьИдентификаторПользователя(
		ТекущийПользовательИБ.ИдентификаторПользователяИБ);
	НовоеОбсуждение.Участники.Добавить(ИдентификаторПользователя);
	НовоеОбсуждение.Заголовок = ТемаОбсуждения;
	НовоеОбсуждение.Записать();
	Возврат Строка(НовоеОбсуждение.Идентификатор);
	
КонецФункции

#КонецОбласти