#Область СлужебныеПроцедурыИФункции

Функция ТипыОбъектовСоСтороннимиПечатнымиФормами() Экспорт
	
	ТипыОбъектов = Новый Массив;
	ТипыОбъектов.Добавить(Тип("ДокументСсылка.Увольнение"));
	
	Возврат ТипыОбъектов;
	
КонецФункции

Процедура ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек) Экспорт
	
	КадровыйЭДО.ДобавитьНастройкуПечатнойФормы(
		ОписанияНастроек,
		Документы.СогласиеНаПрисоединениеККЭДО.ИдентификаторКомандыПечатиЗаявления(),
		НСтр("ru = 'Заявление на согласие'"),
		Перечисления.СодержимоеДокументов.НеСодержитЗарплаты,
		,
		,
		,
		Перечисления.ВариантыПодписанияДокументовКЭДО.НеобходимаСобственноручнаяПодпись);
	
	ЭлектронныеТрудовыеКнижки.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	УчетНДФЛДокументы.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	КадровыйУчет.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	УчетПособийСоциальногоСтрахования.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ЗарплатаКадрыДляНебольшихОрганизаций") Тогда
		МодульЗарплатаКадрыДляНебольшихОрганизаций = ОбщегоНазначения.ОбщийМодуль("ЗарплатаКадрыДляНебольшихОрганизаций");
		МодульЗарплатаКадрыДляНебольшихОрганизаций.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	КонецЕсли;
	
	БизнесПроцессыЗаявокСотрудников.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	ЗаявкиСотрудников.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	
КонецПроцедуры

Процедура ДокументКадровогоЭДОФормаСпискаПриСозданииНаСервере(УправляемаяФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	ТекстЗапроса = УправляемаяФорма.Список.ТекстЗапроса;
	ПозицияСкобки = СтрНайти(ТекстЗапроса, "}", НаправлениеПоиска.СКонца);
	Если ПозицияСкобки > 0 Тогда
		ТекстЗапроса = Лев(ТекстЗапроса, ПозицияСкобки - 1);
		ТекстЗапроса = ТекстЗапроса + ",
			|	(ИСТИНА В
			|		(ВЫБРАТЬ ПЕРВЫЕ 1
			|			ИСТИНА
			|		ИЗ
			|			РегистрСведений.СоставДокументовЗарплатаКадры КАК СоставДокументовЗарплатаКадры
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудниковИнтервальный КАК КадроваяИсторияСотрудниковИнтервальный
			|				ПО
			|					СоставДокументовЗарплатаКадры.ФизическоеЛицо = КадроваяИсторияСотрудниковИнтервальный.ФизическоеЛицо
			|		ГДЕ
			|			КадроваяИсторияСотрудниковИнтервальный.Подразделение В ИЕРАРХИИ (&Подразделение)
			|			И ДокументДокументКадровогоЭДО.Дата МЕЖДУ КадроваяИсторияСотрудниковИнтервальный.ДатаНачала И КадроваяИсторияСотрудниковИнтервальный.ДатаОкончания
			|			И ДокументДокументКадровогоЭДО.Ссылка = СоставДокументовЗарплатаКадры.ДокументФизическогоЛица))}";
		УправляемаяФорма.Список.ТекстЗапроса = ТекстЗапроса;
	КонецЕсли;
	
КонецПроцедуры

#Область УправлениеПечатью

// См. УправлениеПечатьюМультиязычностьПереопределяемый.ПриОпределенииДоступныхДляПереводаМакетов
Процедура ПриОпределенииДоступныхДляПереводаМакетов(Макеты) Экспорт
	
	Макеты.Добавить(Метаданные.Документы.ДокументКадровогоЭДО.Макеты.ПФ_MXL_ПустойБланкДокументаКЭДО);
	Макеты.Добавить(Метаданные.Документы.СогласиеНаПрисоединениеККЭДО.Макеты.ПФ_MXL_СогласиеНаПрисоединениеККЭДО_БумажныйДокумент);
	Макеты.Добавить(Метаданные.Документы.СогласиеНаПрисоединениеККЭДО.Макеты.ПФ_MXL_СогласиеНаПрисоединениеККЭДО_УНЭП);
	Макеты.Добавить(Метаданные.Отчеты.ДокументыКЭДОСотрудников.Макеты.ПФ_MXL_КарточкаЭлектронногоДокумента);
	Макеты.Добавить(Метаданные.Отчеты.ШаблоныДокументовКабинетСотрудника.Макеты.ПФ_MXL_ШаблонДокументаКабинетСотрудника);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
