
#Область ПрограммныйИнтерфейс

Процедура ВключитьВозможностиПриложения() Экспорт
	
	ВключитьВыключитьСовместноеИспользованиеБухгалтерии(Истина);
	
КонецПроцедуры

Процедура ОтключитьВозможностиПриложения(ИсключаяВозможностиПриложений) Экспорт
	
	ВключитьВыключитьСовместноеИспользованиеБухгалтерии(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ФункциональныеВозможностиПриложения() Экспорт
	
	ТаблицаВозможностей = ТарификацияБизнес.НоваяТаблицаВозможностей();
	
	Возврат ТаблицаВозможностей;
	
КонецФункции

Процедура ВключитьВыключитьСовместноеИспользованиеБухгалтерии(Использование)
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей = РегистрыСведений.НастройкиИнтеграцииСБухгалтерией.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		СтрокаНастройки = НаборЗаписей.Добавить();
	Иначе
		СтрокаНастройки = НаборЗаписей[0];
	КонецЕсли;
	
	СтрокаНастройки.Использование = Использование;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
