
#Область ПрограммныйИнтерфейс

// Возвращает конструктор параметров добавления штампов в документ.
//
// Возвращаемое значение:
//  Структура:
//    * ПараметрыДокумента - Структура - Параметры документа:
//       ** ДвоичныеДанные - ДвоичныеДанные - Двоичные данные документа.
//       ** Расширение     - Строка         - Значение расширения файла.
//    * ПараметрыШтампов   - Массив из Структура:
//       ** ПараметрыШтампа - Структура - Параметры картинки штампа:
//           *** ДвоичныеДанные - ДвоичныеДанные - Двоичные данные картинки штампа.
//           *** Расширение     - Строка         - Значение расширения файла картинки штампа.
//       ** ПараметрыРазмещения - Структура - Параметры размещения картинки штампа на странице документа:
//            *** Координаты - Структура - Данные координат размещения в пикселях:
//                  **** Верх - Число - Значение отступа в пикселях от верхней границы страницы документа.
//                  **** Лево - Число - Значение отступа в пикселях от левой границы страницы документа.
//            *** Расположение - Строка - Значение расположения картинки штампа на странице документа.
//                см. #Область Словарь, Пример: ВариантРасположенияВнизуПоЦентру.
//                Значение по умолчанию: ВариантРасположенияВнизуПоЦентру.
//       ** ПравилаРасположения - Структура - Правила расположения картинки штампа на страницах документа:
//            *** ПравилоРасположения - Строка - Значение правила размещения картинки штампа на страницах документа.
//                см. #Область Словарь, Пример: ПравилоРасположенияНаКаждойСтранице
//                Значение по умолчанию: НаКаждойСтранице.
//            *** НомерСтраницы - Число - Номер страницы документа для расположения картинки штампа.
//                Значение по умолчанию: 1.
//       ** ОтступОтГраниц - Число - Отступ от границ страницы документа в пикселях при установке картинки штампа.
//       ** КоэффициентИзмененияРазмера - Число - Коэффициент изменения размера картинки штампа.
//       ** Настройки - Структура - Настройки картинки штампа на странице документа:
//            *** Прозрачность - Структура - Настройки прозрачности картинки штампа:
//                  **** Прозрачный - Булево - Признак использования прозрачности.
//                  **** Уровень - Число - Значение уровня прозрачности от 0 до 255, где 0 - 100% значение прозрачности.
//
Функция НовыеПараметрыДобавленияШтамповВДокумент() Экспорт
	
	Возврат Интеграция1СШтампСлужебныйКлиентСервер.НовыеПараметрыДобавленияШтамповВДокумент();
	
КонецФункции

// Возвращает конструктор параметров картинки штампа
//
// Возвращаемое значение:
// 	Структура: 
//    * ПараметрыШтампа  - Структура - Параметры картинки штампа:
//       ** ДвоичныеДанные - ДвоичныеДанные - Двоичные данные картинки штампа.
//       ** Расширение     - Строка         - Значение расширения файла картинки штампа.
//    * ПараметрыРазмещения - Структура - Параметры размещения картинки штампа на странице документа:
//        ** Координаты   - Структура - Данные координат размещения в пикселях:
//              *** Верх - Число - Значение отступа в пикселях от верхней границы страницы документа.
//              *** Лево - Число - Значение отступа в пикселях от левой границы страницы документа.
//        ** Расположение - Строка    - Значение расположения картинки штампа на странице документа.
//               см. #Область Словарь, Пример: ВариантРасположенияВнизуПоЦентру
//               Значение по умолчанию: ВариантРасположенияВнизуПоЦентру
//    * ПравилаРасположения - Структура - Правила расположения картинки штампа на страницах документа:
//        *** ПравилоРасположения - Строка - Значение правила размещения картинки штампа на страницах документа.
//                см. #Область Словарь, Пример: ПравилоРасположенияНаКаждойСтранице
//                Значение по умолчанию: НаКаждойСтранице.
//        *** НомерСтраницы - Число - Номер страницы документа для расположения картинки штампа.
//                Значение по умолчанию: 1.
//    * ОтступОтГраниц - Число - Отступ от границ страницы документа в пикселях при установке картинки штампа.
//    * КоэффициентИзмененияРазмера - Число - Коэффициент изменения размера картинки штампа.
//    * Настройки - Структура - Настройки картинки штампа на странице документа:
//        ** Прозрачность - Структура - Настройки прозрачности картинки штампа:
//             *** Прозрачный - Булево - Признак использования прозрачности.
//             *** Уровень    - Число  - Значение уровня прозрачности от 0 до 255, где 0 - 100% значение прозрачности.
//
Функция НовыеПараметрыШтампа() Экспорт
	
	Возврат Интеграция1СШтампСлужебныйКлиентСервер.НовыеПараметрыШтампа();
	
КонецФункции

// Возвращает массив значений допустимых вариантов расположения штампов на странице документа.
//
// Возвращаемое значение:
// 	Массив Из см. #Область Словарь
//
Функция МассивВариантовРасположенияШтамповНаСтраницеДокумента() Экспорт
	
	Возврат Интеграция1СШтампСлужебныйКлиентСервер.МассивВариантовРасположенияШтамповНаСтраницеДокумента();
	
КонецФункции

// Возвращает массив значений допустимых вариантов расположения штампов на странице документа.
//
// Возвращаемое значение:
// 	Массив Из см. #Область Словарь
//
Функция МассивПравилРасположенияШтамповВДокументе() Экспорт
	
	Возврат Интеграция1СШтампСлужебныйКлиентСервер.МассивПравилРасположенияШтамповВДокументе();
	
КонецФункции

#Область ЗначенияКонстантПоУмолчанию

// Возвращает значение отступа в пикселях по умолчанию.
//
// Возвращаемое значение:
//   Число - значение отступа в пикселях. Значение по умолчанию - 10 пикселей
//
Функция ЗначениеОтступаОтКраевСтраницыПоУмолчанию() Экспорт
	
	Возврат Интеграция1СШтампСлужебныйКлиентСервер.ЗначениеОтступаОтКраевСтраницыПоУмолчанию();
	
КонецФункции

// Возвращает коэффициент прозрачности картинки штампа по умолчанию.
// Градация следующая: при значении 0 - 100% прозрачность, при значении 255 - 0% прозрачность.
//
// Возвращаемое значение:
//   Число - значение коэффициента прозрачности от 0 до 255. Значение по умолчанию - 128.
//
Функция ЗначениеКоэффициентаПрозрачностиШтампаПоУмолчанию() Экспорт
	
	Возврат Интеграция1СШтампСлужебныйКлиентСервер.ЗначениеКоэффициентаПрозрачностиШтампаПоУмолчанию();
	
КонецФункции

// Возвращает значение прозрачности картинки штампа, когда прозрачность используется.
//
// Возвращаемое значение:
//   Строка - значение прозрачности "Прозрачный".
//
Функция ЗначениеПрозрачностиПрозрачный() Экспорт
	
	Возврат Интеграция1СШтампСлужебныйКлиентСервер.ЗначениеПрозрачностиПрозрачный();
	
КонецФункции

#КонецОбласти

#Область Словарь

// Возвращает вариант расположения штампа в верхнем левом углу.
//
// Возвращаемое значение:
//   Строка - значение расположения.
//
Функция ВариантРасположенияВверхуСлева() Экспорт
	
	Возврат Интеграция1СШтампСлужебныйКлиентСервер.ВариантРасположенияВверхуСлева();
	
КонецФункции

// Возвращает вариант расположения штампа в верхнем правом углу.
//
// Возвращаемое значение:
//   Строка - значение расположения.
//
Функция ВариантРасположенияВверхуСправа() Экспорт
	
	Возврат Интеграция1СШтампСлужебныйКлиентСервер.ВариантРасположенияВверхуСправа();
	
КонецФункции

// Возвращает вариант расположения штампа вверху по центру страницы.
//
// Возвращаемое значение:
//   Строка - значение расположения.
//
Функция ВариантРасположенияВверхуПоЦентру() Экспорт
	
	Возврат Интеграция1СШтампСлужебныйКлиентСервер.ВариантРасположенияВверхуПоЦентру();
	
КонецФункции

// Возвращает вариант расположения штампа в нижнем левом углу.
//
// Возвращаемое значение:
//   Строка - значение расположения.
//
Функция ВариантРасположенияВнизуСлева() Экспорт
	
	Возврат Интеграция1СШтампСлужебныйКлиентСервер.ВариантРасположенияВнизуСлева();
	
КонецФункции

// Возвращает вариант расположения штампа в нижнем правом углу.
//
// Возвращаемое значение:
//   Строка - значение расположения.
//
Функция ВариантРасположенияВнизуСправа() Экспорт
	
	Возврат Интеграция1СШтампСлужебныйКлиентСервер.ВариантРасположенияВнизуСправа();
	
КонецФункции

// Возвращает вариант расположения штампа внизу по центру страницы.
//
// Возвращаемое значение:
//   Строка - значение расположения.
//
Функция ВариантРасположенияВнизуПоЦентру() Экспорт
	
	Возврат Интеграция1СШтампСлужебныйКлиентСервер.ВариантРасположенияВнизуПоЦентру();
	
КонецФункции

// Возвращает вариант расположения штампа произвольно по координатам.
//
// Возвращаемое значение:
//   Строка - значение расположения.
//
Функция ВариантРасположенияПоКоординатам() Экспорт
	
	Возврат Интеграция1СШтампСлужебныйКлиентСервер.ВариантРасположенияПоКоординатам();
	
КонецФункции

// Возвращает правило расположения штампа на каждой странице.
//
// Возвращаемое значение:
//   Строка - значение расположения.
//
Функция ПравилоРасположенияНаКаждойСтранице() Экспорт
	
	Возврат Интеграция1СШтампСлужебныйКлиентСервер.ПравилоРасположенияНаКаждойСтранице();
	
КонецФункции

// Возвращает правило расположения штампа на первой странице.
//
// Возвращаемое значение:
//   Строка - значение расположения.
//
Функция ПравилоРасположенияНаПервойСтранице() Экспорт
	
	Возврат Интеграция1СШтампСлужебныйКлиентСервер.ПравилоРасположенияНаПервойСтранице();
	
КонецФункции

// Возвращает правило расположения штампа на последней странице.
//
// Возвращаемое значение:
//   Строка - значение расположения.
//
Функция ПравилоРасположенияНаПоследнейСтранице() Экспорт
	
	Возврат Интеграция1СШтампСлужебныйКлиентСервер.ПравилоРасположенияНаПоследнейСтранице();
	
КонецФункции

// Возвращает правило расположения штампа на каждой странице кроме последней.
//
// Возвращаемое значение:
//   Строка - значение расположения.
//
Функция ПравилоРасположенияНаКаждойСтраницеКромеПоследней() Экспорт
	
	Возврат Интеграция1СШтампСлужебныйКлиентСервер.ПравилоРасположенияНаКаждойСтраницеКромеПоследней();
	
КонецФункции

// Возвращает правило расположения штампа на конкретной странице.
//
// Возвращаемое значение:
//   Строка - значение расположения.
//
Функция ПравилоРасположенияНаКонкретнойСтранице() Экспорт
	
	Возврат Интеграция1СШтампСлужебныйКлиентСервер.ПравилоРасположенияНаКонкретнойСтранице();
	
КонецФункции

#КонецОбласти

// Возвращает массив допустимых расширений файлов
//
// Возвращаемое значение:
//  Массив Из Строка - Массив строк расширений.
//
Функция ДопустимыеРасширенияФайловШтампов() Экспорт
	
	Возврат Интеграция1СШтампСлужебныйКлиентСервер.ДопустимыеРасширенияФайловШтампов();
	
КонецФункции

// См. Интеграция1СШтампСлужебныйКлиентСервер.РасширениеОсновногоФайлаПоддерживается
//
Функция РасширениеОсновногоФайлаПоддерживается(Расширение) Экспорт
	
	Возврат Интеграция1СШтампСлужебныйКлиентСервер.РасширениеОсновногоФайлаПоддерживается(Расширение);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область КодыСостояний

// Возвращает код состояния: запрошенный документ доступен по другому URI, указанному в заголовке в поле Location.
//
// Возвращаемое значение:
//  Число - Код состояния http.
//
Функция КодСостоянияРедиректаЗапроса() Экспорт
	
	Возврат 302;
	
КонецФункции

// Возвращает код состояния: успешный запрос.
//
// Возвращаемое значение:
//  Число - Код состояния http.
//
Функция КодСостоянияВыполнено() Экспорт
	
	Возврат 200;
	
КонецФункции

// Возвращает код состояния: ошибка данных запроса.
//
// Возвращаемое значение:
//  Число - Код состояния http.
//
Функция КодСостоянияОшибкаДанных() Экспорт
	
	Возврат 400;
	
КонецФункции

// Возвращает код состояния: был успешно создан новый ресурс доступный по URI, указанному в заголовке в поле Location.
//
// Возвращаемое значение:
//  Число - Код состояния http.
//
Функция КодСостоянияСоздано() Экспорт
	
	Возврат 201;
	
КонецФункции

// Возвращает код состояния: запрос был принят на обработку, но она не завершена.
//
// Возвращаемое значение:
//  Число - Код состояния http.
//
Функция КодСостоянияОжидание() Экспорт
	
	Возврат 202;
	
КонецФункции

// Возвращает код состояния: внутренняя ошибка сервера.
//
// Возвращаемое значение:
//  Число - Код состояния http.
//
Функция КодСостоянияВнутренняяОшибка() Экспорт
	
	Возврат 500;
	
КонецФункции

// Возвращает код состояния: шлюз не отвечает.
//
// Возвращаемое значение:
//  Число - Код состояния http.
//
Функция КодСостоянияСервисНеОтвечает() Экспорт
	
	Возврат 504;
	
КонецФункции

// Возвращает код состояния: переданный тип контента не поддерживается.
//
// Возвращаемое значение:
//  Число - Код состояния http.
//
Функция КодСостоянияКонтентНеПоддерживается() Экспорт
	
	Возврат 415;
	
КонецФункции

// Возвращает код состояния: слишком большой размер тела запроса.
//
// Возвращаемое значение:
//  Число - Код состояния http.
//
Функция КодСостоянияСлишкомБольшойРазмерТелаЗапроса() Экспорт
	
	Возврат 413;
	
КонецФункции

#КонецОбласти

#КонецОбласти
