
#Область ПрограммныйИнтерфейс

// См. ИнтеграцияShareПереопределяемый.КонтактныеЛицаСНомеромТелефона
Процедура КонтактныеЛицаСНомеромТелефона(Знач Контрагент, КонтактнаяИнформация) Экспорт
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СвязиКонтрагентКонтактСрезПоследних.Контакт КАК Контакт
	|ПОМЕСТИТЬ ВТКонтакты
	|ИЗ
	|	РегистрСведений.СвязиКонтрагентКонтакт.СрезПоследних(
	|			,
	|			Контрагент = &Контрагент
	|				И СвязьНедействительна = ЛОЖЬ) КАК СвязиКонтрагентКонтактСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактныеЛицаКонтактнаяИнформация.Ссылка КАК Ссылка,
	|	КонтактныеЛицаКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	|ИЗ
	|	ВТКонтакты КАК ВТКонтакты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформация
	|		ПО ВТКонтакты.Контакт = КонтактныеЛицаКонтактнаяИнформация.Ссылка
	|			И (НЕ КонтактныеЛицаКонтактнаяИнформация.Ссылка.ПометкаУдаления)
	|			И (КонтактныеЛицаКонтактнаяИнформация.Тип = &Тип)
	|			И (КонтактныеЛицаКонтактнаяИнформация.Вид = &ВидКонтактаКонтактногоЛица)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтрагентыКонтактнаяИнформация.Ссылка,
	|	КонтрагентыКонтактнаяИнформация.НомерТелефона
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
	|	И КонтрагентыКонтактнаяИнформация.Тип = &Тип
	|	И КонтрагентыКонтактнаяИнформация.Вид = &ВидКонтактаКонтрагента
	|	И НЕ КонтрагентыКонтактнаяИнформация.Ссылка.ПометкаУдаления"; 	
	
	ТипКонтакта						= Перечисления.ТипыКонтактнойИнформации.Телефон;
	ВидКонтактаКонтактногоЛица		= Справочники.ВидыКонтактнойИнформации["ТелефонКонтактногоЛица"].Ссылка;
    ВидКонтактаКонтрагента 			= Справочники.ВидыКонтактнойИнформации["ТелефонКонтрагента"].Ссылка;
	
	Запрос.УстановитьПараметр("Контрагент"					, Контрагент);
	Запрос.УстановитьПараметр("Тип"							, ТипКонтакта);
	Запрос.УстановитьПараметр("ВидКонтактаКонтактногоЛица"	, ВидКонтактаКонтактногоЛица);
	Запрос.УстановитьПараметр("ВидКонтактаКонтрагента"		, ВидКонтактаКонтрагента);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Контакт = ИнтеграцияShareКлиентСервер.НовыйКонтактнаяИнформация();
		Контакт.ВладелецКонтакта      = Выборка.Ссылка;
		Контакт.НомерТелефонаБезКодов = БезКодаСтраныРФ(Выборка.НомерТелефона);;
		КонтактнаяИнформация.Добавить(Контакт);
	КонецЦикла;
	
КонецПроцедуры

// См. ИнтеграцияShareПереопределяемый.ПриОпределенииСоставаКомандShare
Процедура ПриОпределенииСоставаКомандShare(СоставКоманд) Экспорт

	СоставКоманд.Входящие.Добавить(Метаданные.Документы.ЗаказПокупателя.ПолноеИмя()); 
	СоставКоманд.Входящие.Добавить(Метаданные.Документы.ЗаказПоставщику.ПолноеИмя());
	СоставКоманд.Входящие.Добавить(Метаданные.Документы.СчетНаОплатуПоставщика.ПолноеИмя());

КонецПроцедуры

// См. ИнтеграцияShareПереопределяемый.ЗаполнитьНастройкиФормированияДокумента
Процедура ЗаполнитьНастройкиФормированияДокумента(СсылкаНаДокумент, НастройкиФормирования) Экспорт
			
	ПоддерживаемыеФорматыЭДО = ФорматыЭДО.ПоддерживаемыеФорматы();
	ТипыДокументов           = ОбменСКонтрагентами.ТипыДокументов();
	НаправленияДокументов    = ОбменСКонтрагентами.НаправленияДокументов();
	
	ТипИсточника = ТипЗнч(СсылкаНаДокумент);

	Если ТипИсточника = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		Реквизиты = "Организация, Контрагент, Договор";
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент, Реквизиты);
		
		НастройкиФормирования.ТипДокумента       = ТипыДокументов.ОтветНаЗаказ;
		НастройкиФормирования.Формат             = ПоддерживаемыеФорматыЭДО.CML208;
		НастройкиФормирования.Направление        = НаправленияДокументов.Исходящий;
		НастройкиФормирования.Организация        = СсылкаНаДокумент.Организация;
		НастройкиФормирования.Контрагент         = СсылкаНаДокумент.Контрагент;
		НастройкиФормирования.ДоговорКонтрагента = ЗначенияРеквизитов.Договор;
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.СчетНаОплату") Тогда
		
		Реквизиты = "Организация, Контрагент, Договор";
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент, Реквизиты);
		
		НастройкиФормирования.ТипДокумента       = ТипыДокументов.СчетНаОплату;
		НастройкиФормирования.Формат             = ПоддерживаемыеФорматыЭДО.CML208;
		НастройкиФормирования.Направление        = НаправленияДокументов.Исходящий;
		НастройкиФормирования.Организация        = ЗначенияРеквизитов.Организация;
		НастройкиФормирования.Контрагент         = ЗначенияРеквизитов.Контрагент;
		НастройкиФормирования.ДоговорКонтрагента = ЗначенияРеквизитов.Договор;

	КонецЕсли;

КонецПроцедуры

// См. ИнтеграцияShareПереопределяемый.ПриОпределенииВизуализацииПубликуемогоДокумента
Процедура ПриОпределенииВизуализацииПубликуемогоДокумента(ОписаниеПредставленияДокумента,
	Знач ПараметрыПубликуемогоДокументаДляВизуализации, СтандартнаяОбработка) Экспорт 
	
	СтандартнаяОбработка = Ложь; 
	ОписаниеПредставленияДокумента = Новый Структура;
	ОписаниеПредставленияДокумента.Вставить("ИмяФайла", "");
	ОписаниеПредставленияДокумента.Вставить("ДвоичныеДанные", Неопределено);
		
	ОбъектУчета = ПараметрыПубликуемогоДокументаДляВизуализации.ОбъектУчета;
	
	ИмяМакета = "";
	Если ТипЗнч(ОбъектУчета) = Тип("ДокументСсылка.ЗаказПокупателя") 
		ИЛИ ТипЗнч(ОбъектУчета) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		ИмяМакета = "СчетНаОплату";
	КонецЕсли;
	
	Если ТипЗнч(ОбъектУчета) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		КомандыПечати = УправлениеПечатью.КомандыПечатиОбъекта(Метаданные.Документы.ЗаказПокупателя); 
	ИначеЕсли ТипЗнч(ОбъектУчета) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		КомандыПечати = УправлениеПечатью.КомандыПечатиОбъекта(Метаданные.Документы.СчетНаОплату);
	КонецЕсли;
	
	КомандаСчетНаОплату = КомандыПечати.Найти("СчетНаОплату");
	КомандыПечати = Новый Массив;
	КомандыПечати.Добавить(КомандаСчетНаОплату);
	
	ОбъектыДляПечати = Новый Массив; 
	ОбъектыДляПечати.Добавить(ПараметрыПубликуемогоДокументаДляВизуализации.ОбъектУчета);
	
	НастройкиСохранения = УправлениеПечатью.НастройкиСохранения();
	НастройкиСохранения.ПодписьИПечать = ПечатьДокументовУНФ.НастройкаПользователяЗаполнятьФаксимиле(ИмяМакета);
	
	ДанныеПФ = УправлениеПечатью.НапечататьВФайл(КомандыПечати, ОбъектыДляПечати, НастройкиСохранения);
	Если ДанныеПФ.Количество() Тогда
		ОписаниеПредставленияДокумента.ДвоичныеДанные = ДанныеПФ[0].ДвоичныеДанные; 
		ОписаниеПредставленияДокумента.ИмяФайла = ДанныеПФ[0].ИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту
Процедура ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	
	Если ИнтеграцияShare.ЕстьПравоИспользованияСервиса() Тогда
		
		Команда								= Команды.Добавить();
		Команда.Вид							= "Отправить";
		Команда.Идентификатор				= "ПоделитьсяДокументомShare";
		Команда.Представление				= НСтр("ru = 'Поделиться документом'", ОбщегоНазначения.КодОсновногоЯзыка());
		Команда.Важность					= "Обычное";
		Команда.Порядок						= 101;
		Команда.ОтображениеКнопки			= ОтображениеКнопки.Картинка;
		Команда.Картинка					= БиблиотекаКартинок["Поделиться"];
		Команда.ТипПараметра				= ПолучитьТипыОбъектовShare();
		Команда.ИзменяетВыбранныеОбъекты	= Ложь;
		Команда.РежимЗаписи					= "Записывать";
		Команда.Обработчик					= "ИнтеграцияShareКлиент.ПоделитьсяДокументом";
		Команда.МножественныйВыбор 			= Ложь;
		Команда.ТолькоВоВсехДействиях		= Ложь;  
	
	КонецЕсли;

КонецПроцедуры  

// См. ИнтеграцияShareПереопределяемый.ПриОпределенииДанныхПубликуемогоДокумента
Процедура ПриОпределенииДанныхПубликуемогоДокумента(ДанныеТранспортногоКонтейнера, Знач СсылкаНаДокумент) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуЗакупки") Тогда
		
		ПолныйПуть = "КарточкаПередаваемыхДанных.НастройкиПубликации.СхемаПубликации";
		Результат = ДанныеТранспортногоКонтейнера.Строки.Найти(ПолныйПуть, "ПолныйПуть", Истина);
		Если Результат <> Неопределено Тогда
			Результат.Значение = "ТолькоПубликация";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТипыОбъектовShare() Экспорт

	ТипыОбъектов = Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя, ДокументСсылка.СчетНаОплату");

	Возврат ТипыОбъектов

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция БезКодаСтраныРФ(Знач НомерТелефона)
	
	Если СтрДлина(НомерТелефона) > 0 И СтрНачинаетсяС(НомерТелефона, "7") Тогда
		НомерТелефона = Сред(НомерТелефона, 2);
	КонецЕсли;
	
	Возврат НомерТелефона;
	
КонецФункции

#КонецОбласти

