
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает установленный тип подписи для электронных документов и машиночитаемых доверенностей
//
// Параметры:
//  ТипПредметаПодписания - См. НастройкиЭдоКлиентСервер.ТипПредметаПодписанияМЧД
//  					  - См. НастройкиЭдоКлиентСервер.ТипПредметаПодписанияЭД
//
// Возвращаемое значение:
//  ПеречислениеСсылка.ТипыПодписиКриптографии - Используется настройка ЭДО по типам подписи для ЭД и МЧД
//  Неопределено - В данном случае используется настройка БСП по типам подси
Функция ТипПодписи(ТипПредметаПодписания) Экспорт
	
	Результат = Неопределено;
	
	Если ТипПредметаПодписания = НастройкиЭДОКлиентСервер.ТипПредметаПодписанияМЧД() Тогда
		Результат = Константы.ТипПодписиМЧД.Получить();
	КонецЕсли;
	
	Если ТипПредметаПодписания = НастройкиЭДОКлиентСервер.ТипПредметаПодписанияЭД()Тогда
		Результат = Константы.ТипПодписиЭД.Получить();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
