#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеСообщенияВнешнемуСайту(Действие, Отправитель, Получатель, ДополнительныеПараметры) Экспорт
	
	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("Действие", Действие);
	СтруктураСообщения.Вставить("Отправитель", Отправитель);
	СтруктураСообщения.Вставить("Получатель", Получатель);
	СтруктураСообщения.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	
	Возврат ОбщегоНазначения.ЗначениеВJSON(СтруктураСообщения);
	
КонецФункции

Функция ОписаниеДействияОтВнешнегоПриложения(Данные) Экспорт
	
	ДанныеСообщения = ОбщегоНазначения.JSONВЗначение(Данные);
	
	Если ДанныеСообщения.Получить("Действие") = "ОтправитьСообщение" Тогда
		ДополнительныеПараметры = ДанныеСообщения.Получить("ДополнительныеПараметры");
		
		Действие = ДополнительныеПараметры.Получить("Действие");
		ПараметрыДействия = ДополнительныеПараметры.Получить("Параметры");
		Если Действие = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Возврат Новый Структура("Действие,ПараметрыДействия", Действие, ПараметрыДействия);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция АдресВнешнегоПриложения(ИдентификаторПриложения) Экспорт
	
	ТекущаяНастройка = РегистрыСведений.НастройкиИнтеграцииСБухгалтерией.ТекущаяНастройка();
	
	Возврат ТекущаяНастройка.АдресПриложения;
	
КонецФункции

Функция АльтернативнаяСсылкаДляПрямогоПерехода(ИсходнаяСсылка) Экспорт
	
	Возврат "СовместноеИспользование/АльтернативнаяСсылка?src-link=" + КодироватьСтроку(ИсходнаяСсылка, СпособКодированияСтроки.КодировкаURL);
	
КонецФункции

#КонецОбласти