
#Область ПрограммныйИнтерфейс

#Область СозданиеСсылки

// См. ОнлайнЗаказыПереопределяемый.ПриОпределенииОснованияЗаказа
Процедура ПриОпределенииОснованияЗаказа(ИменаОснованийЗаказа) Экспорт
	
	ИменаОснованийЗаказа.Добавить("Документ.ЗаказПокупателя");
	
КонецПроцедуры

// См. ОнлайнЗаказыПереопределяемый.ПриОпределенииПараметровСозданияЗаказа.
//
Процедура ПриОпределенииПараметровСозданияЗаказа(
		ДокументЗаказа,
		Результат) Экспорт
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ДокументЗаказа,
		"Проведен, Контрагент, Организация");
	
	Если Не ЗначенияРеквизитов.Проведен Тогда
		Результат.СозданиеЗаказаДоступно = Ложь;
		Результат.СообщениеОбОшибке =
			НСтр("ru = 'Выставление онлайн-заказов доступно только для проведенных документов.'");
	КонецЕсли;
	
	ВидКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		ЗначенияРеквизитов.Контрагент,
		"ВидКонтрагента");
	

	Если ВидКонтрагента = Перечисления.ВидыКонтрагентов.ГосударственныйОрган Тогда

		Результат.СозданиеЗаказаДоступно = Ложь;
		Результат.СообщениеОбОшибке =
			НСтр("ru = 'Выставление онлайн-заказов не доступна для гос. органов.'");
		
	ИначеЕсли ВидКонтрагента <> Перечисления.ВидыКонтрагентов.ФизическоеЛицо Тогда
		
		НастройкиПодключения = ОнлайнЗаказы.НастройкиПодключения(ЗначенияРеквизитов.Организация).НастройкиПодключения;
		ЕстьОплата			 = НастройкиПодключения.Количество() И НастройкиПодключения[0].НастройкиОплаты.Количество();
		
		Если ЕстьОплата Тогда
			
			Результат.СозданиеЗаказаДоступно = Ложь;
			Результат.СообщениеОбОшибке =
				НСтр("ru = 'Юридическим лицам не доступна оплата СБП. Необходимо отключить использование оплаты в настройках платежной страницы.'");
				
		КонецЕсли;
			
	КонецЕсли;
	
	Результат.Организация = ЗначенияРеквизитов.Организация;
	
КонецПроцедуры

// См. ОнлайнЗаказыПереопределяемый.ПриФормированииЗаказаНаОплату.
//
Процедура ПриОпределенииПечатныхФормЗаказа(ДокументЗаказа, ПечатныеФормы) Экспорт
	
	КомандыПечатиОбъекта = ОнлайнЗаказы.КомандыПечатиОбъектаДоступныеДляВложений(
		ДокументЗаказа.Метаданные());
	
	Для Каждого КомандаПечатиОбъекта Из КомандыПечатиОбъекта Цикл
		
		Если КомандаПечатиОбъекта.Отключена
			Или КомандаПечатиОбъекта.СразуНаПринтер
			Или КомандаПечатиОбъекта.СкрытаФункциональнымиОпциями
			Или ПустаяСтрока(КомандаПечатиОбъекта.МенеджерПечати)
			Или СтрНайти(КомандаПечатиОбъекта.Идентификатор, ",") > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока                    = ПечатныеФормы.Добавить();
		НоваяСтрока.Идентификатор      = КомандаПечатиОбъекта.УникальныйИдентификатор;
		НоваяСтрока.Представление      = КомандаПечатиОбъекта.Представление;
		НоваяСтрока.ФорматСохранения   = ТипФайлаТабличногоДокумента["PDF"];
		НоваяСтрока.ИмяФайлаВТранслите = Истина;
		НоваяСтрока.ПодписьИПечать     = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

// См. ОнлайнЗаказыПереопределяемый.ПриНастройкеТаблицыТоваров.
//
Процедура ПриНастройкеТаблицыТоваров(ДокументЗаказа, ОписаниеПредставленияТоваров) Экспорт

	ЗаказНаОплату = НовыйОписаниеЗаказаНаОплату(ДокументЗаказа);

	ПриФормированииЗаказаНаОплату(ДокументЗаказа, ЗаказНаОплату);
	
	ЕстьСкидка	  = Ложь;
	
	Для Каждого СтрокаТоваров Из ЗаказНаОплату.Товары Цикл
		
		Если СтрокаТоваров.Скидка > 0 Тогда
			ЕстьСкидка = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ОписаниеПредставленияТовара Из ОписаниеПредставленияТоваров Цикл
		
		Если ОписаниеПредставленияТовара.Идентификатор = "Количество" Тогда
			ОписаниеПредставленияТовара.ПорядокОтображения = 3;
		ИначеЕсли ОписаниеПредставленияТовара.Идентификатор = "Скидка" Тогда
			ОписаниеПредставленияТовара.ПорядокОтображения = 4;
			ОписаниеПредставленияТовара.Видимость = ЕстьСкидка;
		ИначеЕсли ОписаниеПредставленияТовара.Идентификатор = "СуммаСоСкидкой" Тогда
			ОписаниеПредставленияТовара.ПорядокОтображения = 5;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// См. ОнлайнЗаказыПереопределяемый.ПриФормированииЗаказаНаОплату.
//
Процедура ПриФормированииЗаказаНаОплату(ДокументЗаказа, ЗаказНаОплату) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателя.ИдентификаторПлатежа КАК Идентификатор,
	|	ЗаказПокупателя.Номер КАК Номер,
	|	ЗаказПокупателя.Дата КАК Дата,
	|	ЗаказПокупателя.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	|	ЗаказПокупателя.БанковскийСчет КАК БанковскийСчет,
	|	ЗаказПокупателя.Организация КАК Организация,
	|	ЗаказПокупателя.Контрагент КАК Контрагент,
	|	ЗаказПокупателя.Договор.НомерДоговора КАК НомерДоговора
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка = &ОснованиеПлатежа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Запасы.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(250)) КАК Наименование,
	|	ВЫРАЗИТЬ(Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(250)) КАК НаименованиеПолное,
	|	ПРЕДСТАВЛЕНИЕ(Запасы.Характеристика) КАК Характеристика,
	|	Запасы.Количество КАК Количество,
	|	Запасы.Цена КАК Цена,
	|	Запасы.Номенклатура.Артикул КАК Артикул,
	|	Запасы.Номенклатура.Код КАК Код,
	|	ПРЕДСТАВЛЕНИЕ(Запасы.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|	ПРЕДСТАВЛЕНИЕ(Запасы.Номенклатура.ТипНоменклатуры) КАК ВидНоменклатуры,
	|	ПРЕДСТАВЛЕНИЕ(Запасы.Номенклатура.Родитель) КАК Родитель,
	|	Запасы.Номенклатура КАК Номенклатура,
	|	1 КАК ПредметРасчета,
	|	Запасы.Всего КАК Сумма,
	|	Запасы.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.ЗаказПокупателя.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.Ссылка = &ОснованиеПлатежа
	|	И НЕ Запасы.ЭтоРазделитель
	|	И Запасы.НомерВариантаКП = Запасы.Ссылка.ОсновнойВариантКП
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Работы.НомерСтроки,
	|	ВЫРАЗИТЬ(Работы.Номенклатура.НаименованиеПолное КАК СТРОКА(250)),
	|	ВЫРАЗИТЬ(Работы.Номенклатура.НаименованиеПолное КАК СТРОКА(250)),
	|	ПРЕДСТАВЛЕНИЕ(Работы.Характеристика),
	|	Работы.Количество,
	|	Работы.Цена,
	|	Работы.Номенклатура.Артикул,
	|	Работы.Номенклатура.Код,
	|	ПРЕДСТАВЛЕНИЕ(Работы.Номенклатура.ЕдиницаИзмерения),
	|	ПРЕДСТАВЛЕНИЕ(Работы.Номенклатура.ТипНоменклатуры),
	|	ПРЕДСТАВЛЕНИЕ(Работы.Номенклатура.Родитель),
	|	Работы.Номенклатура,
	|	1,
	|	Работы.Всего,
	|	Работы.СуммаНДС
	|ИЗ
	|	Документ.ЗаказПокупателя.Работы КАК Работы
	|ГДЕ
	|	Работы.Ссылка = &ОснованиеПлатежа
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	0,
	|	ВЫРАЗИТЬ(ЗаказПокупателя.НоменклатураДоставки.НаименованиеПолное КАК СТРОКА(250)),
	|	ВЫРАЗИТЬ(ЗаказПокупателя.НоменклатураДоставки.НаименованиеПолное КАК СТРОКА(250)),
	|	"""",
	|	1,
	|	ЗаказПокупателя.СтоимостьДоставки,
	|	ЗаказПокупателя.НоменклатураДоставки.Артикул,
	|	ЗаказПокупателя.НоменклатураДоставки.Код,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказПокупателя.НоменклатураДоставки.ЕдиницаИзмерения),
	|	ПРЕДСТАВЛЕНИЕ(ЗаказПокупателя.НоменклатураДоставки.ТипНоменклатуры),
	|	ПРЕДСТАВЛЕНИЕ(ЗаказПокупателя.НоменклатураДоставки.Родитель),
	|	ЗаказПокупателя.НоменклатураДоставки,
	|	1,
	|	ЗаказПокупателя.СтоимостьДоставки,
	|	ЗаказПокупателя.СуммаНДСДоставки
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка = &ОснованиеПлатежа
	|	И ЗаказПокупателя.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Самовывоз)
	|	И ЗаказПокупателя.НоменклатураДоставки <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И ЗаказПокупателя.СтоимостьДоставки <> 0";
	
	Запрос.УстановитьПараметр("ОснованиеПлатежа", ДокументЗаказа);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ВыборкаШапка 		= Результаты[0].Выбрать();
	ВыборкаНоменклатура = Результаты[1].Выбрать();
	
	// Шапка основания платежа
	Если ВыборкаШапка.Следующий() Тогда
		
		СведенияОбОрганизации = ПечатьДокументовУНФ.СведенияОЮрФизЛице(ВыборкаШапка.Организация, ВыборкаШапка.Дата,, ВыборкаШапка.БанковскийСчет);
		СведенияОКонтрагенте  = ПечатьДокументовУНФ.СведенияОЮрФизЛице(ВыборкаШапка.Контрагент, ВыборкаШапка.Дата);
		
		НомерДокумента 		  = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(ВыборкаШапка.Дата, ВыборкаШапка.Номер, ВыборкаШапка.Организация.Префикс);
		
		ЗаказНаОплату.ОбщиеПараметрыЗаказа.СрокЖизни 				= ВыборкаШапка.Дата + 30 * 24 * 60 * 60; 
		ЗаказНаОплату.ВизуализацияЗаказа.Представление 				= СтрШаблон(
			НСтр("ru = 'Заказ № %1 от %2.'"), 
			НомерДокумента, 
			Формат(ВыборкаШапка.Дата, "ДЛФ=D"));

		ЗаказНаОплату.ВизуализацияЗаказа.ПоставщикПредставление 	= СокрЛП(СведенияОбОрганизации.ПолноеНаименование);
		ЗаказНаОплату.ВизуализацияЗаказа.ПоставщикЗаголовок 		= НСтр("ru = 'Продавец'");
		ЗаказНаОплату.ВизуализацияЗаказа.ПокупательПредставление 	= СокрЛП(СведенияОКонтрагенте.ПолноеНаименование);
		ЗаказНаОплату.ВизуализацияЗаказа.ПокупательЗаголовок 		= НСтр("ru = 'Покупатель'");

		
	КонецЕсли;
	
	// Табличная часть основания платежа
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		СтрокаНоменклатуры = ЗаказНаОплату.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНоменклатуры, ВыборкаНоменклатура);
		
		СтрокаНоменклатуры.Наименование 		= ПечатьДокументовУНФ.ПредставлениеНоменклатурыДляПечати(
			ВыборкаНоменклатура.Номенклатура, 
			ВыборкаНоменклатура.Характеристика, 
			ВыборкаНоменклатура.Артикул);

		СтрокаНоменклатуры.ИдентификаторТовара  = СокрЛП(ВыборкаНоменклатура.Код);
		СтрокаНоменклатуры.СуммаСоСкидкой 		= ВыборкаНоменклатура.Сумма;
		СтрокаНоменклатуры.Скидка 				= ?(ЗначениеЗаполнено(ВыборкаНоменклатура.Цена), 
			ВыборкаНоменклатура.Цена * ВыборкаНоменклатура.Количество - ВыборкаНоменклатура.Сумма,
			0);
		
	КонецЦикла;
	
	Если ЗаказНаОплату.ПараметрыОплат.СБП <> Неопределено Тогда
		
		РеквизитыОплаты	  = ИнтеграцияСПлатежнымиСистемамиУНФ.НастройкиСБПОснованияПлатежа(ДокументЗаказа);
		НазначениеПлатежа = ИнтеграцияСПлатежнымиСистемамиУНФ.ПолучитьНазначениеПлатежа(
			ЗаказНаОплату.ПараметрыОплат.СБП.c2b.ШаблоныНазначения,
			ДокументЗаказа, 
			РеквизитыОплаты);
	
		Если ЗначениеЗаполнено(НазначениеПлатежа) Тогда
			ЗаказНаОплату.ПараметрыОплат.СБП.c2b.НазначениеПлатежа = НазначениеПлатежа;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ШаблоныСообщений

// См. ОнлайнЗаказыПереопределяемый.ПриПроверкеИспользованияШаблоновСообщенийОнлайнЗаказов.
//
Процедура ПриПроверкеИспользованияШаблоновСообщенийОнлайнЗаказов(Используется) Экспорт
	
	Используется = Истина;
	
КонецПроцедуры

// См. ОнлайнЗаказыПереопределяемый.ПриОпределенииПараметровОтправкиСообщений.
//
Процедура ПриОпределенииПараметровОтправкиСообщений(ПараметрыОтправкиСообщений) Экспорт
	
	ПараметрыОтправкиСообщений.ПараметрыОтправкиПисем.ОтправлятьПисьмаВФорматеHTML = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОтправкаСообщений

// См. ОнлайнЗаказыПереопределяемый.ПриОпределенииПредопределенныхШаблоновСообщенийОнлайнЗаказовПоТипам.
//
Процедура ПриОпределенииПредопределенныхШаблоновСообщенийОнлайнЗаказовПоТипам(Шаблоны) Экспорт 
	
	ИменаОснованийЗаказа 	  = Новый Массив;
	ПриОпределенииОснованияЗаказа(ИменаОснованийЗаказа);

	// подготовка макета шаблона
	Шаблон				  = Новый Структура("Тело, Тема, ЗначенияРеквизитов");
	МакетШаблона 		  = ПолучитьОбщийМакет("ШаблонСообщенияОплатаСБП");
	Тело 		 		  = МакетШаблона.ПолучитьТекст();
	Тема	 	 		  = НСтр("ru = 'Счет на оплату номер [ТипОснования.Номер] на сумму [ТипОснования.СуммаДокумента] руб.'");

	Тело 		 		  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		Тело,
		НСтр("ru='Благодарим за заказ и просим оплатить счет'"),
		НСтр("ru='Номер заказа:'"),
		НСтр("ru='Идентификатор плательщика:'"),
		НСтр("ru='Сумма:'"),
		НСтр("ru='Для оплаты счета перейдите по ссылке'"));
		
	ЗначенияРеквизитов 	  = Новый Структура;
	ЗначенияРеквизитов.Вставить("Номер", 					"Номер");
	ЗначенияРеквизитов.Вставить("СуммаДокумента", 			"СуммаОнлайнЗаказа");
	ЗначенияРеквизитов.Вставить("Покупатель", 				"Покупатель");          
	ЗначенияРеквизитов.Вставить("КнопкаОплатитьЧерезСБП", 	"ПредставлениеСсылкиОнлайнЗаказ");          

	Шаблон.Тело				  = Тело;
	Шаблон.Тема				  = Тема;
	Шаблон.ЗначенияРеквизитов = ЗначенияРеквизитов;

	Наименование		  	  = НСтр("ru = 'Счет на оплату через СБП (%1)'");
	ИменаОснованийПлатежа 	  = Новый Массив;
	ПриОпределенииОснованияЗаказа(ИменаОснованийЗаказа);	

	Для каждого ПолноеИмя Из ИменаОснованийПлатежа Цикл
		
		МетаданныеОбъекта   = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
		ИмяОбъекта 			= МетаданныеОбъекта.Имя;
		Представление   	= МетаданныеОбъекта.Синоним;

		ТелоШаблона			= Шаблон.Тело;
		ТемаШаблона			= Шаблон.Тема;
		
		Для Каждого ПараметрШаблона Из Шаблон.ЗначенияРеквизитов Цикл
		
        	ТелоШаблона = СтрЗаменить(ТелоШаблона, 
				"[ТипОснования." + ПараметрШаблона.Ключ + "]", 
				"[" + ИмяОбъекта + "." + ПараметрШаблона.Значение + "]");
			
        	ТемаШаблона = СтрЗаменить(ТемаШаблона, 
				"[ТипОснования." + ПараметрШаблона.Ключ + "]", 
				"[" + ИмяОбъекта + "." + ПараметрШаблона.Значение + "]");
		
		КонецЦикла;

		Если ИмяОбъекта = "АктВыполненныхРабот" Тогда //Для акта недоступно поле "Покупатель"
			ТелоШаблона = СтрЗаменить(ТелоШаблона, ИмяОбъекта + ".Покупатель", ИмяОбъекта + ".Контрагент"); 
		КонецЕсли; 
		
		ШаблонДокумента 			= Новый Структура();
		ШаблонДокумента.Вставить("ТипШаблона", 				"Письмо");
		ШаблонДокумента.Вставить("ПолноеИмяТипаНазначения",	ПолноеИмя);
		ШаблонДокумента.Вставить("Наименование", 			СтрШаблон(Наименование, Представление));
		ШаблонДокумента.Вставить("Тема", 					ТемаШаблона);
		ШаблонДокумента.Вставить("Текст", 					ТелоШаблона);

		Шаблоны.Добавить(ШаблонДокумента);
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

 #Область СлужебныеПроцедурыИФункции

// Формирует новое описание онлайн-заказа. При создании заказа
// проверяется заполнение всех свойств.
//
// Возвращаемое значение:
//  Структура - содержит описание онлайн-заказа:
//    * ОбщиеПараметрыЗаказа - Структура - описывает общие параметры заказа:
//      ** Представление - Строка - представление онлайн-заказа.
//      ** СрокЖизни - Число - содержит значение срока жизни заказа.
//         Минимальное значение - 1 минута, максимальное значение - 43 200 минут
//         (30 дней в минутах). В случае передачи значения не входящего в выше
//         описанный диапазон возвращается ошибка "НеверныйФорматЗапроса".
//    * ШапкаЗаказа - Структура - содержит описание шапки онлайн-заказа.
//      ** Поставщик - Строка - содержит данные поставщика отображаемые на странице заказа.
//      ** ПоставщикПредставление - Строка - представление поставщика (пример: Поставщик, Исполнитель, Продавец).
//      ** Покупатель - Строка - содержит данные покупателя отображаемые на странице заказа.
//      ** ПокупательПредставление - Строка - представление покупателя (пример: Покупатель, Клиент).
//      ** ДополнительнаяИнформация - Строка - дополнительная информация об онлайн-заказе.
//    * Товары - Массив из Структура - описывает товарное наполнение заказа.
//    * ОписаниеТаблицыТовары - Массив из Структура - описывает колонки товаров,
//      отображаемые пользователю на странице заказа.
//    * ПредставлениеТоваров - Массив из Структура - описывает представление товаров покупателю.
//
Функция НовыйОписаниеЗаказаНаОплату(ДокументЗаказа)
	
	ОбщиеПараметрыЗаказа = Новый Структура;
	ОбщиеПараметрыЗаказа.Вставить("СрокЖизни", 0); 
	
	ВизуализацияЗаказа = Новый Структура;
	ВизуализацияЗаказа.Вставить("Представление", "");
	ВизуализацияЗаказа.Вставить("ПоставщикПредставление",   "");
	ВизуализацияЗаказа.Вставить("ПоставщикЗаголовок",       "");
	ВизуализацияЗаказа.Вставить("ПокупательПредставление",  "");
	ВизуализацияЗаказа.Вставить("ПокупательЗаголовок",      "");
	ВизуализацияЗаказа.Вставить("ДополнительнаяИнформация", "");
	
	ЗаказНаОплату = Новый Структура;
	ЗаказНаОплату.Вставить("ОбщиеПараметрыЗаказа",  ОбщиеПараметрыЗаказа);
	ЗаказНаОплату.Вставить("ВизуализацияЗаказа",    ВизуализацияЗаказа);
	ЗаказНаОплату.Вставить("Товары",				НовыйОписаниеТаблицыТовары());
	ЗаказНаОплату.Вставить("ПараметрыОплат",		Новый Структура("СБП"));
	
	Возврат ЗаказНаОплату;
	
КонецФункции

// Формирует новое описание таблицы товаров онлайн-заказа.
//
// Возвращаемое значение:
//  ТаблицаЗначений - содержит описание таблицы товаров с перечнем обязательных колонок.
//
Функция НовыйОписаниеТаблицыТовары()
	
	Товары = Новый ТаблицаЗначений;
	
	ОписаниеЧисла = ОбщегоНазначения.ОписаниеТипаЧисло(15, 2, ДопустимыйЗнак.Неотрицательный);
	
	Товары.Колонки.Добавить("ИдентификаторТовара", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	Товары.Колонки.Добавить("Наименование",        ОбщегоНазначения.ОписаниеТипаСтрока(200));
	Товары.Колонки.Добавить("СуммаСоСкидкой",      ОписаниеЧисла);
	Товары.Колонки.Добавить("Скидка",              ОписаниеЧисла);
	Товары.Колонки.Добавить("СуммаНДС",            ОписаниеЧисла);
	Товары.Колонки.Добавить(
		"Количество",
		ОбщегоНазначения.ОписаниеТипаЧисло(15, 3, ДопустимыйЗнак.Неотрицательный));
	
	Возврат Товары;
	
КонецФункции

#КонецОбласти

